{
    "class": "2026",
    "data": "<p>Evelyn Andell was born in Brooklyn, NY on November 18th, 1907. When she was young, she moved to Sausalito, California and graduated from Tamalpais High in 1925. Andell then graduated as a nurse from St. Luke&rsquo;s Hospital in San Francisco in 1927. Andell lived in Sausalito and it seems as though she did not have any political affiliation or connected to any trade union. Yet in 1937, she sent an application to the Medical Bureau to Aid Spanish Democracy. Chief surgeon Leo Eloesser, who she had worked with as a nurse, had requested her to join his unit in Spain: the West Coast Unit. On January 15th, 1938, Andell left San Francisco for NYC with her friend and surgical nurse, Alice Elizabeth Wagnon, also requested by Dr. Eloesser.<br />\r\n<br />\r\nOn January 22nd, they sailed from NYC to Paris with another nurse in the unit, Cleo Duncan. They arrived in Paris on January 31st and, five days later, took a train to Barcelona, where they met up with Dr. Eloesser and a fourth nurse, Ave Bruzzichesi. The final addition to the unit arrived three weeks later, Dr. Leonard H. Laiser who joined as Dr. Eloesser&rsquo;s assistant. Andell started working as a general nurse in The Val Cacca Military Hospital near the Aragon Front &mdash; with many hardships. Each nurse was assigned one floor with about 50 patients each. Andell struggled with language barriers at first, and faced lack of supplies and patients who could not get out of bed. She lived without heat or hot water and ate little more than scraps. She witnessed horrifying air raids, and was stricken by terror as soldiers, women, and children were carried into the hospital. She was also astonished by the waves of refugees that arrived either on foot or donkey to the hospital, looking for a safe place to stay. Still, Andell was astonished by the resilience of the people &mdash; wounded and dying civilians and soldiers, many who were teenagers, all sang songs to keep spirits high and helped whenever they could.<br />\r\n<br />\r\nThe unit then evacuated away from the front to the Matar&oacute; Hospital about 30 kilometers from Barcelona, a large convent that had been turned into an International Hospital. There too, supplies and food were lacking, but it gradually developed into a well organized hospital and Andell found time to go down to the beach to regain her strength once in a while. Often, the unit would travel to different hospitals for a few weeks or so before returning back to Matar&oacute;. Eventually, she joined the night shift. She loved seeing the beauty of Barcelona at night and enjoyed the slightly slower nights. In mid-June 1938, Dr. Eloesser had left Spain, as did Bruzzichesi and many of her friends. Duncan had left the unit to join a different unit in Valencia. Andell, Wagnon and two Spanish boys were all that was left of the West Coast Unit at Matar&oacute;, and soon the two women planned their departure for September. Andell wrote letters to Dr. Eloesser, informing him about the conditions of their patients and their friends. The unit had become like family, and Andell cared for them very much. On September 13th, Wagnon and Andell left for Paris. The night before, the women had been thrown a fiesta&mdash; a goodbye party by their friends who they were sad to leave behind. The morning they left, Andell recalled an air raid that had destroyed a hospital building.<br />\r\n<br />\r\nAfter two days in Paris, Wagnon returned to the United States but Andell went to Norway. She felt guilty that she was doing so well outside of Spain, and hoped her friends were safe. On October 21st, 1938, she departed from Bergen, Norway, arriving in NYC two days later, and from there returned to Sausalito. In 1969, it was recorded that neither she nor Wagnon had ever been registered in the Nurse Registration Office of California. Though it is unknown when she moved, she lived unmarried in California, Mill Valley until her death on August 16th, 1998. Evelyn Andell lived to be 90 years old and was buried in Mt. Tamalpais Cemetery, San Rafael, California.<br />\r\n&nbsp;</p>\r\n",
    "school_crests": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "sources": "<p>Andell, Evelyn. &ldquo;Sausalito News, Volume LIII, Number 50, 15 December 1938.&rdquo; Sausalito News 15 December 1938 - California Digital Newspaper Collection, December 15, 1938. <a href=\"https://cdnc.ucr.edu/?a=d&amp;d=SN19381215.2.37&amp;e=-------en--20-SN-1--txt-txIN--------1%22\">https://cdnc.ucr.edu/?a=d&amp;d=SN19381215.2.37&amp;e=-------en--20-SN-1--txt-txIN--------1%22</a>.<br />\r\n<br />\r\nAndell, Evelyn. &ldquo;Sausalito News, Volume LIII, Number 51, 22 December 1938.&rdquo; Sausalito News 22 December 1938 - California Digital Newspaper Collection, December 22, 1938. <a href=\"https://cdnc.ucr.edu/?a=d&amp;d=SN19381222.2.69&amp;e=-------en--20-SN-1--txt-txIN--------1%22\">https://cdnc.ucr.edu/?a=d&amp;d=SN19381222.2.69&amp;e=-------en--20-SN-1--txt-txIN--------1%22</a>.<br />\r\n<br />\r\nAndell, Evelyn. &ldquo;Sausalito News, Volume LIII, Number 52, 29 December 1938.&rdquo; Sausalito News 29 December 1938 - California Digital Newspaper Collection, December 29, 1938. <a href=\"https://cdnc.ucr.edu/?a=d&amp;d=SN19381229.2.66&amp;e=-------en--20-SN-1--txt-txIN--------1%22\">https://cdnc.ucr.edu/?a=d&amp;d=SN19381229.2.66&amp;e=-------en--20-SN-1--txt-txIN--------1%22</a>.<br />\r\n<br />\r\nInk, Social. &ldquo;Andell, I. Evelyn.&rdquo; The Abraham Lincoln Brigade Archives, May 31, 2022. <a href=\"https://alba-valb.org/volunteers/evelyn-andell/\">https://alba-valb.org/volunteers/evelyn-andell/</a>.<br />\r\n<br />\r\n&ldquo;NYU Libraries.&rdquo; Archival Collections. Accessed April 18, 2024. <a href=\"https://specialcollections.library.nyu.edu/search/tamiment\">https://specialcollections.library.nyu.edu/search/tamiment</a>.<br />\r\n<br />\r\n&ldquo;Tampalis High Class Graduates.&rdquo; Newspapers.com, June 12, 1925. <a href=\"https://www.newspapers.com/search/\">https://www.newspapers.com/search/</a>.</p>\r\n",
    "student_fname": "Carmen",
    "student_lname": "Gomez-Villalva",
    "tags": [
        "Ave Bruzzichesi",
        "Alice Elizabeth Wagnon",
        "St. Luke’s Hospital",
        "Cleo Duncan",
        "Aragon Front",
        "California",
        "West Coast Unit",
        "Val Cacca Military Hospital",
        "Leonard H.Laiser",
        "Leo Eloesser",
        "Mataro Hospital",
        "Barcelona",
        "Nurse"
    ],
    "volunteer_fname": "Evelyn",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1BXpzDQE1RLzyxDFHl6o9xWXCu_y05eAk, https://drive.google.com/open?id=12ILl9bRiPqEOEHzfNpWYQqwnO81wfttJ",
            "src": ""
        }
    ],
    "volunteer_lname": "Andell"
}