{
    "class": "2021",
    "data": "<p>Vincent Usera was born on December 8th, 1908 in Ponce, Puerto Rico. He arrived in the United States at the age of 1 with his mother, father, and sister on April 16th, 1910 in Manhattan. When he was 17 years old, he joined the US Marines and initially served in China&rsquo;s Yangtze River (along with other unnamed locations in the region) and in Nicaragua when the marines occupied the country to battle Augusto Sandino. In Nicaragua, he fought against the Sandinista ideology which was similar to communism but with some aspects of fascism, such as nationalism. His career came to an end when he was involved in an affair with the wife of someone with a higher rank than him and was kicked out of the military; after his departure, it became knows that he was sexually involved with the wives of other officers as well. Afterward, he lived in Rhode Island with his cousin where he worked as an insurance broker and became involved in show business: a 1934 Newport newspaper article stated that Usera was the house manager of a local theatre.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>He then moved back down to New York City to his address on 280 Riverside Drive so he could sign up to volunteer in the war, planning to re-enlist in the US military. Even though they were oblivious to this information, communist officials in New York City were skeptical of his interest in the war, considering that he had no affiliation with left-wing politics and was not known to be a politically opinionated person, so it was written in his notes to keep a close eye on him. However, they were still delighted to have someone with his level of expertise and combat experience on the side of the Republic. On March 29th, 1937, he received his passport to Spain and sailed to Spain on April 28th, 1937 where he eventually arrived a month later on May 30th, 1937.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>When he first arrived in Spain, it was noted that he would always be nervous and uncertain of his statements when it came to discussions centered around leftist ideology. As a result, it was a common theory that he was sent by the Army as an intelligence agent to keep a close eye on the left-wingers and their names; another theory was that he spied on the Brigades on his own accord to restore his reputation in the US military and regain their favor. To combat these, Usera boasted that he was friends with a well-known Washington labor activist&mdash;since this claim was made in Spain, there was no way to verify if his friend existed.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>He initially served in the Washington Brigade as a commander, but Steve Nelson was unhappy with his performance in the war&mdash;since he was known to disappear in the middle of major battles&mdash;and transferred him to a base in Tarazona where he became one of the most renowned infantry instructors. Steve Nelson was worried that he had been planted in the war and told Cecil Eby, a professor at the University of Michigan, that Usera always left his post without permission when help was needed; in his diary, Merriman wrote that Usera &ldquo;doesn&rsquo;t pretend to be a brave man.&rdquo; However, he did prove useful as a trainer as he helped train the Mackenzie-Papineau Battalion, a battalion of Canadians. Before going to battle in Albacete, it was noted that Usera was &ldquo;placed in the hospital with venereal disease&rdquo; so he had to be held back in Tarazona until he was fit to serve. He served in Albacete and then disappeared to Barcelona where he was arrested and sent to Camp Lukas for trying to leave Spain without permission.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Eventually, he moved up the ranks from a trainer to company commander to Oliver Law&rsquo;s second-in-command. At the battle of Brunete, he disappeared and wasn&rsquo;t heard of by any member of the battalion. Conveniently, this was before Law&rsquo;s death in the battle. The next record of him was in Antwerp, Belgium on May 25th, 1938 where he boarded the S.S. Black Hawk to New York where he arrived on June 5th, 1938. He then vanished temporarily until 1939 where he gave a lecture titled &ldquo;Some Lessons from the Spanish War&rdquo; at the Naval Academy in Annapolis, Maryland where he covered tactics, weapons, training, and defense measures. He then resumed his military career: in 1943, he was a major; in 1944, an executive officer of a European infantry battalion; then he became involved in military intelligence&mdash;he worked under Dwight D. Eisenhower, a NATO commander. He retired in 1963 at the age of 54 as a full colonel with a Bronze Star with Oak Leaf Cluster and left the country to live in Franco&rsquo;s Spain.</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "school_crests": [],
    "sources": "<p>Hochschild, Adam.&nbsp;<em>Spain in Our Hearts: Americans in the Spanish Civil War, 1936-1939</em>. Pan Books, 2017.</p>\r\n\r\n<p>Hoff, Raymond M.&nbsp;<em>Merriman&#39;s Diaries: Exegesis</em>. Raymond Hoff, 2018.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Ink, Social.&nbsp;<em>Usera BATTASTINI, Vincent</em>. 28 May 2020, <a href=\"http://alba-valb.org/volunteers/vincent-usera/\" target=\"_blank\">alba-valb.org/volunteers/vincent-usera/</a>.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Ortiz-Carri&oacute;n, Jos&eacute; Alejandro, and Teresita Torres-Rivera.&nbsp;<em>Voluntarios De La Libertad: Puertorrique&ntilde;os En Defensa De La Rep&uacute;blica Espa&ntilde;ola 1936-1939</em>. Libros El Navegante, 2015.&nbsp;</p>\r\n",
    "student_fname": "Samuel",
    "student_lname": "Espinal Jr",
    "tags": [
        "Puerto Rican",
        "U.S. Spy",
        "Marines",
        "Trainer",
        "Company Commander",
        "Mackenzie–Papineau Battalion",
        "Immigrant"
    ],
    "volunteer_fname": "Vincent",
    "volunteer_images": [],
    "volunteer_lname": "Usera"
}