{
    "class": "2021",
    "data": "<p>Boleslav Wawrzykowski was born on April 17, 1916, in Brooklyn, New York, to Polish parents. It isn&rsquo;t known whether his parents themselves were immigrants from Poland, but this seems plausible, given the year of his birth, as two of the 20 million southern and eastern European immigrants who arrived in the United States between 1880 and 1920. Wawrzykowski completed just one year of high school before dropping out, and at some point during his younger years moved to Poland, where he lived until 1933. He returned to Brooklyn, where he lived on Wythe Avenue in Williamsburg and worked as a radio mechanic, a trade he may have learned in Poland or after leaving high school.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Three years later, when the nationalist military forces in Spain staged a coup d&rsquo;etat, Wawrzykowski found a different calling. He was an anti-fascist, and the possibility of fascist rule in another European country was untenable. So, Wawrzykowski, through the Communist party, found himself aboard the <em>Aquitania </em>on June 2, 1937, sailing for Setcases, Spain. Twenty days later, the ship arrived at a port in Catalonia, and Wawrzykowski stepped ashore as an anti-fascist volunteer in the 15th International Brigade, which contained volunteers from the United States, Britain, Spain, and parts of eastern Europe, which suited the trilingual Wawrzykowski well (he spoke, English, Polish, and Russian).&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>He was a member of the Washington Battalion, and first saw action with them at the Battle of Brunete, in July of 1937, a piece in the larger struggle for control of Madrid. Brunette was a town located on the outskirts of Madrid, and the Republican forces attacked it in an attempt to relieve some of the pressure of the Nationalist assault. While initially successful, the Republicans eventually were forced to retreat due to the devastating casualties inflicted upon them. The Washington Battalion alone lost close to half of its volunteers, and was later merged with the Lincoln Battalion, as the deaths were too difficult to quickly replace.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Wawrzykowski continued to fight with the new combined battalion, nearly dying at Fuentes de Ebro when a plane exploded in front of his trench, until November 25, 1938, when he returned home aboard the <em>Manhattan</em>. He lived at a couple addresses in the city, staying in Manhattan upon his return, before moving back to Brooklyn, where he shared an address with a friend named Sam Jagan. Wawrzykowski worked at the American Holding Umbrella Company for a man named Charles Laden until Jun 5, 1941, when he enlisted in the US Army to fight in World War II. Curiously, military documents identify him as single, but he claimed in one letter to have a &ldquo;Spanish wife.&rdquo;&nbsp;</p>\r\n\r\n<p>Staff Sergeant Wawrzykowski (though he described himself as a &ldquo;Radio Sergeant&rdquo;) initially was stationed in Hawaii, though by July of 1944 he had come back stateside, at that point being stationed at Camp Howze, in Texas. Wawrzykowski remained committed to the Lincoln Brigade, though, writing numerous letters while serving to other former volunteers requesting issues of <em>Volunteer for Liberty</em>, a newspaper run by other volunteers, as well as records from the war. Wawrzykowski also wrote that he felt discriminated against as an anti-fascist and thought that he&rsquo;d been turned down promotions for his beliefs. In one letter, he wondered openly whether he was fighting on the side of fascism or anti-fascism. Wawrzykowski had requested to go to China, and later to Italy, but his requests had been denied.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>As a member of the 32nd Cavalry Reconnaissance Troop, Wawrzykowski went to Normandy in mid 1944, where he suffered an ankle injury while taking shelter from enemy fire, for which he was admitted to a hospital. On March 3, 1945, while fighting in Germany, Wawrzykowski was shot in the neck and killed. He was buried at a United States Air Force cemetery in Santa Barbara, California.</p>\r\n",
    "school_crests": [],
    "sources": "<p>Alperin, Elijah, and Batalova, Jeanne. &ldquo;European Immigrants in the United States.&rdquo; <em>Migration&nbsp;</em></p>\r\n\r\n<p><em>Policy Institute</em>, 2018,&nbsp;</p>\r\n\r\n<p><a href=\"https://www.migrationpolicy.org/article/european-immigrants-united-states-2016\" target=\"_blank\">https://www.migrationpolicy.org/article/european-immigrants-united-states-2016</a>.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Sail; Scope of Soviet Activity; Figures List; Complete List of Americans on File; RGASPI Fond</p>\r\n\r\n<p>545, Opis 6, Delo 845, II. 28. Inventario Cartoteca XV Brigada Nacionalidad North&nbsp;</p>\r\n\r\n<p>Americano Barcelona May 3, 1938.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Wawrzykowski, Boleslav. <em>Boleslav Wawrzykowski to Abraham Lincoln Brigade</em>. Letter</p>\r\n\r\n<p>(accessed 26 April 2021).</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Wawrzykowski, Boleslav. <em>Boleslav Wawrzykowski to Smith</em>. Letter (accessed 26 April 2021).</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Wawrzykowski, Boleslav. <em>Boleslav Wawrzykowski to Harold</em>. Letter (accessed 26 April 2021).</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&ldquo;Brigade XV | Abraham Lincoln | Anglo-American.&rdquo; <em>Universitat de Barcelona</em>,&nbsp;</p>\r\n\r\n<p><a href=\"http://sidbrint.ub.edu/ca/content/brigada-xv-abraham-lincoln-anglonordamericana\" target=\"_blank\">http://sidbrint.ub.edu/ca/content/brigada-xv-abraham-lincoln-anglonordamericana</a>.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&ldquo;Full Records.&rdquo; <em>The National Archives</em>, 2002,&nbsp;</p>\r\n\r\n<p><a href=\"https://aad.archives.gov/aad/record-detail.jsp?dt=893&amp;mtch=1&amp;cat=GP23&amp;tf=F&amp;q=Wa\" target=\"_blank\">https://aad.archives.gov/aad/record-detail.jsp?dt=893&amp;mtch=1&amp;cat=GP23&amp;tf=F&amp;q=Wa</a></p>\r\n\r\n<p>wrzykowski&amp;bc=sl&amp;sort=24993%20desc&amp;rpp=10&amp;pg=1&amp;rid=2762264.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&ldquo;Kings County.&rdquo; <em>The National Archives</em>,&nbsp;</p>\r\n\r\n<p><a href=\"https://nara-media-001.s3.amazonaws.com/arcmedia/media/images/29/14/29-1337a.gif\" target=\"_blank\">https://nara-media-001.s3.amazonaws.com/arcmedia/media/images/29/14/29-1337a.gif</a>.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&ldquo;The Battle of Brunete.&rdquo; <em>International Brigade Memorial Trust</em>,&nbsp;</p>\r\n\r\n<p><a href=\"http://www.international-brigades.org.uk/content/battle-brunete\" target=\"_blank\">http://www.international-brigades.org.uk/content/battle-brunete</a>.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&ldquo;Wawrzykowski, Boleslav.&rdquo; <em>Universitat de Barcelona</em>,&nbsp;</p>\r\n\r\n<p><a href=\"http://sidbrint.ub.edu/ca/content/wavzikowski-boreslov\" target=\"_blank\">http://sidbrint.ub.edu/ca/content/wavzikowski-boreslov</a>.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&ldquo;Wawrzykowski, Boleslav.&rdquo; <em>Abraham Lincoln Brigade Archives</em>,&nbsp;</p>\r\n\r\n<p><a href=\"https://alba-valb.org/volunteers/boleslav-wawrzykowski/\" target=\"_blank\">https://alba-valb.org/volunteers/boleslav-wawrzykowski/</a>.</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "student_fname": "Luca",
    "student_lname": "Bielski",
    "tags": [
        "Polish",
        "Washington Battalion",
        "WWII Veteran",
        "Brunette Offensive",
        "Veterans of the Abraham Lincoln Brigade"
    ],
    "volunteer_fname": "Boreslav",
    "volunteer_images": [],
    "volunteer_lname": "Wawrzykowski"
}