{
    "class": "2023",
    "data": "<p>Paul Goldberg (who also went by Pincus Goldberg) was born on December 8th, 1914 in New York City. He lived at 1298 Brook Avenue, Bronx in the Morrisania area. During the early 1900s Morrisania was undergoing a large influx of primarily European immigrants who moved into tenement buildings in the area. During this wave of immigration these immigrants were mostly from Eastern Europe where importantly, there were many Jewish people who wanted to leave Eastern Europe. It&rsquo;s likely that Paul&rsquo;s parents were part of this wave of Eastern European and largely Jewish immigration. Growing up in New York during the 1920s and 30s was not easy for Paul. Anti-semitism was still a common occurrence in many parts of the United States and New York City too. When Paul was just 14 years old the Stock market crashed sparking the Great Depression. Paul would have been witness to many people around him losing their jobs and falling into financial hardship. Paul claims that he himself did work as a clerk but also listed himself as having a profession in first aid. Other sources also claim that he worked as a nurse or a doctor at some point. Regardless Paul was better off than most during the Depression, and the suffering of those around Paul would have been obvious.<br />\r\n<br />\r\nDuring the early 1930s word of the rise of fascism reached the United States along with fascism&rsquo;s hatred of the Jewish people. So when Paul heard about the fight against Fascism in Spain he was motivated to join the effort to defeat fascism and in a way defend his people. By 1937 Paul would be affiliated with the communist party, a decision that probably stemmed from what he witnessed during the great depression coupled with the party&rsquo;s efforts to organize Americans to fight in Spain. Paul would get his passport on May 26th, 1937, and would sail for France on June 2nd on board the RMS Aquitania with many other American volunteers. Notably, the American government threatened to revoke the passports of Americans who went to fight in Spain so Paul would have only had his passport for a short time.<br />\r\n<br />\r\nPaul would arrive in Spain via the municipality of Setcases on June 18th. Paul would start using the nickname Pincus during his time in Spain. Paul would join the 15th international brigade as a soldier and was initially attached to the Mackenzie-Papineau Battalion and went to a training camp in Tarazona from June 29th to August 7th. The Mackenzie-Papineua battalion was a primarily Canadian battalion. Afterward, he would be attached to the Lincoln-Washington Battalion until August 20th. Then he would go to the English battalion which he would serve with until October 14th. Some other sources say that Paul served with the signal platoon or transmisiones in Spanish. The signal platoon served to transmit communications between parts of the Republican forces, within the battalion it allowed the battalion to communicate with its companies.<br />\r\n<br />\r\nPaul would participate in the battle of Belchite which were a series of operations by Republican forces in the region of Aragon in an attempt to slow down nationalist advances in northern Spain. Within this battle, Paul would fight at the villages of Quinto and Mediana. Paul would later fight in the Battle of Fuentes de Ebro in late 1937. During this battle, Paul would be wounded in his left hand on October 14th. For his injury, Paul was sent to Benicassim Hospital from October 19th, 1937 to January 15th, 1938. He would be transferred to Mercia Hospital the next day and would stay there until March 25th.<br />\r\n<br />\r\nAround this time the Nationalists would begin the Aragon offensive which would end up splitting the Republican-held territories into two by the middle of April. Paul would fight during the retreat of the 15th in this battle. Afterward, the International soldiers marched through Catalonia toward France. Paul managed to successfully cross the border into France. Paul and about 50 other Abraham Lincoln brigade volunteers would take the RMS Ausonia from Le Havre, France back to New York arriving on December 20th, 1938. Paul would later go on to continue the fight against fascism by serving in the American Armed Forces during World War 2 as a nurse.</p>\r\n",
    "school_crests": [],
    "sources": "<p>Woll, Kris. &ldquo;Through The City, To These Fields: Eastern European Immigration.&rdquo; Essay - Eastern european immigration. Accessed June 8, 2023. <a href=\"http://americancenturies.mass.edu/classroom/curriculum_12th/unit3/lesson3/bkgdessay.html#:~:text=Between%201880%20and%201914%2C%20at,immigrants%20landed%20on%20U.S.%20shores\">http://americancenturies.mass.edu/classroom/curriculum_12th/unit3/lesson3/bkgdessay.html#:~:text=Between%201880%20and%201914%2C%20at,immigrants%20landed%20on%20U.S.%20shores</a>.<br />\r\n<br />\r\nHartman, David. &ldquo;A Walk through the Bronx . History: Thirteen/WNET.&rdquo; A Walk Through the Bronx . History | Thirteen/WNET. Accessed June 8, 2023. <a href=\"https://www.thirteen.org/bronx/history2.html\">https://www.thirteen.org/bronx/history2.html</a>.<br />\r\n<br />\r\nInk, Social. &ldquo;Goldberg, Paul.&rdquo; The Abraham Lincoln Brigade Archives, August 17, 2022. <a href=\"https://alba-valb.org/volunteers/paul-goldberg/\">https://alba-valb.org/volunteers/paul-goldberg/</a>.<br />\r\n<br />\r\nButwin, Joe. &ldquo;Salud y Shalom: American Jewish Volunteers in Spain.&rdquo; The Volunteer, August 16, 2021. <a href=\"https://albavolunteer.org/2021/08/salud-y-shalom-american-jewish-volunteers-in-spain/\">https://albavolunteer.org/2021/08/salud-y-shalom-american-jewish-volunteers-in-spain/</a>.<br />\r\n<br />\r\nBrooks, Chris. &ldquo;Jarama Series the Regiments.&rdquo; The Volunteer, The Abraham Lincoln Brigade Archives, 13 July 2016, <a href=\"https://albavolunteer.org/2016/07/jarama-series-16-the-regiments/\">https://albavolunteer.org/2016/07/jarama-series-16-the-regiments/</a>.<br />\r\n<br />\r\nSugarman, Martin. Jews in the Spanish Civil War, Jewish Virtual Library, <a href=\"https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war\">https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war</a>.<br />\r\n<br />\r\nДокументы советской эпохи: просмотр единицы хранения. Accessed June 8, 2023. <a href=\"https://sovdoc.rusarchives.ru/sections/organizations/cards/230092/images\">https://sovdoc.rusarchives.ru/sections/organizations/cards/230092/images</a>.<br />\r\nPaul Goldberg&rsquo;s files are located in pages 8 and 9 of this section of the archives</p>\r\n",
    "student_fname": "Curt",
    "student_lname": "Lin",
    "tags": [
        "Member of Communist Party",
        "Mediana",
        "Fuentes de Ebro",
        "WWII",
        "Jewish",
        "Battle of Belchite",
        "Quinto",
        "Lincoln-Washington Battalion",
        "Mackenzie-Papineau battalion",
        "Benicassim",
        "Mercia Hospital",
        "Nurse"
    ],
    "volunteer_fname": "Paul \"Pincus\"",
    "volunteer_images": [],
    "volunteer_lname": "Goldberg"
}