{
    "class": 2024,
    "data": "<p>Just over a year before the end of WWI, Harry Ain was born on August 5th, 1917, in Rockville, Connecticut. Rockville was a small town of around 7000 people, with its population largely driven by a textile mill that was established in 1821. Since the late 1800s, it was composed of a large German and Polish population, with heavy German influences in particular. <br /><br />After a one-year stint in the US army, Ain moved to New York, where he attended three years of evening classes at City College. City College was the first college institution in the United States to offer free tuition, and was known as “The Harvard of the Proletariat” due to its top-class education at a cheap price. In particular, Ain would have been surrounded by dozens of brilliant Jewish students who had been excluded by discriminatory Ivy League admissions policies. Outside of school, Ain was also intertwined with the Jewish community in his personal life. He lived at a small house on 1527 43rd St., in the Brooklyn neighborhood of Borough Park. With Yiddish as the common language of choice, this neighborhood was largely populated by middle-class Hasidic Jewish immigrants—and Borough Park currently houses nearly 50% of the entire Jewish population in Brooklyn. It’s speculated that Ain may have been Jewish himself, and in any case he would have had close relationships with many Jewish peers.<br /><br />Due to City College’s population of ambitious, working class students, it was also a feeding ground for radicalism. The university was impregnated with demonstrative energy, with anti-fascist rallies and peace protests happening regularly. Ain was no stranger to these attitudes, joining the Young Communist League in 1933, and the official Communist Party in 1935. In the daytime—in addition to his parttime job as a clerk—he worked as a Daily Worker Agent. The Daily Worker was a Communist magazine that was founded in 1924. While starting initially as Communist Party Line, the newspaper eventually broadened to reflect more widespread left-wing opinion. In addition to collaborating with CP bigwigs, Ain would have worked alongside artistic legends such as singer-song writer Woody Guthrie, and cartoonist Syd Hoff, who illustrated Danny and the Dinosaur.<br /><br />When the Spanish Civil War began in July of 1936, City College’s socialist student population was eager to volunteer in the fight against facism, and Ain was no exception. All in all, more than forty City College students, alumni, and faculty aided the Republic, more than any other higher education institution outside of Spain. While the United States did not explicitly endorse these efforts, they have since been honored—in fact, a plaque now hangs at City College commemorating thirteen of the enlisted men who died in battle. However, Ain’s service has not received this written recognition. In anticipation of going abroad to serve, Ain filed for a passport, which he received on May 27, 1937. All his papers now secured, Ain boarded a ship to Setcases, where he arrived on June 19. Ain promptly enlisted with the International Brigade just three days later, and served with the Mackenzie-Papineau Battalion, a subset of the Abraham Lincoln Brigade. <br /><br />The Mackenzie-Papineau Battalion (Mac Paps) was the main battalion in which Canadian volunteers enlisted, but it was largely composed initially of American and English infantrymen—meaning that Ain could train easily without needing to learn a new language. While the rest of the brigade was militarily engaged at regions such as Aragon, Ain and his fellow soldiers were fortunate enough to receive advanced training within the battalion from combat veterans. With more Canadians joining the Battalion during this time, Ain soon became a minority, but still received invaluable leadership from Americans like Robert Thompson—who not only commanded the battalion, but later became the leader of the US Communist Party. <br /><br />Ain entered active combat in September 1937, as the Mac Paps arrived to Aragon, where they were instructed to gain control of the town Fuentes de Ebro. This attack was catastrophic for the battalion, as soldiers were accidentally crushed by their own side’s tanks—and the soldiers inside the tanks were pummelled by fascist gunpowder. Nevertheless, Ain survived to fight another day. After facing a difficult battle at Teruel, the battalion began to retreat, demoralized, but unfortunately faced continuous attacks from the nationalist army. On a larger scale, the entire Republican army had begun to lose hope, and as a final effort, they launched an offensive across the Ebro. This was the largest battle of the war, and it unfortunately took Ain’s life on July 9th of 1938, just over two weeks before the Mac Paps would cross the Ebro River. </p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1lyDNoYJdgZT2iaDTLQFt6dsmLscp2INj, https://drive.google.com/open?id=1YSjHRMgVNnIuahfFCP7MJHliRlKdSSrj",
            "src": ""
        }
    ],
    "sources": "<p>“Ain, Harry Biography.” The Abraham Lincoln Brigade Archives, Alba, 24 May 2022, alba-valb.org/volunteers/harry-ain/. <br />“Canadians in Spain: The Mackenzie-Papineau Battalion.” Warfare History Network, 23 Feb. 2023, warfarehistorynetwork.com/article/mackenzie-papineau-battalion/. <br />“CUNY Digital History Archive.” Omeka RSS, cdha.cuny.edu/collections/show/182. Accessed 29 Apr. 2024. <br />“The Daily Worker (Chicago, Ill.; New York, N.Y.) 1924-1958.” The Library of Congress, www.loc.gov/item/sn84020097/. Accessed 29 Apr. 2024. <br />Gardener-Stanley. History of Vernon and Rockville 1936, tankerhoosen.info/documents/Stanley_History_Revised.pdf. Accessed 29 Apr. 2024. <br />“In Memory of the City College of New York, Alumni, Students and Teachers - the Volunteer.” The Volunteer - Founded by the Veterans of the Abraham Lincoln Brigade, 14 Mar. 2019, albavolunteer.org/2019/03/in-memory-of-the-city-college-of-new-york-alumni-students-and-teachers/. <br />“1940s NYC: Street Photos of Every Building in New York City in 1939/1940.” 1940s NYC | Street Photos of Every Building in New York City in 1939/1940, 1940s.nyc/map/photo/nynyma_rec0040_3_05362_0068#17.5/40.635397/-73.983316. Accessed 29 Apr. 2024. <br />Sugarman, Martin. “Jews in the Spanish Civil War.” Jewish Virtual Library, www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war. Accessed 29 Apr. 2024</p>",
    "student_fname": "Sarah",
    "student_lname": "Diaz",
    "tags": [
        "Young Communist League; Community Party; City College; Daily Worker; Mackenzie-Papineau Brigade; Died in Spain; Ebro Offensive"
    ],
    "volunteer_fname": "Harry",
    "volunteer_images": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "volunteer_lname": "Ain",
    "year_published": 2024
}