{
    "class": "2025",
    "data": "<p>Walter (William) Richter was a German-born American who participated in the Spanish Civil War as a member of the Abraham Lincoln Brigade. He was born in 1903 in Ronneburg, located near the center of Germany. At some point in his life, he traveled to Bremen to embark on a voyage to New York City. On February 23, 1927, he departed from Bremen on a ship called the Stuttgart, which was bound for New York. After a journey of several days, he arrived in New York on March 5, 1927. Walter was 24 years old at the time of his arrival and was a mechanist.<br />\r\n<br />\r\n<br />\r\n1927 was part of a time when the United States was going through a period of social and economic change. The stock market in the United States was reaching new limits, and people believed that growth was endless. However, immigration to the United States was restricted due to the Immigration Act of 1924, also known as the Johnson-Reed Act. This law established quotas, limiting the number of immigrants who could come to the United States each year. Walter Richter was fortunate to come to America and take advantage of the rapid industrialization and growth that provided more job opportunities.<br />\r\n<br />\r\n<br />\r\nWalter Richter settled in New York City and would live on 50 E. 13th Street in lower Manhattan. Walter would become involved in leftist politics, joining the Communist Party in 1933. 50 E. 13th Street is located in Greenwich Village. Greenwich Village was a center of leftist politics and home to many members and sympathizers of the Communist Party. During the 1930s and 1940s, communism was at the peak of its popularity. The Communist Party U.S.A would even move its headquarters to Manhattan at 35 East 12th Street. New York would become the capital city of American communism. However, during this time, America was hit with the Great Depression, which began in 1929 and lasted for over a decade. Not only did this financially ruin many Americans, but it also increased the appeal of communism to many people who were looking for a way out of their social and economic problems. Many people began to either join the Communist Party or became sympathizers. Walter Richter may have joined the Communist Party due to the hardships he faced and his willingness to fight for change.<br />\r\n<br />\r\n<br />\r\nWhen the Spanish Civil War broke out, Walter Richter saw his chance to fight against fascism and make his mark in history. He sailed aboard the Berengaria on January 20, 1937, and arrive in Spain on February 4, 1937, to fight for the Republicans. He would serve with the XV International Brigade, also known as the Abraham Lincoln Brigade. In the RGASPI Archives, it is stated that &ldquo;little known of him.&rdquo; Throughout the war, Walter was frequently in the hospital. Despite his time spent recovering, Walter managed to participate in the Battle of Brunete, a battle that unfolded right outside of Madrid in July 1937. The Battle of Brunete was part of the Republicans&#39; larger offensive strategy to relieve pressure on Madrid and gain an advantage. The offensive achieved little real success for the Republicans. One week later, Nationalist forces were able to recapture Brunete. The inability to make a solid breakthrough, losing valuable troops and resources, was slowly becoming a theme for the Republic. As a member of the Washington Battalion within the International Brigades, Walter Richter fought alongside volunteers from various countries. However, Walter was one of those wounded. On January 18th, 1938, Walter Richter and another volunteer, Peter Frye, were sent to Albacete for repatriation. This was due to his passport being expired on January 1938. Walter would board the Normandie as a stowaway and would reach New York once again on May 30, 1938. However, since Walter Richter&rsquo;s passport was expired, he was forced to self-deport on December 28, 1938.<br />\r\n<br />\r\n<br />\r\nThe 1930s were a time of great political and social upheaval. The rise of fascism, and the growing popularity of communism in the United States, would be a part of this time. Walter Richter&#39;s story provides a glimpse into the experiences of the many individuals who were caught up in these larger historical events and how they navigated through them.</p>\r\n",
    "school_crests": [],
    "sources": "<p>American Experience. &ldquo;Communism&rsquo;s Appeal Grows During the Great Depression.&rdquo; PBS LearningMedia, WGBH Educational Foundation, 2003, <a href=\"https://ny.pbslearningmedia.org/resource/amex31m-soc-communism/communisms-appeal-grows-during-the-great-depression-mccarthy/\">https://ny.pbslearningmedia.org/resource/amex31m-soc-communism/communisms-appeal-grows-during-the-great-depression-mccarthy/</a>.<br />\r\n<br />\r\nAbraham Lincoln Brigade Archives. &ldquo;Walter Richter.&rdquo; Abraham Lincoln Brigade Archives, <a href=\"https://alba-valb.org/volunteers/walter-richter/.C-SPAN Classroom. “American Communism in the 1930s.” C-SPAN Classroom, National Cable Satellite Corporation, 2014, https://www.c-span.org/classroom/document/?20644\">https://alba-valb.org/volunteers/walter-richter/.C-SPAN Classroom. &ldquo;American Communism in the 1930s.&rdquo; C-SPAN Classroom, National Cable Satellite Corporation, 2014, https://www.c-span.org/classroom/document/?20644</a>.<br />\r\n<br />\r\nC-SPAN Classroom. &ldquo;American Communism in the 1930s.&rdquo; C-SPAN Classroom, National Cable Satellite Corporation, 2014, <a href=\"https://www.c-span.org/classroom/document/?20644\">https://www.c-span.org/classroom/document/?20644</a>.<br />\r\n<br />\r\nSpartacus Educational Publishers Ltd. &ldquo;The Battle of Brunete.&rdquo; Spartacus Educational Publishers Ltd., 2021, <a href=\"https://spartacus-educational.com/SPbrunete.htm\">https://spartacus-educational.com/SPbrunete.htm</a>.<br />\r\n<br />\r\nThe Russian State Archive of Social and Political History (RGASPI). &ldquo;Documents of the Communist Party of the Soviet Union.&rdquo; The Russian State Archive of Social and Political History (RGASPI), 1937, <a href=\"https://sovdoc.rusarchives.ru/sections/organizations//cards/232917/images\">https://sovdoc.rusarchives.ru/sections/organizations//cards/232917/images</a>.<br />\r\n<br />\r\nVogel, Lise. &ldquo;When New York City Was the Capital of American Communism.&rdquo; The New York Times, 20 Oct. 2017, <a href=\"https://www.nytimes.com/2017/10/20/opinion/new-york-american-communism.html\">https://www.nytimes.com/2017/10/20/opinion/new-york-american-communism.html</a>.</p>\r\n",
    "student_fname": "Byung",
    "student_lname": "Kim",
    "tags": [
        "Brunete Offensive",
        "SS Normandie",
        "Immigrant",
        "Mechanist",
        "Member Of Communist Party",
        "German",
        "Battle of Brunete"
    ],
    "volunteer_fname": "Walter (William)",
    "volunteer_images": [],
    "volunteer_lname": "Richter"
}