{
    "class": "2022",
    "data": "<p>Philip Cooperman was born to a Jewish family circa 1908. He was a member of the ROTC (Reserve Officers&rsquo; Training Corps) for 3 years prior to the war. He most likely did not serve in the Great War, since he would&rsquo;ve been just 6 years old at its onset, and 10 by its conclusion, meaning his military service came during the interwar period. He was a bacteriologist, and joined the communist party in 1934. He resided in 345 East 18th Street, located in Gramercy Park, which is slightly north of the Lower East Side, which was predominantly Jewish in the early 20th century, although many began to leave it in the 1920s and 1930s for other neighborhoods. Philip Cooperman was most likely part of that wave of immigration out of the Lower East Side. However, there is a distinct possibility that Cooperman was not part of the great wave of Jewish migration into the United States during the late 19th and early 20th centuries, which mostly originated in Eastern Europe, and that he was either the descendant of German Jews that immigrated earlier or that he was an immigrant himself, arriving in the U.S. after the Great War.<br />\r\n<br />\r\nAs a communist, he probably felt inspired to travel to Spain and fight on behalf of the Spanish Republic. Furthermore, as a Jew, he most likely felt the same sentiments as many of his fellow Jewish combatants, who were eager to fight the fascist menace that had terrorized Jews across Europe. He obtained a passport (# 356256) on December 7, 1936, and sailed for Spain on the SS Normandie on December 26, 1936. He arrived in Spain on January 6, 1937, where he served with the Lincoln Battalion as a member of the 15th International Brigade, which was mostly comprised of English-speaking, North American volunteers. He was a staff officer and Battalion Secretary. Shortly after arriving in Spain, Cooperman became acquainted with Robert Merriman, who would eventually come to lead the Battalion. According to Merriman&rsquo;s diary, the two first met on February 9, 1937, most likely in the Albacete headquarters. The two had an evening walk 2 days later on the 11th. During the tumult of the Brigade&rsquo;s earliest months, Cooperman became involved in a power struggle with Marvin Stern for the post of political commissar. Eventually, the post was filled by a triumvirate consisting of Cooperman, Stern, and Bernard Walsh. Like most American volunteers, Cooperman fought in the Jarama Valley. During the battle, he was approached by Joe Gordon, who tried to get help for his injured comrades. Cooperman, however, wanted nothing to do with it, so he relayed Gordon to HQ, where Merriman, beset with problems, sent him back to Cooperman, after which he would take actions into his own hands. During the February 27, 1937 attack on Pingarr&oacute;n, which left the Abraham Lincoln Battalion heavily crippled due to the loss of many members, including several leaders, Cooperman, according to Merriman, ended up taking control of the attack after being handed commanded by David Jones, with Bob Thompson being second in command. However, there are sources that contradict Merriman&rsquo;s diary, as some claim that Cooperman took command without receiving it from Jones, and then passed it to Van den Berghe, whereas another source states that Cooperman refused command, and it was instead taken up by Cuban volunteer Arturo Corona. In Cecil D. Eby&rsquo;s book, &ldquo;Comrades and Commissars: The Lincoln Battalion in the Spanish Civil War&rdquo;, he claims that Cooperman actively refused to take command from Merriman and that he wanted no part in the fighting. Eby gives a very negative picture of Cooperman in general, painting him as a pudgy, political, secretary who only values his life, which contrasts greatly with Merriman&rsquo;s view of him. In the aftermath of Jarama, which Eby dubs a massacre, Cooperman (labelled as a &ldquo;Party yo-yo&rdquo;) served as a witness in a trial against a British lieutenant named Clifford Wattis, who was made a scapegoat for the massacre. 10 days prior to the attack on Pingarr&oacute;n, Cooperman and Merriman had met up with each other, presumably at the Battle of Jarama itself. At some point in the weeks following the battle, Robert Raven, who had been blinded and would become the war&rsquo;s most famous casualty, told the story of his harrowing experience to Cooperman.<br />\r\n<br />\r\nCooperman and Merriman would reunite on April 23 at the Lincoln Brigade&rsquo;s new headquarters in the Estado Mayor in Morata after the latter arrived there late in the evening. The two then talked the following day after breakfast. Merriman pleasantly remarked at Cooperman&rsquo;s presence at the Independence Day festivities, since he helped Merriman keep the rowdy Canadians in line. Cooperman joined Merriman and the other American leaders for a meeting on August 7, after which he confided in Merriman that he wanted to go home and seek repatriation. The two had a conversation in the evening of August 12, reminiscing on the past. He worked with Sidney Shostek to audit the books of the Brigade&rsquo;s treasurer following a scandal involving the loss of hundreds of thousands of pesetas. He was killed in action at an unknown time and place, most likely after March 14, 1938, since he was in Guadalajara that day. It is possible that he deserted, explaining the lack of information concerning the time and place of death, but it has most likely been lost to the sands of time. There was another volunteer named Phillip Cooperman who boarded the SS Washington at Le Havre on November 1, 1937, nearly a year after Philip Cooperman arrived. He was born in 1910, which would&rsquo;ve made him 26 at the start of the war, which is only a little bit off from 28, and his address was listed as 365 East 18th Street, which is within 150 feet of the other Cooperman&rsquo;s address. Since Cooperman would be in Spain until at least March 1938, this is a potential case of identity fraud, where someone looking to flee Spain and/or return to the U.S. assumed this false alias.<br />\r\n<br />\r\nI was unfortunately not able to locate any images or records of his education, which is surprising considering his relatively high positions within the brigade hierarchy. However, it is possible that these documents were destroyed, redacted, and/or classified, possibly as a direct consequence of his status as both Battalion Secretary and Political Commissar, although for what reason is unclear.</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;Cooperman, Philip.&rdquo; 2019. The Abraham Lincoln Brigade Archives. December 10, 2019. <a href=\"https://alba-valb.org/volunteers/philip-cooperman/\">https://alba-valb.org/volunteers/philip-cooperman/</a>.<br />\r\n<br />\r\n&zwnj;&ldquo;Jews in the Spanish Civil War.&rdquo; n.d. Www.jewishvirtuallibrary.org. Accessed June 2, 2022. <a href=\"https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war#sources\">https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war#sources</a>.<br />\r\n<br />\r\n&zwnj;&ldquo;Документы советской эпохи: Просмотр единицы хранения.&rdquo; n.d. Sovdoc.rusarchives.ru. Accessed June 2, 2022, pg. 9, images 163-164 <a href=\"http://sovdoc.rusarchives.ru/sections/organizations//cards/229117/images\">http://sovdoc.rusarchives.ru/sections/organizations//cards/229117/images</a>.<br />\r\n<br />\r\n&zwnj;&ldquo;Документы советской эпохи: Просмотр единицы хранения.&rdquo; n.d. Sovdoc.rusarchives.ru. Accessed June 2, 2022, pg. 1, image 4 <a href=\"http://sovdoc.rusarchives.ru/sections/organizations/cards/142087/images\">http://sovdoc.rusarchives.ru/sections/organizations/cards/142087/images</a>.<br />\r\n<br />\r\n&zwnj;&ldquo;Jarama Series: The Aftermath.&rdquo; n.d. The Volunteer. Accessed June 2, 2022. <a href=\"https://albavolunteer.org/2016/03/jarama-series-the-aftermath/#_edn2\">https://albavolunteer.org/2016/03/jarama-series-the-aftermath/#_edn2</a>.<br />\r\n<br />\r\n&zwnj;Hoff, Raymond. n.d. &ldquo;Merriman&rsquo;s Diaries: EXEGISIS.&rdquo; Accessed June 2, 2022, pg. 57, 60-61, 76, 101-102, 124, 183, 187(b), 375-377, 450, 452-453, 462, 464, 464-465, 468 <a href=\"https://s18798.pcdn.co/digitaltamiment/wp-content/uploads/sites/6904/2018/05/Merriman_Diary_Exegesis-ilovepdf-compressed.pdf\">https://s18798.pcdn.co/digitaltamiment/wp-content/uploads/sites/6904/2018/05/Merriman_Diary_Exegesis-ilovepdf-compressed.pdf</a>.<br />\r\n<br />\r\n&zwnj;Eby, Cecil D. 2013. Comrades and Commissars : The Lincoln Battalion in the Spanish Civil War. University Park: Penn State Univ Press, pg. 31, 62, 76, 88, 163</p>\r\n",
    "student_fname": "Ariel",
    "student_lname": "Grinshpoon",
    "tags": [
        "Jewish",
        "Commissar",
        "Jarama",
        "ROTC",
        "Bacteriologist",
        "15th Brigade",
        "Battalion Secretary",
        "Albacete",
        "Estado Mayor",
        "Guadalajara",
        "Member Of Communist Party"
    ],
    "volunteer_fname": "Philip",
    "volunteer_images": [],
    "volunteer_lname": "Cooperman",
    "year_published": 2022
}