{
    "class": "2023",
    "data": "<p>Albert M. Wallach was born to Aaron Wallach and Al Morris in 1904 in the United States of America. He grew up a troublesome teenager, but was pressured into attending a College of Business for two years. After failing as a student, he became a US Army Reserve Officer and spent his time with his friends. Many of these friends were Spanish Republic sympathizers, and believers in communism. Pressured by them to join up and sail to Spain, he agreed, reluctantly.<br />\r\n<br />\r\nWallach received Passport #377964 which listed his address as 226 West 79th Street, NYC, before March 5, 1937, when he set out for Spain when. Regrettably, he experienced a hernia on board and needed immediate surgery in Paris. Wallach&#39;s companions took him from bed and concealed him at their hotel so they wouldn&#39;t have to pay the hospital fee. The heist put the movement of additional volunteers to Spain in grave jeopardy, especially when French authorities issued a warrant for Wallach&#39;s arrest. He claimed to require more medical care, but the Americans in charge of the volunteers believed him to be faking it and sent him to Spain. On May 30, 1937, Albert arrived in Spain.<br />\r\n<br />\r\nIt turned out to be a poor choice. Wallach requested a safe position after receiving criticism for spreading stories during training. Wallace dodged the fight despite being denied that exit. Wallach had first deserted at Brunete and then, after being brought back, had again gone at Quinto, according to Captain Hans Amlie, who called him &quot;my smart Jew deserter,&quot; perhaps a joke, perhaps not. There were many Jews serving in the Abraham Lincoln Brigade, but evidence of any apparent anti-semetism was not present.<br />\r\n<br />\r\nWallach was next observed during the retreats serving at the front in a labor battalion after returning to the Lincolns for a third time following Teruel. Voros believed that Wallach had been slain in the subsequent battle, however it appears that Wallach took advantage of the military breakdown to once more desert. He was detained at the Brigade jail at Castillo de Fellas with a prisoner called Edward Horan (also known as Palega), who remembers Wallach&#39;s assertion that he was employed by both the anarchist party and the American consul in Barcelona. Wallach was apprehended while wearing civilian clothing throughout Barcelona. He also remembered that Wallach was led from his cell around May 1, a month after the retreats.<br />\r\n<br />\r\nAt the end of the war, when Wallach had not returned to the country, his father looked into the matter personally. He socialized with some of the Lincoln veterans in New York while dressed as a sailor. Horan told him that an American working for the Spanish military intelligence (SIM) had purposely killed his son after he had been brutally beaten and starved over quite a period and hauled out to the courtyard without a court martial.</p>\r\n\r\n<p><br />\r\nCommissar Gates would only corroborate his knowledge of Wallach&#39;s death in Spain when confronted with this account. Anthony DeMaio, a volunteer for Lincoln, was charged with a felony by the older Wallach in testimony to the Dies committee. DeMaio vehemently denied knowing about any deaths at Castillo de Fells fifty years later. Horan, a deserter and anti-Communist undercover agent for the Chicago police, served as the primary informant in this case. Later, he repeated the accusations in front of the Subversive Activities Control Board of the United States government. Horan&#39;s truthfulness cannot be confirmed or refuted.</p>\r\n",
    "school_crests": [],
    "sources": "<p>Carroll, Peter N. The odyssey of the Abraham Lincoln brigade: Americans in the Spanish Civil War. Stanford, CA: Stanford University Press, 1994.<br />\r\n<br />\r\nInk, Social. &ldquo;Wallach, Albert M.&rdquo; The Abraham Lincoln Brigade Archives, December 28, 2022. <a href=\"https://alba-valb.org/volunteers/albert-wallach/. &lt;/p&gt;\">https://alba-valb.org/volunteers/albert-wallach/. </a></p>\r\n",
    "student_fname": "Sunitie",
    "student_lname": "Sobhai",
    "tags": [
        "Jewish",
        "Deserter",
        "Executed"
    ],
    "volunteer_fname": "Albert M.",
    "volunteer_images": [],
    "volunteer_lname": "Wallach"
}