{
    "class": "2021",
    "data": "<p>Hannah &ldquo;Honey&rdquo; Hershkowitz was born on January 10, 1912, in the Bronx to a Jewish family. Her address was listed as 1184 Cornwell Ave. From New York City, she sailed to Spain on the Normandie (April 14, 1937) and arrived on May 10 alongside the American Medical Bureau to serve as a nurse. She was posted throughout Spain, in Belalcazar, Vich, and Cordoba. During her time on the Cordoba front, she suffered from an unspecified mental illness but was barred from returning home by Dr. Barsky (a top surgeon). Friends recall her peculiar behavior; she kept an extra washcloth for the &ldquo;possible&rdquo; and excessively washed her undergarments as an excuse to hang them to dry: an open invitation to get shot by a Nationalist. The strenuous circumstances (sweltering weather and poor conditions) likely exacerbated Hershkowitz&rsquo;s mental illness. It is unknown why she sailed to Spain at all.<br />\r\n<br />\r\nHershkowitz&rsquo;s biography is brief, as she did not desire to live to tell it. After returning to the States on June 14, 1938 on the Aquitania (just past a year in Spain), Hershkowitz attempted suicide multiple times. She strangled herself at Beth Israel Medical Center, as well as attempted to drown herself. A man who loved her, Morris Kornblum, assisted Hershkowitz&rsquo;s mother with her hospital care. Kornblum (later changing his name to Martin Balter) served in Spain too, as a lab technician and field medic. His admiration did not ultimately deter her from ending her own life. She killed herself on August 1st, six weeks back home, dying at 27. (A separate record in &ldquo;Medicine in Republican Exile&rdquo; by Francisco Guerra, however, states that she was instead repatriated at the end of the war and simply &ldquo;died&rdquo; in 1968.) Hershkowitz was not survived by a partner nor children.</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;United States: Hershkowitz, Hannah (Honey).&rdquo; Tamiment Library and Robert F. Wagner Labor Archive, New York University, <a href=\"http://dlib.nyu.edu/findingaids/html/tamwag/alba_001/dscaspace_ref15.html#aspace_ref364\" target=\"_blank\">http://dlib.nyu.edu/findingaids/html/tamwag/alba_001/dscaspace_ref15.html#aspace_ref364</a><br />\r\n<br />\r\n&ldquo;HEALING THE WOUNDS OF FASCISM.&rdquo; Johnson, Ashley. Mount Holyoke College. <a href=\"https://ida.mtholyoke.edu/bitstream/handle/10166/3210/Johnson.pdf?sequence=1&amp;isAllowed=y\" target=\"_blank\">https://ida.mtholyoke.edu/bitstream/handle/10166/3210/Johnson.pdf?sequence=1&amp;isAllowed=y</a><br />\r\n<br />\r\n&ldquo;Hershkowitz, Hannah.&rdquo; Biography - Abraham Lincoln Brigade, <a href=\"https://alba-valb.org/volunteers/hannah-hershkowitz/\" target=\"_blank\">https://alba-valb.org/volunteers/hannah-hershkowitz/</a>.<br />\r\n<br />\r\n&ldquo;HERSHKOWITZ, Hannah.&rdquo; Universitat de Barcelona. <a href=\"http://sidbrint.ub.edu/es/content/hershkowitz-hannah\" target=\"_blank\">http://sidbrint.ub.edu/es/content/hershkowitz-hannah</a></p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "student_fname": "Cadence",
    "student_lname": "Li",
    "tags": [
        "Jewish",
        "Nurse",
        "American Medical Bureau",
        "Cordoba Front"
    ],
    "volunteer_fname": "Hannah \"Honey\"",
    "volunteer_images": [],
    "volunteer_lname": "Hershkowitz"
}