{
    "class": "2021",
    "data": "<p>Albino Zattoni (1912-1983) was born June 4th 1912 in the small town of Tres in Trentino, an Italian speaking province which was controlled by the Austro-Hungarian Empire until it&#39;s annexation by Italy in 1919. He was probably born to a working class family. His father was David Zattoni, an electrician. Albino Zattoni&rsquo;s left-wing politics and socialist values were likely instilled in him from a young age, as his father was involved with the Socialist Party of Italy. The years of his youth were a time of conflict and political upheaval in Italy as socialists and communists fought in the streets of Italian cities and towns against Mussolini&rsquo;s fascist blackshirts. In 1922, Mussolini came to power in Italy and by 1926 the Socialist Party was banned. Mussolini&rsquo;s assassinations and persecution of Italian socialists which Zattoni and his father would have experienced must have contributed to his strong anti-fascist convictions. In 1929 Zattoni made arrangements to immigrate to the United States, either searching for economic opportunity or political freedom. He arrived in New York City in 1929 at the age of 17 to begin his new life in America.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Zattoni arrived in New York on the tail end of a wave of massive Italian migration to the US, fueled by Italy&rsquo;s severe rural poverty. He was taken in as a boarder by the Pozza family, a family of two Italian immigrants and their four children who all had crossed the Atlantic to America in the preceding years. He lived for this time on 249 Irving Avenue in Brooklyn, and learned English. Zattoni soon became tied up again in leftist politics. He joined the Socialist Party of the United States and became an organizer for the party . In a short time, he worked his way up to becoming a leader of a local section in the Socialist Party&rsquo;s Italian Federation (the Italian American division of the party), showing once more his commitment to working class politics.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>In 1936, the Spanish Civil War broke out. Zattoni presumably supported the Republic from the beginning thanks to his anti-fascist beliefs, but he was a late arriver to actually join the International Brigades. He made the decision to travel to Spain only after the brigades had been organized and the stories of international and American heroics at Madrid and Jarama had been publicized. Having been inspired to action, he got his passport on April 3rd, 1937 and set off for Spain on May 12, intending to travel to France and cross the Spanish border. However, both the US government and France adhered to non-intervention, and sought to stop volunteers from joining the Republicans. Zattoni was arrested by French authorities in May and spent a month in a French jail. On his release, he set off right away for Spain.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Zattoni arrived in Spain via Massanet on June 14th, 1937. Despite coming from the United States he chose to sign up with the XII brigade, more specifically with the Garibaldi Battalion of volunteers from Italy, along with around 100 other Italian Americans. This might reflect that he continued to identify more as Italian even after moving to America. Italian volunteers like Zattoni were in a tough position because Mussolini&rsquo;s fascist government sent tens of thousands of soldiers to Spain to fight on the nationalist side. This left Italian volunteers fighting on the opposite side to thousands of their people, while their actions made them criminals in their native country. Zattoni himself was wanted criminally by the Italian police.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Zattoni arrived with the XII brigade just in time to join in their retreat from Brunete. Following this the XII brigade, as part of the 45th division, participated in the Republic&rsquo;s Zaragoza offensive, the same battle as the XV brigade&rsquo;s failed attack on Fuentes del Ebro. The offensive made some progress but failed its objectives with heavy losses for the Republicans, and the 45th was stopped just 6 km from Zaragoza. At some point, Zattoni learned Spanish as part of his time serving with the Republic. In early 1938, Zattoni&rsquo;s division was moved briefly to Extremadura, before being rushed back to Aragon to stop the Nationalist breakthrough in the crushing Aragon offensive. The Republicans suffered a great defeat, but members of the International Brigade managed to hold the Nationalists back for some time at Caspe. Zattoni fought hard at Caspe and was decorated for his service there. Despite their losses, the XII brigade (and the other brigades of the 45th) managed to rearm to participate in the massive Ebro offensive in summer 1938, during which the Republicans launched their biggest attack yet against the Nationalists. The men of the Garibaldi brigade and the rest of the 45th saw their heaviest fighting of the war, but the offensive ended in complete disaster and the destruction of the Republican army as an effective fighting force.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>On September 21, 1938, the International Brigades were disbanded. Zattoni and the other volunteers began shipping home. He had fought hard for his beliefs and for Spanish socialism, but as he began the return journey to New York City on December 20th aboard the Ausonia, it was already clear that the Republic was on the brink of defeat. Still, most volunteers could see that the war in Spain was just the first contest in what would become a worldwide struggle against fascism. Like so many other International Brigade volunteers, Zattoni would soon return to war. He enlisted in the US army on February 22nd, 1944 to fight the fascists again. It&#39;s not clear where he fought, but survived the war and returned to New York again by 1945/46. After his fight in WWII, Zattoni slips from the historical records. It can be assumed that he became prosperous enough to enter the middle class. He made enough money to move to Lindenhurst in Long Island, where he lived until his death in April 1983. When he died, Albino Zattoni was 71 years old and he had devoted his entire youth to the socialist cause, for which he fought in Italy, the United States, Spain, and the battlefields of WWII.</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;Zattoni, Albino Giuseppi.&rdquo; Albino Zattoni-Abraham Lincoln Brigade., <a href=\"https://alba-valb.org/volunteers/albino-giuseppi-zattoni/\" target=\"_blank\">https://alba-valb.org/volunteers/albino-giuseppi-zattoni/</a></p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&ldquo;Albino Zattoni&rdquo; (1930). Census return for Brooklyn, Kings, New York, United States. Accessible at <a href=\"https://www.familysearch.org/ark:/61903/1:1:X4VV-FB4\" target=\"_blank\">https://www.familysearch.org/ark:/61903/1:1:X4VV-FB4</a> (Accessed 6 May 2021).</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Albino Zattoni. United States World War II Army Enlistment Records, 1938-1946. Accessible at <a href=\"https://www.familysearch.org/ark:/61903/1:1:K858-73P\" target=\"_blank\">https://www.familysearch.org/ark:/61903/1:1:K858-73P</a> (Accessed 6 May 2021).</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Case 24. Report of the Commission on Foreign Personnel under the Central Committee of the Communist Party of Spain on volunteers from the USA and Canada. Interbrigades of the Republican Army of Spain. Sovdoc Archives. Accessible at <a href=\"http://sovdoc.rusarchives.ru/sections/organizations//cards/134226/images\" target=\"_blank\">http://sovdoc.rusarchives.ru/sections/organizations//cards/134226/images</a> (Accessed 6 May, 2021).</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Case 481. Lists of personnel of the 12th International Brigade named after Garibaldi. Interbrigades of the Republican Army of Spain. Sovdoc Archives. Accessible at <a href=\"http://sovdoc.rusarchives.ru/sections/organizations//cards/207189\" target=\"_blank\">http://sovdoc.rusarchives.ru/sections/organizations//cards/207189</a> (Accessed 6 May 2021).</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&ldquo;International Communist Current.&rdquo; The Italian Left, 1922-1937 | International Communist Current. Accessed May 6, 2021. <a href=\"https://en.internationalism.org/content/3174/italian-left-1922-1937\" target=\"_blank\">https://en.internationalism.org/content/3174/italian-left-1922-1937</a></p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Thomas, Hugh. Spanish Civil War. New York: Harper &amp; Row, 1977.&nbsp;</p>\r\n",
    "student_fname": "Maitreya",
    "student_lname": "Loizzo",
    "tags": [
        "Italian",
        "Member of Socialist Party",
        "Garibaldi Brigade",
        "Zaragoza",
        "Aragon Front",
        "Ebro Offensive",
        "WWII Veteran"
    ],
    "volunteer_fname": "Albino Giuseppi",
    "volunteer_images": [],
    "volunteer_lname": "Zattoni"
}