{
    "class": 2024,
    "data": "<p>Bernard Abramofsky was born Leonard Aibel on April 21,1914 to parents Isadore and Ida Aibel in Brooklyn, New York. Born into a Jewish family, Abramofsky’s parents likely came to the United States via a boat to Ellis Island. Abramofsky grew up in Brooklyn and lived the entirety of his early life in the city.<br /><br />Abramofsky joined the military early on in life, having been a member of the US military reserves for 3 years after graduating college, and then serving abroad in the Army of the Philippines. However, he never experienced actual fighting during his time in the US military. <br /><br />From his early adulthood, Abramofsky associated strongly with Communism. Having joined the Young Communist League in 1934, he would later become a card-carrying member of the Communist Party of America in 1936. Abramofsky was especially involved with the International Workers Order (IWO). As a youth member of the Order, he formed a theatrical group known as the “Convulsionaries”, along with his cousin Harold Melofsky as well as his friends Vaughn Love and Ernie Arion. The Convulsionaries wrote and performed songs in both Yiddish and English along with skits which depicted and parodied the situation in Spain. <br /> <br />Having heard about the war in Spain, he decided that he wanted to fight for the anti-fascist cause abroad. On February 11th, 1937, Abramofsky received his passport, and 9 days later, he boarded the Ile de France. He, along with many of his comrades, went to France, and then made the trek across the Pyrenees Mountains to enter Spain. Abramofsky made the journey from New York to Spain along with his comrades in the Convulsionaries, who performed their songs and skits for the villagers and his fellow soldiers. Abramofsky was assigned to a machine-gun company along with Melofsky, and he described a burning desire to fight on the front lines. <br /><br />Abramofsky’s prior military training experience allowed him to become a self-proclaimed leader in training at Albacete before the Lincoln Brigades were sent into battle. However, his leadership qualities were not shown in battle. The first time he was deployed, at the Battle of Brunete, Abramofsky was so terrified by the fighting that he hid and faked injury in a field of wheat and got stretchered away. Milt Wolff, the commander of the Lincoln Brigades, described his own disgust with Abramofsky’s behavior, saying that “He groaned and moaned on the stretcher as we sweated up the scorching hills, and all the time the son of a bitch had been faking it…he hadn’t been hit at all”. Following Brunete, Melofsky claimed in a letter to his friends back home in New York that “Cousin Bernie just disappeared someplace, and I don’t know where the hell he is”. This would mark just the beginning of Abramofsky’s attempts to avoid fighting in the Spanish Civil War.<br /><br />Abramofsky and two comrades, Jacob Rotter and Albert Wallach, deserted the Lincoln Brigades and fled to the American consulate in Valencia. On November 22, 1937, they asked to be helped to return to America, based on the claim that they had not enlisted in the cause they initially thought they had. Abramofsky and his comrades stated that they had come to Spain to enlist in a “purely American unit”, and did not choose to be part of the Republican Army, having been deceived. In exchange for shipping them back to America, Abramofsky and his comrades promised to fully cooperate with the United States in order to prevent more Americans from “coming over [to Spain] to be slaughtered”. Unfortunately for the deserters, the consulate denied their request, and after learning this, they created a fake story of American dissidents who were falsely court-martialed and then executed by the Republican forces. Lee Worley, the diplomat who heard their story was not fully convinced by it, saying that “no doubt, the statements of these boys may be exaggerated”. In the end, Worley was unable to help the deserters. <br /><br />Following their rejection by the consulate at Valencia, Abramofsky and the others fled to Barcelona in order to try to become repatriated. Like many members of the Abraham Lincoln Brigade, Abramofsky had had his passport revoked by the United States after he went over to Spain to fight in the war. Two weeks after leaving Valencia, Abramofsky’s repatriation request was rejected in Barcelona. Stephen Fuqua, the US military attache who conducted interviews with Abramofsky and his comrades, stated that “they gave the…impression of being typical cowards fleeing from danger”. <br /><br />On the 20th of December, 1937, Abramofsky, Rotter, and Wallach were arrested as deserters. Following his disgraceful exit from the Republican Army, Abramofsky chose to be incarcerated rather than return to the battlefield. This all changed when, during the battle of Teruel, heavy death tolls forced Abramofsky to be taken back to the battlefield to fight for the Republic once again. However, Abramofsky would desert once again following the Republic’s retreat from Teruel around February 22nd, 1938. <br /><br />Yet again, Abramofsky would flee to Barcelona, where yet again, he was arrested by the Republic. The authorities took him to the brigade headquarters to be reprimanded by the American forces. While he was completely infuriated and disgusted with Abramofsky’s behavior, Commander John Gates made the decision to once again add Abramofsky back to the battalion. However, this decision was not popular among the other commanders of the Abraham Lincoln Brigade. Following the incredibly costly loss at Teruel, morale was already extremely low, and Abramofsky’s presence, considering the fact that he had already deserted on 3 separate occasions, only threatened to make morale even worse. Gates insisted that Abramofsky should stay with the rest of the troops, but uttered under his breath that someone ought to shoot him. And on April 31st, 1938, Gates’ word became reality. That night, an unknown soldier decided to take matters into his own hands. The soldier took Abramofsky for a walk, and proceeded to fire a single bullet into the back of his skull. <br /><br />News of Abramofsky’s death spread like a wildfire throughout the camp. Much of the battalion was deeply disturbed by the news. Gates especially was concerned about the murder of Abramofsky, having demanded an answer from Wolff about what had happened to Abramofsky. Wolff “claimed total ignorance” about what had happened, and the matter would later be dropped as no killer could be identified due to a lack of evidence. Wolff and much of the rest of the commanders of the brigade seemed to be in agreement: that Abramofsky was a threat to the unity of the battalion anyways. <br /><br />However, Wolff’s claims of ignorance about the extrajudicial killing of Bernard Abramofsky are highly questionable. In speeches after the war honoring the heroes of the Abraham Lincoln Brigade, Wolff has often listed Abramofsky’s name along with others who laid down their lives to fight fascism in Spain, despite the fact that Abramofsky abandoned the cause for his own self-preservation. In Wolff’s book Another Hill, a semi-fictional autobiography based on his time in the Spanish Civil War, the character Leo Rogin, who is considered to be based on Abramofsky, is killed by a gunshot from Mitch Castle, who is considered to be based on Wolff himself. This has been interpreted as an admission of guilt from Wolff for killing Abramofsky.<br /><br />Abramofsky’s story is one that heavily contradicts a common narrative of the Abraham Lincoln Brigade, which is that it was a band of noble and brave volunteers who were all putting their lives on the line to protect Spain from falling to Fascism. Some soldiers, like Abramofsky, were cowardly, and were subject to cruelty from their own brethren. In the case of Abramofsky, this cruelty would lead to his untimely demise.<br /></p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1Os0_EPEJ5YIHv-YGj_hTunnHG1JhXf4a",
            "src": ""
        }
    ],
    "sources": "<p>“Abramofsky, Bernard.” The Abraham Lincoln Brigade Archives, The Abraham Lincoln Brigade Archives, <a href=\"https://alba-valb.org/volunteers/bernard-abramofsky/\">https://alba-valb.org/volunteers/bernard-abramofsky/</a>. <br /><br />Bernard Abramofsky Papers, Tamiment Library and Robert F. Wagner Labor Archive,<br /><a href=\"https://dlib.nyu.edu/findingaids/html/tamwag/alba_259/scopecontent.html\">https://dlib.nyu.edu/findingaids/html/tamwag/alba_259/scopecontent.html</a>. <br /><br />Carroll, Peter N. The odyssey of the Abraham Lincoln Brigade : Americans in the Spanish Civil War. Stanford University Press, 1994.<br /><br />Nelson, Cary. “Milton Wolff, Ernest Hemingway, and Historical Memory: The Spanish Civil War Sixty Years Later.” North Dakota Quarterly, vol. 63, no. 3, 1996, pp. 81-89,<a href=\"https://babel.hathitrust.org/cgi/pt?id=mdp.39015061255355&view=1up&seq=89\">https://babel.hathitrust.org/cgi/pt?id=mdp.39015061255355&view=1up&seq=89</a>.<br /><br />Worley, Lee. “The Vice Consul at Valencia (Worley) to the Secretary of State.” FOREIGN RELATIONS OF THE UNITED STATES DIPLOMATIC PAPERS, 1937, GENERAL, VOLUME I, Office of the Historian, <a href=\"https://history.state.gov/historicaldocuments/frus1937v01/d552\">https://history.state.gov/historicaldocuments/frus1937v01/d552</a>.<br /></p>",
    "student_fname": "Jasper",
    "student_lname": "Caro",
    "tags": [
        "Young Communist League",
        "Communist Party USA",
        "Communist",
        "Jewish",
        "International Workers Order",
        "Deserter",
        "Died in Spain"
    ],
    "volunteer_fname": "Bernard",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=101HUCMj60jDRIWYAxYfOGEDVo2rbrAf3",
            "src": ""
        }
    ],
    "volunteer_lname": "Abramofsky",
    "year_published": 2023
}