{
    "class": 2024,
    "data": "<p>William Gilmore (J.) Wheeler was born to Mina (Anne) and Joseph Wheeler on March 15th, 1910 in Philadelphia. He decided to go fight in Spain in December of 1936, when he was 26 years old. Although he had no political affiliation, he believed that Spain was representative of a larger conflict in the world, one against Hitler and fascism, and Wheeler was fully prepared to take up arms to fight for freedom and democracy. Wheeler was working as a Teamsters activist in New York while taking correspondence courses at the New York State College of Agriculture at the time, but he was originally from upstate where he had grown up on a farm. Because of his upbringing, he had experience using a rifle, something many International Brigade volunteers were lacking. This earned him an officer’s commission once he arrived, despite never having fought in a battle.<br /><br />Wheeler arrived in the first wave of volunteers to reach Spain on the Normandie, one of the 9 members of the group who did not have a communist affiliation. Only two months after his landing, Wheeler faced his first battle at Jarama Valley. He received a wound in the leg during the battle, and was promoted to the rank of lieutenant. He was then moved to the MacKenzie-Papineau Battalion for the Canadian contingent’s first battle at Fuentes de Ebro as commander of Company One. Soon after he was ordered back to America by the Comintern in spring 1938, along with 7 other members of the International Brigades, to serve as propaganda pieces. He decided to return, and rejoined the fight in the Lincoln-Washington Battalion as the commander of Company 3. <br /><br />Preparing for the Ebro Offensive, Wheeler formed a friendship with fellow volunteer Dave Lipton, who was on the same ship he had returned to Spain on and incidentally, a member of his company. He crossed the Ebro with his company, sent without supplies, on a 3 day march. They survived on “some food, cans of salty fish, but were unable to drink the water as the fascists had contaminated the wells”, as recounted by Wheeler in a 1996 letter to Lipton’s family. After the grueling journey, they arrived at Hill 666, and before the battle had even begun he witnessed Lipton being struck in the head by a sniper’s bullet. In the letter to the Lipton family, Wheeler expressed the depth David’s death had on him, <br /><br />“In war one becomes injured to death but Dave’s has haunted me ever since. He was young, he was brave, sacrificed on the altar of fascist aggression. It was not a ‘civil war’ but a war of intervention by the fascist powers – aided and abetted by England and the United States who did nothing to aid the democratically elected government of Spain.”<br /><br />Wheeler survived the Battle of the Ebro, and continued to fight in the Lincoln-Washington Brigade at Caballs and Pandols. He returned for the second and final time back to the states with the withdrawal of the International Brigades in 1938.<br /> <br />Post-war Wheeler initially went to California and continued his work as a labor activist, but later settled down in Atlanta, Georgia with his wife, Ione. He was able to enlist in the Navy during WW2 after convincing the officials he had no communist affiliation, but was relegated to the engine room for his entire tour because of his involvement in Spain. For the rest of his life, he continued to speak about his time in Spain and the dangers of fascism, being one of the subjects of an 1997 Atlanta Journal article retelling the lives of ALBA volunteers, as well as publishing a piece in The Volunteer magazine. He died on December 28, 1998 in Atlanta, Georgia.</p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1qjvBNBuiRFT8wzKigCzyOg0x54aL46Oe",
            "src": ""
        }
    ],
    "sources": "<p>Brooks, Chris. “Company One Mac-Paps by a Member of the 1st Company - the Volunteer.” The Abraham Lincoln Brigade Archives, November 2, 2018. <a href=\"https://albavolunteer.org/2018/11/company-one-mac-paps-by-a-member-of-the-1st-company/\">https://albavolunteer.org/2018/11/company-one-mac-paps-by-a-member-of-the-1st-company/</a>.<br /><br />———. “Jarama Series: Pingarrón.” The Abraham Lincoln Brigade Archives, March 1, 2016. <a href=\"https://albavolunteer.org/2016/03/jarama-series-pingarron/\">https://albavolunteer.org/2016/03/jarama-series-pingarron/</a>.<br /><br />———. “New Jarama Series.” The Abraham Lincoln Brigade Archives, December 30, 2015. <a href=\"https://albavolunteer.org/2015/12/blast-from-the-past-new-jarama-series/\">https://albavolunteer.org/2015/12/blast-from-the-past-new-jarama-series/</a>.<br /><br />———. “Veterans Day - the Volunteer.” The Abraham Lincoln Brigade Archives, November 11, 2021. <a href=\"https://albavolunteer.org/2021/11/veterans-day/\">https://albavolunteer.org/2021/11/veterans-day/</a>.<br /><br />The Abraham Lincoln Brigade Archives, and Jim Skillman. “Wheeler, William.” The Abraham Lincoln Brigade Archives, n.d. <a href=\"https://alba-valb.org/volunteers/william-j-wheeler/\">https://alba-valb.org/volunteers/william-j-wheeler/</a>.<br /><br />The Abraham Lincoln Brigade Archives, and Bill Wheeler. “A Death on the Ebro - by Bill Wheeler.” Edited by Chris Brooks. The Abraham Lincoln Brigade Archives, March 31, 2015. <a href=\"https://albavolunteer.org/2015/03/blast-from-the-past-death-on-the-ebro/\">https://albavolunteer.org/2015/03/blast-from-the-past-death-on-the-ebro/</a>.<br /><br />Wheeler, William Gilmore Vertical File, April 18, 2024; Abraham Lincoln Brigade Archives; ALBA.VF.002; Box 26; Folder 10; <br />Tamiment Library/Robert F. Wagner Labor Archives <br />Elmer Holmes Bobst Library <br />70 Washington Square South <br />New York, NY 10012, New York University Libraries.</p>",
    "student_fname": "Carter",
    "student_lname": "Lim",
    "tags": [
        "Mackenzie-Papineau Battalion",
        "Caballs",
        "Normandie",
        "Teamsters Union",
        "Hill 666",
        "Battle of Jarama Valley",
        "Pandols",
        "Ebro Offensive",
        "Battle of the Ebro",
        "WWII Veteran",
        "Company Commander"
    ],
    "volunteer_fname": "William Gilmore",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1GOI0fN2dsJ-p37GeEZB2r9dfE2N7JwCo",
            "src": ""
        }
    ],
    "volunteer_lname": "Wheeler",
    "year_published": 2024
}