{
    "class": "2024",
    "data": "<p>On October 3rd, 1907 Stanley Etela was born in the city of Schenectady, New York. His Finnish origin suggests that his parents immigrated to avoid growing hostility from Russia during a time of Russification. Etela later made his home in Williamsburg at 228 Metropolitan Avenue, Brooklyn, New York as a tailor. However, he was not exempt from the economic hardships of the Great Depression that later came. Thus, in 1933, Etela was inspired to join the Communist Party of the United States, taking part in the collective initiative to fight the Depression. He participated in strikes and rallies, helping bring unions to previously unorganized trades and backing civil rights movements.<br />\r\n<br />\r\nAt this point, Williamsburg was one the most densely populated areas of New York City because of an influx of people coming from other parts of the city and various places in Europe. This was especially true during a wave of Jewish immigrants seeking to escape Nazism in the 1930s. As a member of such an active community as New York, Etela&rsquo;s proximity to European affairs drew his attention to Spain and the mutiny against a democratically elected Republican government in 1936. Despite the risk of losing his citizenship in a desperately neutral America, Etela joined a call by the Communist Party to fight the &ldquo;Good Fight&rdquo; in Spain.<br />\r\n<br />\r\nUnder the name of &ldquo;Stanley Stala&rdquo; and an innocuous excuse to visit France, Etela sailed aboard the Paris in February with 118 other volunteers, also with innocuous excuses to go. Ten days later he was officially in Spain, and Etela was surrounded by a truly International Brigade, with volunteers from all over the world gathered for the same cause. As one of the enthusiastic young Americans, he was of the XV International Brigade, or The Abraham Lincoln Brigade. The setting was so international, in fact, that commanders spoke several languages and hardly gave instruction in English. Training was minimal and incomprehensible to the fresh faced American volunteers. Etela and his inexperienced comrades, after only getting a few shots with weapons they had never seen before, were often sent first into battle as fodder so more experienced soldiers could come in later.<br />\r\n<br />\r\nSoon, Etela would be sent to his first battle as part of the Jarama offensive, and would march with the Abraham Lincoln Brigade in an attempt to take the Pingarron. As part of the 2nd Company of the XV Brigade, Etela departed from Albacete crammed inside one of several trucks. Luckily, he was not aboard one of the first two trucks that missed a turn and drove straight into enemy lines, dubbed &ldquo;The Lost Trucks.&rdquo; This would not be the last of their mishaps, as weather, miscommunication, and a lack of promised arms led the Lincoln Brigade and many others marching into a barrage of bullets. It was only rain that provided enough cover from Nationalist snipers for survivors to find cover. At this point, Etela and others like him were faced with the reality of war. Four months later, they would advance Westward across the Guadarrama River for the Battle of Brunete. Hilly landscape and the Nationalists&rsquo; advantageous positioning at Villanueva de la Canada made the XV Brigade open to bombardment.<br />\r\n<br />\r\nUltimately, Etela would be wounded in action. He would then be discharged from the 15th Brigade and moved to the rear. Soon after in August 1938, he would be evacuated from Sagaro back to America aboard the President Roosevelt.</p>\r\n",
    "school_crests": [],
    "sources": "<p>Brooks, Chris. &ldquo;Brunete the Good and the Bad - by Leo Rosenberg.&rdquo; The Volunteer, February 11, 2018. <a href=\"https://albavolunteer.org/2018/02/brunete-the-good-and-the-bad-by-leo-rosenberg/\">https://albavolunteer.org/2018/02/brunete-the-good-and-the-bad-by-leo-rosenberg/</a>.<br />\r\n<br />\r\n&mdash;&mdash;&mdash;. &ldquo;Jarama Series: Organization of the Abraham Lincoln Battalion.&rdquo; The Volunteer, February 12, 2016. <a href=\"https://albavolunteer.org/2016/02/jarama-series-organization-of-the-abraham-lincoln-battalion/\">https://albavolunteer.org/2016/02/jarama-series-organization-of-the-abraham-lincoln-battalion/</a>.<br />\r\n<br />\r\n&mdash;&mdash;&mdash;. &ldquo;Jarama Series: Pingarr&oacute;n.&rdquo; The Volunteer, March 1, 2016. <a href=\"https://albavolunteer.org/2016/03/jarama-series-pingarron/\">https://albavolunteer.org/2016/03/jarama-series-pingarron/</a>.<br />\r\n<br />\r\n&mdash;&mdash;&mdash;. &ldquo;Jarama Series: The First Casualty and the Lost Trucks.&rdquo; The Volunteer, February 16, 2016. <a href=\"https://albavolunteer.org/2016/02/jarama-series-the-first-casualty-and-the-lost-trucks/\">https://albavolunteer.org/2016/02/jarama-series-the-first-casualty-and-the-lost-trucks/</a>.<br />\r\n<br />\r\nLike a Local Tours. &ldquo;History of Williamsburg Brooklyn,&rdquo; n.d. <a href=\"https://www.likealocaltours.com/williamsburg-brooklyn-history/\">https://www.likealocaltours.com/williamsburg-brooklyn-history/</a>.<br />\r\n<br />\r\nIsserman, Maurice. &ldquo;Opinion | When New York City Was the Capital of American Communism.&rdquo; The New York Times, October 20, 2017, sec. Opinion. <a href=\"https://www.nytimes.com/2017/10/20/opinion/new-york-american-communism.html\">https://www.nytimes.com/2017/10/20/opinion/new-york-american-communism.html</a>.<br />\r\n<br />\r\nWilliam Loren Katz, and Marc Crawford. The Lincoln Brigade. Wipf and Stock Publishers, 2013.</p>\r\n",
    "student_fname": "Mishel",
    "student_lname": "Gica",
    "tags": [
        "Finnish",
        "Brunete Offensive",
        "Tailor",
        "Jarama",
        "Member Of Communist Party",
        "Brooklyn"
    ],
    "volunteer_fname": "Stanley",
    "volunteer_images": [],
    "volunteer_lname": "Etela"
}