{
    "class": 2024,
    "data": "<p>Owen Appleton was born on November 1, 1909 in Massachusetts to Allen Lanson Appleton and Lydia Dexter Appleton. His family was “one of the most prominent in the city” (presumably Springfield, MA) and his grandfather, J. H. Appleton, was long active in banking circles. I was unable to find further information on his early life, family, or education.<br /><br />He graduated from Harvard in 1932 with honors and was a member of the Communist Party of the United States of America from at least 1933 onwards. His passport listed his address as 221 East 47th Street, NYC as of February 2, 1937 in Midtown East. At this time the neighborhood was undergoing a transformation into a major economic and cultural center due to the construction of Grand Central, the Empire State Building, and the Chrysler Building shortly before Owen moved here. It is unknown what his experiences were with the neighborhood, how active he was in the Communist Party, or what exactly motivated him to volunteer.<br /><br />He sailed aboard the Paris on February 6 of 1937 and arrived in Spain on February 17, right after the start of the Battle of Jarama. The unit he would serve with, the Lincoln Battalion, sustained heavy casualties during the battle and were joined with the Washington Battalion (who had suffered a similar fate) to form the Lincoln-Washington Battalion as part of the XV International Brigade on March 20. Appleton joined the battalion as a lieutenant and battalion clerk, typist, and secretary, likely due to his Harvard education. However, it is unclear if he joined before or after the merger occurred or if he was at Jarama.<br /><br />The XV Brigade participated in the Battle of Brunete in July. Despite both sides claiming victory, Republican forces suffered heavy losses, with many brigades losing over half their number. Towards the end of the battle, morale was at an all-time low, resulting in insubordination and desertion.<br /><br />The XV Brigade then suffered another loss during the Zaragoza Offensive (August to September). Despite the brigade being part of the successful Battle of Belchite, the overall offensive failed and resulted in a devastating Nationalist counteroffensive. The Republicans again suffered heavy losses and morale was low.<br /><br />Sources disagree on the exact date and circumstances of Owen Appleton’s death. The Harvard Crimson says he was shot on October 17, 1937 while, the Abraham Lincoln Brigades Archive says he died on October 18 when the trench he was in collapsed during bombing, and the image we have lists the date of death as October 13. His death was reported to his family on November 26.</p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1TxhQq03ATIlwry2PVYqB5MZZ0_Z4NP2p, https://drive.google.com/open?id=1rNnEixdQPPjXffzKfypfywre4M7c661I",
            "src": ""
        }
    ],
    "sources": "<p>\"Appleton, Harvard '32, Killed Serving in Loyalist Forces.\" The Harvard Crimson, 27 Nov. 1937, <a href=\"https://www.thecrimson.com/article/1937/11/27/appleton-harvard-32-killed-serving-in/\">https://www.thecrimson.com/article/1937/11/27/appleton-harvard-32-killed-serving-in/</a><br /><br />\"Appleton, Owen.\" The Abraham Lincoln Brigade Archives, accessed 6 Jun. 2024, <a href=\"https://alba-valb.org/volunteers/owen-appleton/\">https://alba-valb.org/volunteers/owen-appleton/</a><br /><br />\"APPLETON, Owen.\" SIDBRINT, University of Barcelona, accessed 6 Jun. 2024, <a href=\"https://sidbrint.ub.edu/ca/node/25235</p>\">https://sidbrint.ub.edu/ca/node/25235</p></a>",
    "student_fname": "Petr",
    "student_lname": "Ermishkin",
    "tags": [
        "Communist",
        "Communist Party",
        "Lieutenant",
        "Died in Spain",
        "Harvard",
        "Ebro Offensive",
        "Aragon Front",
        "Battle of Belchite",
        "Massachusetts",
        "Battalion Secretary",
        "Belchite",
        "Clerk",
        "Communist Party USA",
        "Typist"
    ],
    "volunteer_fname": "Owen",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1qixmUXixB_82Z-ff2nYRRkNJUKRNBUjz",
            "src": ""
        }
    ],
    "volunteer_lname": "Appleton",
    "year_published": 2024
}