{
    "class": 2026,
    "data": "<p>Louis Kamenetzky was born in Brooklyn, New York in 1911 to Jewish parents. Being a Jew would later influence his ideologies and actions he would take. Though not explicitly stated, his parents were of Russian descent. Anti-Semitism and constant targets on Jews in the Russian Empire became a primary reason for migration to the US. For Louis Kamenetzky, it wasn’t easy to live a normal life in the US. Often bullied for his Russian heritage and language barriers, life was not the easiest for the young Kamenetzky. Growing up in Brooklyn added to his early obstacles. Racial slurs and attacks were part of his daily life. Though it was harmful, it made him the man he would be in the future. <br /><br />Life took a turn for the young Kamenetzky who decided to join the Communist Party of the United States of America from a very young age. The Communist Party of the United States of America (CPUSA) was established in 1919 following the Russian Revolution. Young communist living in America were quick to join in support of their ideologies. For Kamenetzky, it was a no-brainer. He was quickly to join the party with many of his communist friends and peers. An establishment of a “Workers School” provided a school for many who joined the party. Though there was little evidence stating his studies there, Kamenetzky did spend years studying and becoming a member of the party through the workers' school.  Like Kamenetzky, many of those who joined were involved in pursuing going to Europe. As Europe was in turmoil, these young communist were ready to fight for their beliefs. Louis Kamenetzky had more than one reason to fight in Europe. The persecution of Jews was a big reason for his move to Spain. He wanted to fight for his ideology and his jewish heritage. He believed it was his responsibility to help out his fellow communist people and fight against fascism. <br /><br />As 1937 arrived, Europe took a complete new turn. The Spanish civil war continued with its arduous battles. Hitler’s anti-semitiesm showed its worst signs. The building of concentration camps and persecution of all jews was on rise. His ally Mussolini had the same ideology and continued the persecutions. All this especially angered the now twenty-six year old Louis Kamenetzky. His communist ideas filled his mind with hatred against fascism. This combination was the call he needed to go fight in Spain. As March came, Kamenetzky awaited his trip to Spain. <br /><br />On March 17, 1937, Kamenetzky aboard the President Roosevelt began his month- long journey to Spain. Around this time, many found secret routes and ways to go to Spain. While some got caught or didn’t have enough will to continue, many were willing to risk it all to fight. One of them was Louis Kamenetzky. His months-long journey was anything but tranquil. Food and water were scarce, hiding from authorities was necessary, and the rough sea was always there for trouble. However, he managed to survive all and reached Spain on May 25, 1937. There with many other volunteers he began his journey in the Spanish civil war. <br /><br />Louis Kamenetzky was enlisted as a driver when he arrived in Spain. Many others that came with him were split into other occupations. He served with the Albacete Auto Park. There he was often met with respect due to his ability as a driver. In Spain, driving and maintaining a vehicle was not a common skill-set. It was a risky job, but was a major asset to the war. Though not much was heard of his experience as a driver, it was hinted he was satisfied with his work. Often writing letters was a way to pass time for Kamenetzky. He would write letters back home to his friends and lover. Though not much was found of the letters he wrote during the war, he wrote about the enjoyment he achieved being a part of the war. Even after the war, he stayed in Spain as he said in his letter. He continued to pursue his ideas in Spain and often wrote about it. To his lover, Eslelle, he talked about his work and even complained about things happening in Spain. After his return back to the USA, he would continue to live on and tell his story until his death. Surviving in the war was such an accomplishment in his life, unfortunately, old age came up with him resulting in his death. Though it was not found when exactly he died, he lived on until his age caught up with him. <br /></p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1vnHlNa6sSQrMYpwqNNf4ZNVUYEhZEtCx",
            "src": ""
        }
    ],
    "sources": "<p>“KAMENETZKY, Louis | SIDBRINT.” n.d. Sidbrint.ub.edu. Accessed May 6, 2024. <a href=\"https://sidbrint.ub.edu/ca/node/30100\">https://sidbrint.ub.edu/ca/node/30100</a>.<br /><br />“Kamenetzky, Louis.” 2019. The Abraham Lincoln Brigade Archives. December 10, 2019. <a href=\"https://alba-valb.org/volunteers/louis-kamenetzky/?searchterm=kamenetzky\">https://alba-valb.org/volunteers/louis-kamenetzky/?searchterm=kamenetzky</a>.<br /><br />“Archival Collections.” n.d. Specialcollections.library.nyu.edu. Accessed May 6, 2024. <a href=\"https://specialcollections.library.nyu.edu/search/?utf8=%E2%9C%93&q=John+e+bak\">https://specialcollections.library.nyu.edu/search/?utf8=%E2%9C%93&q=John+e+bak</a><br /></p>",
    "student_fname": "Arithra",
    "student_lname": "Saha",
    "tags": [
        "Driver",
        "Jewish Volunteers",
        "Russian American"
    ],
    "volunteer_fname": "Louis",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1gYINg6sTPhZ4xmX6-vTEB0CaV9HCNEcW",
            "src": ""
        }
    ],
    "volunteer_lname": "Kamenetzky",
    "year_published": 2024
}