{
    "class": 2024,
    "data": "<p>Martha Ester/Esther Mitchell was born on July 19, 1899 in Philadelphia, Pennsylvania. She was born into a Jewish household, and her family would eventually move to New York City. As an adult, she worked as a dental nurse and lived at 119 West 57th Street. In the years leading up to the Spanish Civil War, she would find herself involved with the growing leftist movements of the city, particularly a group of doctors, dentists, ambulance drivers, and nurses that desired to volunteer overseas to provide medical aid to the Spanish Republic. Mitchell was driven to provide specialized aid she knew the Republic wouldn’t have, and being Jewish, Mitchell saw the fight in Spain as a fight against the power of fascism and anti-semitism. This group, Mitchell included, would join The American Medical Bureau (AMB) and began heading over to Spain during March of 1937. Before she could get to Spain though, she had to first pass through central France, staying at Hotel Montholon Lafayette along the way with a few other volunteers to avoid being intercepted. She was 38 when she arrived in Spain. <br /><br />A certain dentist in this group, by the name of John Jacob Posner, was a celebrity in the world of dentistry and was well known for his revolutionary techniques in treating maxillofacial (jaw and face) injuries. In 1930, he had even been invited by King Alfonso XIII to give a lecture at Madrid’s School of Dentistry. With Posner’s reputation and connection with Spain, he was seen as a figure of sorts amongst the AMB. He was 49 when he arrived. Mitchell would serve as his assistant in dental surgeries in her time volunteering with AMB group 2, and the two would grow close during the war as they were deployed to hospitals. However, it was not easy-goings by any means and they would both struggle to work alongside their supposed allies. Mitchell did not enjoy the Soviet communist presence in Spain, and Posner would often demand that American doctors and Spanish doctors ate at different tables, an action that some nurses would criticize as “contrary to the communist spirit of the International Brigades.” <br /><br />After serving about eight months as a medical volunteer, Mitchell would return to the U.S. on November 8, 1937 onboard the Normandie. Inspired by the work she had aided Posner in carrying out in Spain, Mitchell herself would become an oral surgeon, specializing in the removal of harmful tissue and foreign material. In 1938, The House of Representatives established the Special House Committee on Un-American Activities (HUAC), also known as the Dies Committee. The committee, headed by Martin Dies, investigated aid efforts to Spain and attempted to deem them as communist in an effort to encourage America’s neutrality in the war. This committee was part of a larger investigation into communism in American society and politics, which is documented in the congressional report, “Scope of Soviet Activity in the United States'', where Mitchell is mentioned. The committee interviewed volunteers and would eventually interview an eager and willing Mitchell. Mitchell, in her interview, testified that the majority of donations from the American people, intended to go to American and Spanish hospitals that treated Spaniards, were actually going to Soviet hospitals that treated the International Brigades. She asserted that if the American people knew of this, they would have never sent money over. <br /><br />Once Posner returned on January 2, 1938 onboard the Champlain, he and Mitchell would get married. For a while, they lived and worked together in private practice in NYC. However, in 1940, Mitchell and Posner would get divorced and Mitchell would move to Brooklyn. </p>",
    "school_crests": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "sources": "<p>‌Martha Ester Mitchell Was Born #Otd in Philadelphia, 1899. She Worked as a Nurse for a Dentist before She Arrived in Spain after She Received Her Passport on March 24, 1937. She Served with AMB and Assisted with Dental Surgeries until She Returned to the US by November 8, 1937. n.d.Photography. Accessed June 7, 2024. <a href=\"https://bsky.app/profile/lincolnbrigade.bsky.social/post/3k2vc7pfnls2z\">https://bsky.app/profile/lincolnbrigade.bsky.social/post/3k2vc7pfnls2z</a>.<br /><br />‌Massons, Josep Maria, and Marta Costa i Naudó. 2008. Review of Atenció Odontològica a Les Brigades Internacionals. Gimbernat, 2008. <a href=\"https://raco.cat/index.php/Gimbernat/article/view/139764/190942\">https://raco.cat/index.php/Gimbernat/article/view/139764/190942</a>.<br /><br />Review of Mitchell, Martha Ester Biography. n.d. The Abraham Lincoln Brigade Archives . The Abraham Lincoln Brigade Archives . Accessed June 7, 2024. <a href=\"https://alba-valb.org/volunteers/martha-ester-mitchell/\">https://alba-valb.org/volunteers/martha-ester-mitchell/</a>.<br /><br />‌Review of Mitchell, Martha Ester. n.d. Internationale Frauen Im Spanischen Krieg 1936 - 1939. Ingrid Schiborowski. Accessed June 7, 2024. <a href=\"https://internationale-frauen-im-spanischen-krieg-1936-1939.de/M/Mitchell,%20Martha%20Ester.html\">https://internationale-frauen-im-spanischen-krieg-1936-1939.de/M/Mitchell,%20Martha%20Ester.html</a>.<br /><br />‌Review of Posner, John Jacob Biography. n.d. The Abraham Lincoln Brigade Archives . The Abraham Lincoln Brigade Archives . Accessed June 7, 2024. <a href=\"https://alba-valb.org/volunteers/john-jacob-posner/\">https://alba-valb.org/volunteers/john-jacob-posner/</a>.<br /><br />‌Review of Scope of Soviet Activity in the United States. 11AD. Internet Archive. Internet Archive. 11AD. <a href=\"https://archive.org/details/ScopeOfSovietActivityInTheUnitedStates/Scope%20of%20Soviet%20activity%20in%20the%20United%20States%20Volume%207/page/n55/mode/2up\">https://archive.org/details/ScopeOfSovietActivityInTheUnitedStates/Scope%20of%20Soviet%20activity%20in%20the%20United%20States%20Volume%207/page/n55/mode/2up</a>.<br /><br />‌Smith, Eric R. 2013. American Relief Aid and the Spanish Civil War . Edited by Clair Willcox. Columbia, Missouri: University of Missouri Press. <a href=\"https://dokumen.pub/american-relief-aid-and-the-spanish-civil-war-1nbsped-9780826273062-9780826220097.html\">https://dokumen.pub/american-relief-aid-and-the-spanish-civil-war-1nbsped-9780826273062-9780826220097.html</a>.<br /><br />‌Sugarman, Martin. n.d. Review of Jews in the Spanish Civil War. Jewish Virtual Library. Jewish Virtual Library. Accessed June 7, 2024. <a href=\"https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war.</p>\">https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war.</p></a>",
    "student_fname": "Elaine Faith",
    "student_lname": "Wong",
    "tags": [
        "American Medical Bureau",
        "Doctor",
        "Passport",
        "Nurse",
        "Normandie",
        "Dentist",
        "Jewish",
        "Hospital"
    ],
    "volunteer_fname": "Martha Ester/Esther",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1s7Qw4Oeb8Dfae5E1Jgry0XfeXg5fcOM7",
            "src": ""
        }
    ],
    "volunteer_lname": "Mitchell",
    "year_published": 2024
}