{
    "class": "2021",
    "data": "<p>John Wegrzynek was born in a small town called Iskrzynia in southern Poland, on October 20th, 1901 to Stanislaw and Marianna Wegrzynek. He sailed to the US along with his parents and his sibling aboard the SS Vanderland from Antwerp, Belgium. Upon arrival, his family stayed with relatives in Buffalo, New York and became naturalized (receiving Passport #372703). Much like other Poles during the time in industrial cities, he was attracted to metalworking and he remained in the trade for much of his 20&rsquo;s and early 30&rsquo;s. This job provided him with financial security, allowing him to move to New York City where he resided at 239 E 13th Street in Manhattan. In 1937, he registered under the Communist Party, placing him on various watchlists in the US government. Upon enlisting in the Abraham Lincoln Brigade (in the &ldquo;terra corps&rdquo;), he immediately became a point of interest in the eyes of intelligence agencies who reported on the ties between the Communists and the XV Brigade. In the purest version of McCarthy-ism, just like many of his fellow Communist Party members, he was suspected of forging documents and espionage by the Special Committee on Un-American Activities.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>At 36 years of age, Wegrzynek set sail to Spain on March 18th, 1937 aboard the Normandie. Along with numerous other Polish volunteers, he arrived on April 2nd. Little is known about his time in Spain, however, as there are practically no records of him serving shoulder to shoulder with the XV Brigade, it is likely that he served in the Palafox Battalion (a part of the larger Dabrowski Brigade) much like many other Poles in his timeframe there. On a short slip of paper, he was described in Spanish by his peers as being &ldquo;...very well developed politically&hellip;&rdquo; and &ldquo;...very active.&rdquo;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>After serving in Spain for a year and three months, he returned to New York City aboard the Champlain on July 20th, 1938. Nothing is known about his activity in the U.S. after his deployment. He did not join any veterans&rsquo; associations, unions, nor did he participate in any censuses or get married. He is survived by his niece, who recognized his face in an identification effort on a forum.</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;Veterans Returning on the Champlain July 20, 1938.&rdquo; Americans in the Spanish Civil War, 23 Mar. 2012, <a href=\"http://brooksarp.wordpress.com/2008/06/26/veterans-returning-on-the-champlain/\" target=\"_blank\">brooksarp.wordpress.com/2008/06/26/veterans-returning-on-the-champlain/</a>.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&ldquo;WEGRZYNEK, John.&rdquo; SIDBRINT, <a href=\"http://sidbrint.ub.edu/ca/node/37988\" target=\"_blank\">sidbrint.ub.edu/ca/node/37988</a>.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><a href=\"http://sovdoc.rusarchives.ru/sections/organizations//cards/234380/images\" target=\"_blank\">http://sovdoc.rusarchives.ru/sections/organizations//cards/234380/images</a></p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&ldquo;Wegrzynek, John.&rdquo; The Abraham Lincoln Brigade Archives, 20 Apr. 2021, <a href=\"http://alba-valb.org/volunteers/nathan-norman-budish/.Ballela\" target=\"_blank\">alba-valb.org/volunteers/nathan-norman-budish/.Ballela</a>,</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>David. Investigation of Un-American Propaganda Activities in the ..., Part 9, Volume 1 By United States. Congress. House. Special Committee on Un-American Activities (1938-1944)</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><a href=\"https://www.facebook.com/iskrzyniawiesnadwislokiem\" target=\"_blank\">https://www.facebook.com/iskrzyniawiesnadwislokiem</a></p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "student_fname": "Rafal",
    "student_lname": "Chociej",
    "tags": [
        "Member Of Communist Party",
        "Polish"
    ],
    "volunteer_fname": "John",
    "volunteer_images": [],
    "volunteer_lname": "Wegrzynek"
}