{
    "class": 2024,
    "data": "<p>Bertrand “Bert” Blanchard Acosta was born on January 1st, 1895 in San Diego, California. He was, to put it simply, an adrenaline junkie with a fixation on planes.  In his early teens, he built his own glider and later a working powered-plane, all after being kicked out of school. This attracted Glenn H. Curtiss, America’s first aircraft manufacturer. Curtiss, impressed with Acosta’s aviation ability, sought to make use of his skills. First, he put Acosta through the Throop Polytechnic Institute. Afterwards, Curtiss formed a mentor-apprentice relationship with Acosta, teaching him everything about planes. Acosta would later test fly and demonstrate for Curtiss regularly.<br /><br />By 1911, at the age of sixteen, Acosta was a flight instructor at North Island, San Diego, Curtiss’s base of operations. In 1915, Acosta joined Curriss’s flight school in Toronto (formed in partnership with John McCurdy), becoming a flight instructor for Canadian pilots bound for Europe. In 1917, Acosta moved to Mineola, Long Island and started training Europe-bound US Navy pilots. He originally applied to go fight, but was denied due to his years of experience teaching flight being too valuable. It also might have also been an effect of Acosta’s infamous “bad boy of the air” persona; in his years working for Curtiss, Acosta developed a lifestyle of flying recklessly and constant flirting. <br /><br />When the Great War ended in 1918, many things happened to Acosta. Firstly, he went back to test flying and demonstrating planes for Curtiss, similarly to his pre-war life. Secondly, he married Marie Louise Brumley Kelsey, the exact date of the marriage is unknown. With her, he had two daughters. However, he would get divorced in 1920, most likely because he was constantly drunk and unfaithful. Third, he became a pilot for the US Postal Service, planning and flying air routes for the next two years. <br /><br />In the 1920’s, he got into airplane racing. In the first Pulitzer Trophy Race (November 27, 1920), Acosta got third. The following year, Acosta won first place at the Pulitzer, setting a world record speed of nearly 177 mph. This record brought both Acosta’s fame and arrogance to legendary heights. He had married Helen Belmont Pearsall some time in 1920 and had two sons with her. However, he did not change the habits that cost him his first marriage. He also began to do dangerous stunts during demonstrations of new plane models: flipping in the air, flying upside down, nosediving nearly vertical, flying only a few feet off the ground, and such.<br /><br />His daredevilry came to a head on June 28, 1923. In a demonstration, in the midst of a high-speed, low-altitude barrel-roll, the plane engine misfired and did not restart. The crash, while not fatal, had Acosta in a hospital bed for weeks, unable to discern fantasy from reality.<br /><br />The crash broke Acosta’s sense of indestructibility, dragging him down into  depression. His fame and fortune from the Pulitzer Trophy Race was also disappearing. Thus, he smothered his troubles in flying fast and drinking hard. However, on October 7, 1923, he was arrested for drunk driving, temporarily suspending his pilot's license. He had also split ways from Curtiss the previous year. All of this combined left Acosta a shell of a man, yearning to be in the spotlight one more time. <br /><br />His chance came in 1927 when he was given the chance to fly the world’s first transatlantic flight. While training for the long flight, Acosta set the new world record for longest flight in the air with Clarence Chamberlin, a stunning 51 hours and 11 minutes of flight. Then troubles began. A dispute between financial sponsors resulted in Acosta flying a wholly different plane with a wholly different crew. Then, the plane, the America, was constantly developing problems, delaying the launch. Furthermore, Acosta could not fly with the instruments aboard the plane. All of these issues cost the America time, making the crew the third plane to cross the Atlantic. Technically, they didn’t even make it to their destination of Paris, instead crashing just outside of the city limits. <br /><br />The crash was publicly known as a side-effect of poor weather, but Acosta was quietly blamed since he was piloting at the time. If Acosta had few sponsors before the doomed flight of the America, he had even less now. His drunkard behavior got his pilot’s license suspended once more and the Great Depression destroyed Acosta’s attempt of building a business. The early 1930’s was a financial struggle for Acosta. <br /><br />But, in 1936, Spain sent out a message:  any pilot that came to fight for the Republic would be paid $1,500 (about $33.8k in modern value) a month and a further $1,000 (about $22.5k in modern value) bounty for every downed plane. Acosta, yearning for the fame and fortune he had a decade earlier, signed up for the six-membered Yankee Squadron, setting sail for Spain that October. What exactly he did in Spain, however, is still uncertain. He definitely saw combat against the Condor Legion, and definitely in a plane unsuited for air-to-air combat (Acosta was quoted, saying “We were flying old crates.”). Some sources say Acosta had done nothing due to the poor quality of the planes, while others say he had downed three German fighters. Either way, he returned home two months later.<br /><br />His return home was not to the call of the public, but the courts instead. He had violated the Neutrality Act and thus permanently lost his license to fly. Furthermore, the money the Republic owed him for his service was never paid. It came to the point where he and Gordon Berry, another Yankee Squadron pilot, attempted to stop the freighter, Mar Cantabrico, loaded with engines, planes, and other military equipment bound for Republican Spain in an effort to get the money owed to them, a total of $6,100 ($135.6k in modern value). However, the US Coast Guard let the ship go and both Acosta and Berry never got paid.<br /><br />Acosta, unable to fly and unable to make a true living, lived the rest of his life a drifter, going from job to job. To cope with his depression, he turned back to the bottle. His poor mental health and constant state of drunkenness landed him in jail multiple times. In 1952, he collapsed in New York City from tuberculosis. He moved out of the city afterwards, later dying in Denver Colorado on September 1, 1954 at the age of 59.</p>",
    "school_crests": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "sources": "<p>Ink, Social “Acosta, Bert Blanchard”, In The Abraham Lincoln Brigade Archive, 2024 <a href=\"https://alba-valb.org/volunteers/bert-blanchard-acosta/\">https://alba-valb.org/volunteers/bert-blanchard-acosta/</a><br />Lanius, Roger “Bert Acosta and the ‘Golden Age of Flight’”, In Roger Lanius’s Blog, 2015<br /><a href=\"https://launiusr.wordpress.com/2015/12/11/bert-acosta-and-the-golden-age-of-flight/\">https://launiusr.wordpress.com/2015/12/11/bert-acosta-and-the-golden-age-of-flight/</a><br />O’Connor, Derek “Bert Acosta: Bad Boy of the Air”, from history.net, Last Modified 2017<br /><a href=\"https://www.historynet.com/bert-acosta-bad-boy-of-the-air/\">https://www.historynet.com/bert-acosta-bad-boy-of-the-air/</a><br />Cisneros, Norberto “Bert Acosta: Genius of Early Aviation”, Air Mail Pioneers, 1999<br /><a href=\"https://www.airmailpioneers.org/content/Pilots/Acosta.htm\">https://www.airmailpioneers.org/content/Pilots/Acosta.htm</a> <br />Dickon, Chris “Spanish Civil War”, Americans at War in Foreign Forces, undated<br /><a href=\"http://www.americansatwarinforeignforces.com/named-american-fighters-in-the-spanish-civil-war.html\">http://www.americansatwarinforeignforces.com/named-american-fighters-in-the-spanish-civil-war.html</a><br />Unnamed, “3 U.S. Airmen Here to Explain Aid to loyalists. Acosta, Berry, Schneider Fly to Capital With Their Attorney”, The Washington Post, 1937<br /><a href=\"https://www.flickr.com/photos/richard_arthur_norton/2983636560/ </p>\">https://www.flickr.com/photos/richard_arthur_norton/2983636560/ </p></a>",
    "student_fname": "Joshua H",
    "student_lname": "Wong",
    "tags": [
        "Pilot",
        "WW1",
        "Mercenary",
        "Flight Instructor"
    ],
    "volunteer_fname": "Bertrand Blanchard",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1tVpiQQQf18TvvUNqmTKJSNAfwB6nsvjA, https://drive.google.com/open?id=1m2LURfpfX33BXZbLoDpvvYedn8Rd7W-G",
            "src": ""
        }
    ],
    "volunteer_lname": "Acosra",
    "year_published": 2024
}