{
    "class": "2024",
    "data": "<p>Matylda Jankovic was born on March 14, 1911 in New York to a Polish American and Jewish family. Not much is known about her childhood, but she likely was educated and raised in New York.<br />\r\nJankovic was living in Longwood, a dense neighborhood in southeast Bronx largely populated with Jewish European immigrants in the mid 20th century, before she left for Spain. She became a member of the North American Committee to Aid Spanish Democracy, a communist-affiliated organization dedicated to sending relief to Republican Spain during the war. She became a nurse and joined the American Medical Bureau, an independent association of American doctors and nurses who supported Spanish democracy. Ernest Hemingway notably organized a group of celebrities such as Joan Crawford to fundraise for the AMB, and by the time groups left for Spain they were among the best equipped medical groups in the world.</p>\r\n\r\n<p><br />\r\nOn March 18, 1937, Jankovic joined the second American group to board the Normandie and set sail for France. On the ship with her was Dr. John Posner, the famous New York ENT surgeon, as well as Dr. Abraham Friedman and the nurse Rebecca Schulman, who later worked with Jankovic at Villa Paz. Jankovic was among a group of young Jews, specifically Polish Jews, who made up a large proportion of the International Brigades. According to some estimates, up to 70% of the medical personnel volunteers in the brigade were Jewish, and it is likely that Jankovic joined the ranks of Jewish Americans who saw the movement as a way to fight back against fascism and oppression.</p>\r\n\r\n<p><br />\r\nAfter arriving in France, the group was driven to Spain in an ambulance by Victor Hirschfield, a fellow New Yorker. From there, Jankovic worked with the Republican Medical Service in Villa Paz, Benicassim, and Pozoblanco. Jankovic worked at multiple hospitals as a nurse, including the American Hospital of Villa Paz, the Czech Hospital of Benicassim, and the Jan Amos Komensky Hospital, where she served as head nurse. She was described by subordinates and patients as strong and brave, and acted as an interpreter for the surgical team of Dr. Joseph Masson, the Medical Captain of the XIII Brigade.</p>\r\n\r\n<p><br />\r\nLater, the Jan Komensky Hospital was evacuated from Benicassim to Matar&oacute;, Catalonia, and over the course of the war was moved again further north to Vic as the nationalist front advanced. It is unknown if Jankovic was still working there or not.</p>\r\n\r\n<p>In June 1938, after fifteen months in Spain, Jankovic returned to the US. She married Czeslaw Tadler, a decorated Polish soldier and active Communist. Tadler was a member of multiple communist parties in Warsaw and worked at a Polish automobile manufacturing company. He fought in Spain as a member of the International Brigades, which is most likely where he met Jankovic. They had one son, who died young.</p>\r\n\r\n<p><br />\r\nIn a 2005 leaked report known as the Wildstein List, the Tadlers were named among 240,000 Poles by the Polish communist government that linked all of them in some way to the Polish secret service. The list included former informers, secret service agents, and suspects of the Polish secret service without distinction. Although not everyone on the list was a spy, they were in some way under surveillance of the Polish government, and there is no way of knowing what degree of involvement the Tadlers had with the secret police.</p>\r\n\r\n<p><br />\r\nCzeslaw died on May 10, 1957 as a decorated Polish veteran, and his military funeral was held in Warsaw. Matylda lived the rest of her life in upstate New York, with her last known address in Westchester, and died at 59 in March 1970.</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;American Medical Bureau to Save Spanish Democracy, AMB, North American Committee to Aid Spanish Democracy.&rdquo; Memoria Historica Brigades Internacionals Databases - Webs SIDBRINT, accessed June 8, 2023, <a href=\"https://sidbrint.ub.edu/es/hospitals-militars-sanitat-de-les-brigades-internacionals/american-medical-bureau-save-spanish\">https://sidbrint.ub.edu/es/hospitals-militars-sanitat-de-les-brigades-internacionals/american-medical-bureau-save-spanish</a>.<br />\r\n&ldquo;Jankovic, Matilda.&rdquo; Memoria Historica Brigades Internacionals Databases - Webs SIDBRINT, accessed June 5, 2023, <a href=\"https://sidbrint.ub.edu/en/content/jankovic-matylda\">https://sidbrint.ub.edu/en/content/jankovic-matylda</a>.<br />\r\n&ldquo;Jankovic, Matylda.&rdquo; Abraham Lincoln Brigade Archives, accessed June 5, 2023, <a href=\"https://alba-valb.org/volunteers/matylda-jankovic/\">https://alba-valb.org/volunteers/matylda-jankovic/</a>.<br />\r\n&ldquo;Jewish Volunteers in the Spanish Civil War.&rdquo; Abraham Lincoln Brigade Archives, accessed June 8, 2023, <a href=\"https://alba-valb.org/resource/jewish-volunteers-in-the-spanish-civil-war/#:~:text=Of%20the%20approximately%203%2C000%20volunteers,early%20years%20of%20the%20century\">https://alba-valb.org/resource/jewish-volunteers-in-the-spanish-civil-war/#:~:text=Of%20the%20approximately%203%2C000%20volunteers,early%20years%20of%20the%20century</a>.<br />\r\nJirku, Gusti. Nosotros estamos con vosotros! : Mujeres antifascistas de distintos pa&iacute;ses hablan de su trabajo en Espa&ntilde;a. Madrid: Asociaci&oacute;n de Amigos de las Brigadas Internacionales, [2018]. 82 p.<br />\r\nKlodzinski, Stanislaw. &ldquo;Dr. Dorota Lorska.&rdquo; Medical Review Auschwitz. December 1, 2020. <a href=\"https://www.mp.pl/auschwitz/journal/english/253561,dr-dorota-lorska\">https://www.mp.pl/auschwitz/journal/english/253561,dr-dorota-lorska</a>.<br />\r\n&ldquo;Mathilda Tadler.&rdquo; Ancient Faces, accessed June 8, 2023, <a href=\"https://www.ancientfaces.com/person/mathilda-tadler-birth-1911-death-1970/11218241.&lt;/p&gt;\">https://www.ancientfaces.com/person/mathilda-tadler-birth-1911-death-1970/11218241.</a></p>\r\n",
    "student_fname": "Elizabeth",
    "student_lname": "Bryce",
    "tags": [
        "Benicassim",
        "Polish",
        "Nurse",
        "Jewish",
        "Villa Paz",
        "North American Committee to Aid Spanish Democracy",
        "American Medical Bureau",
        "Jan Komensky Hospital"
    ],
    "volunteer_fname": "Matylda",
    "volunteer_images": [],
    "volunteer_lname": "Tadler nee Jankovic"
}