{
    "class": "2023",
    "data": "<p>Though there is limited information available on Alexander Schwartzman, we can infer that his life was shaped by a profound sense of duty and a commitment to justice. He was a Jewish man living in a time where anti-Semitism was on the rise, Schwartz man&rsquo;s decision to join the fight against fascism wasn&rsquo;t merely an act of political defiance&ndash; it was a personal call to defend his community from the forces of hatred and bigotry.</p>\r\n\r\n<p><br />\r\nSchwartzman grew up in Brooklyn (40 Monroe St); he lived in the middle of 5 schools, so I would guess he attended elementary at P.S. 56 Lewis H Latimer (a block away) then headed to high school at one of the nearby locations (Urban Assembly Unison School or Bedford Academy High School). As a 26-year-old mail carrier from New York City, Schwartzman departed from the US on August 7th, 1937, aboard the Georgic. Although he was leaving behind his family, home, and the familiar streets of New York, his determination to join a just cause was unwavering.</p>\r\n\r\n<p><br />\r\nUpon arriving in Spain via Massanet on August 19, 1937, Schwartzman joined the XV Brigade, an international brigade that was primarily composed of British and Irish volunteers. He underwent officer training school (OTS) and eventually became a part of the Lincoln Washington Battalion, a majority American group where he felt a stronger sense of camaraderie. As a Soldado, he fought valiantly alongside his fellow volunteers, standing against the fascists and defending the values of democracy. His service in the LW Battalion allowed him to forge bonds with fellow fighters who shared his dedication to a common cause and deepened his understanding of the human cost of war.</p>\r\n\r\n<p><br />\r\nOn March 10, 1938, during a series of retreats, Schwartzman was wounded in action near Caspe. Undeterred by his injury, he continued to serve in the war-torn country, displaying courage and resilience in the face of adversity. Finally, on August 28, 1938, Alexander Schwartzman returned to the United States aboard the De Grasse, forever changed by his experiences on the front lines of the Spanish Civil War.<br />\r\nThe outbreak of World War II found Schwartzman ready to serve again. His passion for the cause was evident in his swift response to the call to arms, joining the U.S. Army as a Staff Sergeant. This role demanded courage, leadership, and dedication - qualities that Schwartzman possessed in abundance, likely honed during his time in Spain. His time serving as a bombardier demonstrated his intense passion to counteract the devastation he had witnessed in Spain. His letter home, in which he describes his role as &quot;a dream coming true,&quot; reveals a man compelled not by a desire for violence, but by a wish for retaliation against the forces of fascism that had caused such destruction. There was a sense of personal vindication in being able to strike back against the tyranny he had seen first-hand. Furthermore, his role as an interpreter underscored his commitment to bridging divides and promoting understanding among allies. His knowledge of Spanish, gained during his time in Spain, was not only a practical skill but also a testament to his empathy and his willingness to connect with other cultures. By using his language skills to translate to the French, Schwartzman facilitated communication within the Allied forces, contributing to the coordination and cooperation necessary for the war effort.</p>\r\n\r\n<p><br />\r\nAlexander Schwartzman passed away on September 7, 1989, in Branchport, Yates, New York, leaving behind a legacy of courage and resilience. He was laid to rest in Bath National Cemetery, Bath, New York, a symbol of his selflessness and devotion to the causes he held dear.</p>\r\n\r\n<p><br />\r\nAs we study and remember the life of Alexander Schwartzman, we are reminded of the importance of standing up for one&#39;s beliefs and the power of collective action. In a time of increasing global challenges, his story inspires us to continue the fight for justice, equality, and freedom for all, exemplifying the potential for ordinary people (why I couldn&rsquo;t find a picture of him) to make extraordinary contributions to the betterment of the world.</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;Schwartzman, Alexander | The Abraham Lincoln Brigade Archives.&rdquo; 2022. The Abraham Lincoln Brigade Archives. December 3, 2022. <a href=\"https://alba-valb.org/volunteers/alexander-schwartzman/\">https://alba-valb.org/volunteers/alexander-schwartzman/</a>.<br />\r\n<br />\r\nBallela, David. n.d. &ldquo;Alexander Schwartzman: Letters Home From WW2 Part 2.&rdquo; <a href=\"http://knickerbockervillage.blogspot.com/2008/01/alexander-schwartzman-letters-home-from_07.html. &lt;/p&gt;\">http://knickerbockervillage.blogspot.com/2008/01/alexander-schwartzman-letters-home-from_07.html. </a></p>\r\n",
    "student_fname": "Asia",
    "student_lname": "Chen",
    "tags": [
        "ALBA",
        "Jewish",
        "XV Brigade",
        "WWII Veteran"
    ],
    "volunteer_fname": "Alexander",
    "volunteer_images": [],
    "volunteer_lname": "Schwartzman"
}