{
    "class": 2026,
    "data": "<p>Edgar Lawrence Acken was born on November 18, 1906, in Millburn, New Jersey. He served in Florida's National Guard for a year and a half before being hired by the American Newspaper Guild. Acken climbed the ranks, becoming one of the staff of the Newark Ledger, until a worker’s strike cut his career short. Before 1934, his political views were undocumented, but his involvement in the socialist party pointed towards the fact he had a strong sense of activism. <br /><br />He moved to New York City between November of 1934, when the worker union happened, and December of 1936. His passport in documents that by December 1936, he lived at 632 2nd Street, Brooklyn, New York, near Prospect Park. There, he would work under the International Labor Defense. <br /><br />Around his 31st birthday, Acken would enlist in the Spanish Civil War. He would arrive in Spain on January 6, 1938, joining the 15th brigade. During many battles throughout the war, he spent time with two friends on multiple different fronts; their names were George Boehm and Ray Anderson. <br /><br />Eventually he was captured by two red-capped Raquettes in Gandesa on April 3rd, 1938, during the great retreats. Originally, the men who captured him thought about shooting him on sight; however, they decided to turn him for credit. His entire life was summed up to simple praise, showing the difficulty for people on the republican side to fight. <br /><br />It's not documented where he was sent after capture, but based on the experiences of other POWs in the Spanish Civil War, he was likely sent to a concentration camp like San Pedro de Cardeña. Prisoners there were regularly tortured or executed. <br /><br />He was eventually brought to San Pedro, where he was one of the first 14 prisoners that were traded back into freedom. He was returned to New York by the boat, The Queen Mary, on October 18, 1938. He relocated to Vermont afterwards. <br /><br />Most sources reported that he died on February 17, 1978,  but some sources state claim he died on May 5th of the same year, however, both say due to the same cause.</p>",
    "school_crests": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "sources": "<p>“Acken, Edgar Lawrence.” SIDBRINT. Accessed June 7, 2024. <a href=\"https://sidbrint.ub.edu/en/content/acken-edgar-lawrence\">https://sidbrint.ub.edu/en/content/acken-edgar-lawrence</a>. <br />Forbes, Donald  H. “Two Communist Brothers from Washington, New Hampshire and Their Fight against Fascism.” Google Books. Accessed June 7, 2024. <a href=\"https://books.google.com/books?id=6Le6BQAAQBAJ&pg=PA50&lpg=PA50&dq=%22edgar+lawrence+acken%22&source=bl&ots=vBeJwQwKLc&sig=ACfU3U3oatmXFKyGKcssKoYpnXP2Nxq3KA&hl=en&sa=X&ved=2ahUKEwjY0M_00smGAxXHEFkFHVxKN4wQ6AF6BAgQEAI#v=onepage&q=\"edgar%20lawrence%20acken\"&f=false\">https://books.google.com/books?id=6Le6BQAAQBAJ&pg=PA50&lpg=PA50&dq=%22edgar+lawrence+acken%22&source=bl&ots=vBeJwQwKLc&sig=ACfU3U3oatmXFKyGKcssKoYpnXP2Nxq3KA&hl=en&sa=X&ved=2ahUKEwjY0M_00smGAxXHEFkFHVxKN4wQ6AF6BAgQEAI#v=onepage&q=\"edgar%20lawrence%20acken\"&f=false</a>. <br />Ink, Social. “Acken, Edgar Lawrence.” The Abraham Lincoln Brigade Archives, May 24, 2022. <a href=\"https://alba-valb.org/volunteers/edgar-lawrence-acken/. </p>\">https://alba-valb.org/volunteers/edgar-lawrence-acken/. </p></a>",
    "student_fname": "Tauhid",
    "student_lname": "Chowdhury",
    "tags": [
        "15th Brigade",
        "POW",
        "International Labor Defense",
        "XV Brigade",
        "Queen Mary",
        "Gandesa retreats",
        "Socialist Party",
        "Brooklyn"
    ],
    "volunteer_fname": "Edgar Lawrence",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1qIvzJL3XhcaEAWN3KplTljpUt4RYPQla, https://drive.google.com/open?id=1rtrk_NighzUuhKbE0_IkNqnR2qExaSGo",
            "src": ""
        }
    ],
    "volunteer_lname": "Acken",
    "year_published": 2024
}