{
    "class": 2024,
    "data": "<p>Morris Goldstein was born in the small town of Fremont, Nebraska on January 9th, 1913, to mother Matilda Goldstein, who was born in Indiana USA and father Meyer Goldstein, who was born in Imperial Russia. Matilda passed away before Morris turned 8 and the family moved into the home of Morris’ sister and her husband Victor Steinberg. Morris was forced into poverty when his father died and he was sent to Hebrew National Orphan Home on East 7th street in NYC. There, as an orphan in abject poverty, Morris gained intimate knowledge of the sufferings of the lower class, culminating in his joining the Communist Party at just 19 years old. Inspired by his secondary adoptive father Victor Steinberg who worked in Omaha for a Ford assembly plant, Morris went to work as an auto worker, where he witnessed the auto industry’s burgeoning labor movement in the years leading up to the establishment of the UAW, likely inspiring his sympathies for the Republic side. From the years of 1932-1934, Morris studied at Columbia at the Seth Low Junior College, a school which allegedly was created to separate Columbia’s undesired Jews from the more amicable WASP population at its Morningside Height campus. This blatant anti-semetism added fuel to the flame of Morris’ anti-fascism as hatred of the Jews and fascist regimes were becoming inextricably linked.<br /><br />On June 4th, 1937, he set sail on board the Statendam, arriving in Rotterdam on the 13th of June. He made his way through the Netherlands into France, through the Pyrenees mountains to arrive in Setcases, Catalonia on June 26th, 1937. There he joined the Abraham Lincoln Brigade and was grouped in with the Canadian Mackenzie-Papineau Battalion, despite him being an American. He saw devastatingly traumatic action at the Ebro offensive, where 2 of his close brigadiers were killed. After the international brigades were withdrawn in September of 1938, Morris along with 49 other volunteers made their way to La Havre, France, and boarded the RMS Ausonia, which carried them back to New York City, arriving on December 20, 1938. Morris eventually moved to Washington D.C and married Rhoda Epstein. He died at the age of 91 on April 4th, 2004.</p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1072obp9Mpn5Oo_tXrvC_hXmCxiC6iyx5, https://drive.google.com/open?id=1_SoIctF2llm_qt5mHK6MDHI4JRCNsOw0",
            "src": ""
        }
    ],
    "sources": "<p>“1920 United States Federal Census.” Ancestry. Accessed June 8, 2024. <a href=\"https://www.ancestry.com/discoveryui-content/view/65844609:6061?tid=&pid=&queryId=2786a8bf-aac3-4bfb-832b-73427dd50637&_phsrc=Kap38&_phstart=successSource\">https://www.ancestry.com/discoveryui-content/view/65844609:6061?tid=&pid=&queryId=2786a8bf-aac3-4bfb-832b-73427dd50637&_phsrc=Kap38&_phstart=successSource</a>.<br /><br />Archives, Gjenvick-Gjønvik Archives - GG. “TSS Statendam Passenger List - 10 July 1937.” TSS Statendam Passenger List - 10 July 1937 | GG Archives. Accessed June 8, 2024. <a href=\"https://www.ggarchives.com/OceanTravel/Passengers/Holland-America/Statendam-PassengerList-1937-07-10.html\">https://www.ggarchives.com/OceanTravel/Passengers/Holland-America/Statendam-PassengerList-1937-07-10.html</a>.<br /><br />“Morris Goldstein 1925 Federal Census.” Ancestry. Accessed June 8, 2024. <a href=\"https://www.ancestry.com/discoveryui-content/view/20407724:2704?tid=&pid=&queryId=b4854537-209b-4b65-be37-788c4413a16f&_phsrc=Kap61&_phstart=successSource\">https://www.ancestry.com/discoveryui-content/view/20407724:2704?tid=&pid=&queryId=b4854537-209b-4b65-be37-788c4413a16f&_phsrc=Kap61&_phstart=successSource</a>.<br /><br />“Morris Goldstein Family Tree.” Ancestry. Accessed June 8, 2024. <a href=\"https://www.ancestry.com/family-tree/person/tree/176955921/person/412299626941/facts\">https://www.ancestry.com/family-tree/person/tree/176955921/person/412299626941/facts</a>.<br /><br />“Photo Unit #: B704 Morris Goldstein, Company 1 Commissar, Lincoln-Washington: Jul 1938.” Harry Randall: Fifteenth International Brigade Films and Photographs: NYU Special Collections Finding Aids. Accessed June 8, 2024. <a href=\"https://findingaids.library.nyu.edu/tamwag/alba_photo_011/images/bnzs7hrb/\">https://findingaids.library.nyu.edu/tamwag/alba_photo_011/images/bnzs7hrb/</a>.<br /><br />Sole, Jaume  Ramon i. “QUAN LA FOTOGRAFIA FA HISTÒRIA. LES BRIGADES INTERNACIONALS A TÀRREGA. MAIG DEL 1938.” DIALNET, n.d. <br /><br />Bailey, Bill, “Manuscript on U.S Volunteers, Box 4 Folder 19 Steve Nelson Papers, Tamiment Library and Robert F. Wagner Labor Archives, NYU Special Collections, New York City<br /><br /><br /></p>",
    "student_fname": "Tim",
    "student_lname": "Goretsky",
    "tags": [
        "seth low junior college",
        "communist party",
        "mackenzie-papineau battalion",
        "washington battalion",
        "jewish",
        "ebro offensive"
    ],
    "volunteer_fname": "Morris",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1sdWLdaf9UTV-rgHIoLYWBvWFUUg_lYsH",
            "src": ""
        }
    ],
    "volunteer_lname": "Goldstein",
    "year_published": 2024
}