{
    "class": 2024,
    "data": "<p>Jack Altman was born in Brownsville, a neighborhood in eastern Brooklyn, on December 9th, 1907, to an Orthodox Jewish family. As an adult, Altman lived in Sheepshead Bay at 2348 East 22nd Street. Prior to serving in the Spanish Civil War, Altman had no previous military service. Altman joined the Communist Party in July of 1934, as well as the Unemployed Union. The Unemployed Councils of the USA was an organization of the Communist Party, created with the intention of organizing and utilizing unemployed workers.<br /><br />At the age of 29, Altman set sail on February 20, 1937 aboard the Ile the France, which was an extremely popular transatlantic cruise liner at the time. The vessel crossed the Atlantic between New York and France, and at the start of World War II, she was utilized by the British Admiralty to transport war materials, including troops. After his arrival in France, Altman, like many others, made the dangerous crossing over the Pyrenees Mountain range to finally arrive in Spain on March 19, 1937. Altman was a part of the XV Brigade, which is the official term for the Lincoln Brigade, as a member of the machine gun company. He initially served with the Washington Battalion, which was the second American Brigade in the Spanish civil war, which merged with the Lincoln brigade during the Bruneté initiative after receiving heavy casualties.<br /><br />Altman was wounded in action in Bruneté, on July 9, 1937. He received shrapnel in his leg, an injury which rendered him useless on the field. He recuperated in Murcia in Hospital Casa Roja until his departure from Spain. He left Spain and returned to the United States on July 20, 1938, arriving aboard the Champlain. Upon his return from the war he made his living working as a pleater, as well as by working in a shipyard. Altman passed away on January 31, 1989 after battling illness. His obituary remembers him as someone who was generous and charitable to others, providing them with both shelter and companionship.</p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1KcRr5Q8qkjs8IDrv7oicS_kOz0EeuYQy",
            "src": ""
        }
    ],
    "sources": "<p>“Hospital Comandante Dubois | Hospital Casa Roja (Múrcia) | SIDBRINT.” n.d. Sidbrint.ub.edu.  <a href=\"https://sidbrint.ub.edu/ca/hospitals-militars-sanitat-de-les-brigades-internacionals/hospital-comandante-dubois-hospital-casa\">https://sidbrint.ub.edu/ca/hospitals-militars-sanitat-de-les-brigades-internacionals/hospital-comandante-dubois-hospital-casa</a>.<br />“Altman, Jack.” 2019. The Abraham Lincoln Brigade Archives. December 9, 2019. <a href=\"https://alba-valb.org/volunteers/jack-altman/\">https://alba-valb.org/volunteers/jack-altman/</a>.<br />“Abraham Lincoln Battalion | Spanish-American History | Britannica.” 2019. In Encyclopædia Britannica. <a href=\"https://www.britannica.com/topic/Abraham-Lincoln-Battalion\">https://www.britannica.com/topic/Abraham-Lincoln-Battalion</a>.<br />Spatz, Marc H. 2012. Review of The Unemployed Councils of the Communist Party in Washington State, 1930-1935. University of Washington. 2012. <a href=\"https://depts.washington.edu/depress/unemployed_councils.shtml.</p>\">https://depts.washington.edu/depress/unemployed_councils.shtml.</p></a>",
    "student_fname": "Jade",
    "student_lname": "Doan",
    "tags": [
        "Injured",
        "Washington Battalion",
        "Brunete Offensive",
        "XV Brigade",
        "Ile de France",
        "Member of Communist Party",
        "Jewish",
        "Sheepshead Bay",
        "Brooklyn"
    ],
    "volunteer_fname": "Jack",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1j0yNeqgCQRygULCx7ocRO_jKQV0xG0ZY, https://drive.google.com/open?id=1R3Jp6PV9KSn67jgRCkb4b7DioiCYpHLt",
            "src": ""
        }
    ],
    "volunteer_lname": "Altman",
    "year_published": 2024
}