{
    "class": "2024",
    "data": "<p>Abraham Moskowitz was born on July 21, 1914, in New York City. His parents were part of the wave of Jewish immigrants. Moskowitz found work as a driver and lived in Brooklyn at 1230 42nd Street. Growing up, he became aware of the various hardships that immigrants faced in the United States. He later joined the Communist Party as he leaned towards leftist and socialist politics. When hearing news of Franco&rsquo;s coup in Spain, Moskowitz had an urge to act. On February 10, 1934, he secured a passport (#366457), and, on February 20, 1937, set sail aboard the Ile de France. He arrived in Spain on March 17, 1937. Like many in the Abraham Lincoln Brigade, Moskowitz received training but was ultimately fueled by his strong anti-fascist views. He was initially with the Auto Park and transferred to the 86th BDE on March 19, 1937 until November 19, 1937, after which he was part of the XV BDE, Lincoln-Washington BN, Co.1. With the rank of Soldado, Moskowitz fought bravely in multiple battles, such as Belchite. In August of 1937, Republican forces, including Moskowitz, started an offensive for the town of Belchite in order to divert the Nationalists from other fronts. While the Republicans won, they lost a lot of resources. In July 1938, Moskowitz fought during the Ebro Offensive. It was a surprise offensive by the Republicans over the Ebro River in order to turn the tide of the war. They did not have enough air support and were overpowered by the Nationalist artillery. As such, it became an example of trench warfare. While there was initial success by units such as Moskowitz&rsquo;s, the Republicans were ultimately defeated. This proved to be devastating for the Republic, as they were forced to retreat and lost a lot of resources. Moskowitz was killed in action. He was part of many who made a sacrifice in the fight against fascism.</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;Moskowitz, Abraham.&rdquo; 2019. The Abraham Lincoln Brigade Archives. December 10, 2019. <a href=\"https://alba-valb.org/volunteers/abraham-moskowitz/\">https://alba-valb.org/volunteers/abraham-moskowitz/</a>.<br />\r\n&zwnj;<br />\r\n&ldquo;Jews in the Spanish Civil War.&rdquo; n.d. Www.jewishvirtuallibrary.org. <a href=\"https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war.&lt;/p&gt;\">https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war.</a></p>\r\n",
    "student_fname": "Vasili",
    "student_lname": "Zhestyrev",
    "tags": [
        "Ebro Offensive",
        "Belchite",
        "Passport",
        "Jewish",
        "Brooklyn",
        "XV BDE",
        "Ile de France",
        "KIA",
        "86th Brigade",
        "XV Brigade Auto Park Albacete",
        "Member of Communist Party"
    ],
    "volunteer_fname": "Abraham",
    "volunteer_images": [],
    "volunteer_lname": "Moskowitz"
}