{
    "class": "2020", 
    "data": "<p>William Sachs was born April 7th, 1914, and was raised in America, and of Jewish ancestry. He was married and lived at 2773 West 35th Street, Brooklyn, New York as a tailor under probation. Before deciding to fight the good fight. Hearing they were taking volunteers, he boarded President Roosevelt where he sailed as a part of the U.S navy. Sachs and the other volunteers entered Spain by traveling south through France and were smuggled in through the Pyrenees.<br />\r\n<br />\r\nAfter arriving in Spain in June 1937, Sachs received brief training by French officers. This lack of experience and training cost him and his comrades dearly in September of 1938. That morning they crossed the Ebro and proceeded on a three-day march with no food or water to the first town abandoned by the fascists as we approached. Sachs and his comrades found some food, cans of salty fish, but were unable to drink the water as the fascists had contaminated the wells. Tired, parched and hungry they moved on to Hill 666 a rocky height, completely barren of any vegetation due to the repeated bombardment; not enough soil to dig trenches, the parapets piled-up rock that added to the danger when struck by artillery shells. There, William Sachs, was killed in action at Sierra Caballs, Ebro Offensive.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&ldquo;Sachs, William.&rdquo; The Abraham Lincoln Brigade Archives, 11 Dec. 2019, <a href=\"http://alba-valb.org/volunteers/william-sachs/\" target=\"_blank\">alba-valb.org/volunteers/william-sachs/</a>. Accessed 7 May 2020.<br />\r\n<br />\r\n&zwnj;&ldquo;Honor Roll.&rdquo; Americans in the Spanish Civil War, 2 July 2008, <a href=\"http://brooksarp.wordpress.com/honor-roll/\" target=\"_blank\">brooksarp.wordpress.com/honor-roll/</a>.<br />\r\n<br />\r\n&zwnj;&ldquo;A Death on the Ebro - by Bill Wheeler.&rdquo; The Volunteer, 31 Mar. 2015, <a href=\"http://albavolunteer.org/2015/03/blast-from-the-past-death-on-the-ebro/\" target=\"_blank\">albavolunteer.org/2015/03/blast-from-the-past-death-on-the-ebro/</a>. Accessed 7 May 2020.<br />\r\n<br />\r\n&ldquo;The Ebro Offensive | International Brigade Memorial Trust.&rdquo;&nbsp;<a href=\"http://www.international-brigades.org.uk/\" target=\"_blank\">Www.International-Brigades.Org.Uk</a>,&nbsp;<a href=\"http://www.international-brigades.org.uk/content/ebro-offensive\" target=\"_blank\">www.international-brigades.org.uk/content/ebro-offensive</a>. Accessed 7 May 2020.</p>\r\n", 
    "school_crests": [], 
    "status": "PUBLISHED", 
    "student_fname": "Danny", 
    "student_lname": "Wu", 
    "volunteer_fname": "William", 
    "volunteer_images": [], 
    "volunteer_lname": "Sachs"
}