{
    "class": 2026,
    "data": "<p>Irving Mitchell (née Grabelsky) was born in the Bronx in 1911. His father (Aaron Grabelsky) was Jewish and living in Russia, before immigrating to the US with Mitchell’s German mother (Celia Rickel). Mitchell had 3 older siblings, 2 brothers and a sister. There is no information available about where Mitchell received his education, and whether he went to college (leading one to imagine he might not have gone to college at all). Some sources point to Mitchell having been a member of the NY Young Communist league during his youth. At the time, the NY Young Communist League was largely underground and decentralized, and as such there are not many records of who was in it.<br /><br />As a young adult, Mitchell worked in a restaurant to get by and was a member of the Communist Party of the USA. Employment levels continued to fluctuate due to the Great Depression, and Mitchell likely was on the brink of not having enough money to get by. At 26 (January 1937), he was living in Borough Park (often referred to as Boro Park, especially at the time), Brooklyn at 1512 54th Street. This was, and still is, a largely Orthodox and Hasidic Jewish neighborhood.<br /><br />Following the news of the outbreak of the Spanish Civil War in 1936, Mitchell volunteered to join the International Brigades. Having grown up in a predominantly Jewish neighborhood, Mitchell, like many other Jews, saw the International Brigades as an opportunity to fight the Nazis by fighting their proxy—the Spanish Nationalists. In late January 1937, he sailed to Spain aboard the RMS Berengaria—a German-built ship bought by the British Cunard Line company. He was in one of the last groups of people to travel directly to Spain, before the US prohibited travel to Spain.<br /><br />In February, Mitchell arrived in Spain, and served with the XV BDE of the Lincoln BN, in Company 2, Section 2, Group 2 under the direct command of Enrique Sanchez, Mitchell’s Group Leader. He was WIA at the Battle of Jarama due to a head injury, and was initially treated at a hospital in Tarancón, a town southeast of Madrid. As a result of his injury, eventually he was medically repatriated back to the US in July of 1937 aboard the MV Britannic, a British White Star Line ship.<br /><br />Over a year later in August 1938, having recovered, Mitchell returned to Spain. There he served, this time, with the XV BDE of the Lincoln-Washington BN, in Company 3. He continued to have the rank of soldado, Spanish for soldier. Four months later, in December 1938, Mitchell returned to the US for good aboard the RMS Ausonia, another Cunard Line ship.<br /><br />Mitchell later served in the US army in WWII as a Private First Class, working as a member of various chemical warfare corps. for much of his time serving in WWII. Mitchell seems to have led a mostly uneventful life following WWII, and eventually died at the age of 79 in 1991, in Los Angeles, California.</p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1gPPyavQS8HP2dMh8iKgYaLfb7QYy3jGP, https://drive.google.com/open?id=19fBw9XkMZG5CSUgR2GW6hN8nS4-D0oN1",
            "src": ""
        }
    ],
    "sources": "<p>The Abraham Lincoln Brigade Archives, Writers of. “Mitchell, Irving.” The Abraham Lincoln Brigade Archives, October 15, 2022. <a href=\"https://alba-valb.org/volunteers/irving-mitchell/.\">https://alba-valb.org/volunteers/irving-mitchell/.</a>  <br /><br />Contributors, Wikipedia. “SS Imperator.” Wikipedia, May 24, 2024. <a href=\"https://en.wikipedia.org/wiki/SS_Imperator#Cunard_service_as_Berengaria\">https://en.wikipedia.org/wiki/SS_Imperator#Cunard_service_as_Berengaria</a>. <br /><br />International Brigades Archives Authors, University of Barcelona. “Mitchell, Irving.” SIDBRINT. Accessed June 7, 2024. <a href=\"https://sidbrint.ub.edu/ca/content/mitchell-irving\">https://sidbrint.ub.edu/ca/content/mitchell-irving</a>. <br /><br />Carrol, Peter N., Michael Nash, and Melvin Small. “The Good Fight Continues: World War II Letters from the Abraham Lincoln Brigade.” dokumen.pub. Accessed June 7, 2024. <a href=\"https://dokumen.pub/the-good-fight-continues-world-war-ii-letters-from-the-abraham-lincoln-brigade-9780814772973.html\">https://dokumen.pub/the-good-fight-continues-world-war-ii-letters-from-the-abraham-lincoln-brigade-9780814772973.html</a>. <br /><br />Mitchell, Irving. Letter to Various friends and relatives. NYU Tamiment Library Abraham Lincoln Brigade Archives. WWII Front: WWII Front, 1942-1944. </p>",
    "student_fname": "Samuel N.",
    "student_lname": "Sunko",
    "tags": [
        "Veterans of the Abraham Lincoln Brigade",
        "Hospitals",
        "WWII",
        "Company 2 Section 2",
        "Company 2 Section 2 Group 3",
        "Communists",
        "Borough Park Brooklyn",
        "Tarancón Hospital",
        "Injured",
        "WIA",
        "Russian",
        "Member of Communist Party",
        "Jewish",
        "Jarama",
        "Battle of Jarama",
        "Company 2 Section 2 Group 2",
        "Company 2",
        "Chemical Warfare",
        "WWII Veteran",
        "Young Communist League"
    ],
    "volunteer_fname": "Irving",
    "volunteer_images": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "volunteer_lname": "Mitchell (née Grabelsky)",
    "year_published": 2024
}