{
    "class": "2021",
    "data": "<p>Robert Haslan was born in New York City on May 25, 1915. He had a relatively small family and grew up in an apartment in Upper Manhattan at 25 Fort Washington Avenue with his father, Paul Haslan, brother, William Haslan, and mother (name unknown). Prior to deciding to volunteer for the war, Haslan had recently finished high school and was beginning to study art at a night school that was offering lessons in a nearby neighborhood. For income, he had been working on-and-off since he was 14&mdash;mostly odd jobs like clerical work and serving at cafes&mdash;and had also pursued a side career as an artist. Additionally, Haslan spent a year and a half with the Works Progress Administration (WPA). The WPA was one of the New Deal agencies created during the Second New Deal that provided paid jobs in sectors like infrastructure to the unemployed during the Great Depression. Through the WPA, Haslan became a part of the City Projects Council and had also joined the Workers Alliance of America (WAA).&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>The WAA had opened Haslan up to a lot more Communist ideas as he felt himself sympathizing with fellow members and frequently participating in the labor movement that was going on at the time in New York City. He then joined the Communist party in November of 1936&mdash;a decision which likely influenced his perspective towards the political atmosphere overseas and spurred him to volunteer for the war when time came.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>He received his passport on June 29, 1937, and shortly left for Spain aboard the President Roosevelt ship on July 7, 1937. However, partially because of the U.S. government&rsquo;s adamant neutrality regarding the war, the President Roosevelt couldn&rsquo;t take the volunteers straight to Spain. After an 8 day journey across the Atlantic, Haslan arrived in Havre, France on July 15th, where he then boarded the Espolla&mdash;the ship that would bring him and 50 other men across the border&mdash;and arrived in Spain on July 24th. During this time, he often assumed the alias&rsquo; &ldquo;Bob Haslan&rdquo; and &ldquo;Robert Haslam&rdquo; in records like lists and letters for confidentiality purposes.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Once he got situated, Haslan spent about six weeks training with a very diverse unit in the Mackenzie-Papineau Battalion alongside international volunteers from countries like Belgium, Canada, France, Poland, Italy, Hungary, and Czechoslovakia. He was then transferred out from the training base in Tarazona to the Abraham Lincoln Brigade in November 1937 before being put into action on the Aragon and Tereul fronts with the Lincoln-Washington Battalion.&nbsp;</p>\r\n\r\n<p>Whilst fighting at the Teruel front, Haslan had bruised his knee and&mdash;he claimed this was mainly due to the dampness of the environment&mdash;it had become swollen and inflamed. Too painful to continue, he was sent to the hospital to have it cut open. Haslan was quick to mention in a letter written on March 2, 1938 from Albacete to a friend back home that it had healed relatively quickly and he was hoping &ldquo;to be rejoining the battalion soon.&rdquo;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>For better or worse, Haslan soon got what he hoped for as he was put back on the frontlines during the Aragon Offensive&mdash;a military campaign focused on defeating the Republican troops in that area (which were weakened from the Battle of Teruel). Nationalists who advanced from the north with the Army of Africa, flanked by the Condor Legion as well 47 artillery batteries, easily held the upper hand against the already-depleted Republican troops. The battalion was then forced to abandon their positions during what is known as the Retreats, where Haslan unfortunately, was killed in action on April 4, 1938.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Even though he died early in the war, there is no doubt that Haslan deeply valued his time in Spain, writing in a letter that he went &ldquo;through good experiences here, experiences which are difficult to relate or describe, but they do take their place in the development of one&#39;s character and understanding.&rdquo; When asked in a questionnaire what the most outstanding thing he had experienced since leaving the U.S. was, Haslan marvelled at the experience of &ldquo;being able to take part in the high political awareness of the people of Spain,&rdquo; because &ldquo; they unite for progress and against racism and fascism. &ldquo;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Through what little he left behind, Haslan has made his values evident. He held an &ldquo;undying hatred for fascism&rdquo; and had gone to Spain as a Communist willing to lay his life down to stop its spread. Perhaps more unexpectedly, Haslan had also developed an affinity for the country and the camaraderie it united in the process. Had he survived, Haslan intended to remain in Spain indefinitely and continue his art studies.</p>\r\n\r\n<p>&nbsp;</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;Haslan, Robert.&rdquo; The Abraham Lincoln Brigade Archives, August 5, 2020. <a href=\"https://alba-valb.org/volunteers/robert-haslan/\" target=\"_blank\">https://alba-valb.org/volunteers/robert-haslan/</a>.&nbsp;</p>\r\n\r\n<p>&quot;Historical Commission of the International Brigades - Mackenzie-Papineau Battalion August 1937 Questionnaires.&quot; Web. &lt;<a href=\"http://sovdoc.rusarchives.ru/sections/organizations//cards/212099/images\" target=\"_blank\">http://sovdoc.rusarchives.ru/sections/organizations//cards/212099/images</a>&gt;.</p>\r\n\r\n<p>&quot;RGASPI Fond 545, Opis 6, Delo 851, Ll. 7 - MIA.&quot; Web. &lt;<a href=\"http://sovdoc.rusarchives.ru/sections/organizations//cards/212099/images\" target=\"_blank\">http://sovdoc.rusarchives.ru/sections/organizations//cards/212099/images</a>&gt;.</p>\r\n\r\n<p>&quot;Guide to the Veterans of the Abraham Lincoln Brigade Records ALBA.019.&quot; <em>Guide to the Veterans of the Abraham Lincoln Brigade Records ALBA.019</em>. Web. 30 Apr. 2021. PDF file.</p>\r\n\r\n<p>History.com Editors. &ldquo;Works Progress Administration (WPA).&rdquo; <em>History.com</em>, A&amp;E Television Networks, 13 July 2017, <a href=\"http://www.history.com/topics/great-depression/works-progress-administration\" target=\"_blank\">www.history.com/topics/great-depression/works-progress-administration</a>.&nbsp;</p>\r\n\r\n<p>&ldquo;Into Aragon.&rdquo; <em>Into Aragon | International Brigade Memorial Trust</em>, <a href=\"http://www.international-brigades.org.uk/content/aragon\" target=\"_blank\">www.international-brigades.org.uk/content/aragon</a>.&nbsp;</p>\r\n",
    "student_fname": "Christine",
    "student_lname": "Lin",
    "tags": [
        "Workers Alliance of America",
        "Mackenzie–Papineau Battalion",
        "Artist",
        "Battle For Teruel",
        "Member Of Communist Party",
        "KIA",
        "Aragon Offensive",
        "Lincoln-Washington Battalion"
    ],
    "volunteer_fname": "Robert",
    "volunteer_images": [],
    "volunteer_lname": "Haslan"
}