{
    "class": "2023",
    "data": "<p>Lawrence McCullough was born in Elmsford, New York, which is a village considered part of the town of Greenburgh in Westchester County. Born on February 12, 1907, McCullough was brought into a village that had yet to be incorporated. At the time of its incorporation, June 9, 1910, Elmsford was considered a Village of the IV Class, categorized as a village with a population of less than a thousand residents.<br />\r\nThe name McCullough has uncertain origins, some sources say that it is Irish, some say Scottish. The name itself has many possible etymological origins. One of the more commonly known/believed ones is from the Old Scots Gaelic &quot;MacCulloch&quot; or &quot;MacC(h)ullach&quot;, meaning son of Cullach, or boar. Another is the possible Irish translation of the name to the &ldquo;son of the hound of Ulster&rdquo;. With both the Irish and Scottish McCullough populations in such proximity to each other, I think it&rsquo;s fair to say that Lawrence McCullough has his roots in that general area as well.</p>\r\n\r\n<p><br />\r\nHis predecessors then have multiple possible times and reasons for moving to America, more specifically New York and the surrounding areas. The first Scottish immigrants were aboard the Mayflower and came with the first English settlers to the New World. If he is of Irish descent, his family likely arrived with the wave of Irish immigrants during The Great Famine. More than half a decade before his birth, there was already a massive population of Irish Americans in New York. Nearly 25% of the city&rsquo;s residents were Irish, and the total number of Irish in New York was higher than in Dublin, the capital of Ireland. Those who were entering the city were most often Catholic and faced discrimination from the Protestant immigrants from Britain.</p>\r\n\r\n<p><br />\r\nOn June 14, 1937, at 30 years old, Lawrence McCullough received his passport. His address at the time was listed as 507 West Jane St in the West Village. This was a boarding house, the American Seamen&#39;s Friend Society Sailors&#39; Home and Institute, which is now called the Jane Hotel.</p>\r\n\r\n<p><br />\r\nLess than four weeks later, McCullough sailed aboard the SS President Roosevelt, an ocean liner in service during the 1920s and 1930s. The SS President Roosevelt was originally built at the end of WWI as a Harris-class attack transport, its purpose was to deliver troops and equipment to hostile shores. After arriving in Spain on July 22, 1937, he served in Quinto and Belchite. After that, he was shot in the shoulder while fighting toward the end of the battle of Belchite, which was part of the Republican offensive to capture the capital of Aragon, Zaragoza, led by Francisco Franco. This battle lasted from August 24 to September 7, 1937, and destroyed the town. The battle of Belchite involved around 180,000 soldiers and ended with more than 11,000 casualties.</p>\r\n\r\n<p><br />\r\nHe then went AWOL, like many of his comrades throughout the war, and was jailed after punching an officer while AWOL. He served 84 days of jail time from April 25, 1938, to July 18, 1938. This was after his best friend, Vernon Romayne Shelby was killed in action around April 6, 1938. While we don&#39;t know if those two events are correlated, it is a possible reason why McCullough went AWOL. He then rejoined as a member of the Lincoln-Washington Brigade in September of 1938. On September 21, 1938, Juan Negr&iacute;n, the Spanish prime minister announced that the Brigade would withdraw from battle in hopes that the Nationalists would be pressured into withdrawing as well. It is unclear as to if McCullough returned to the brigade after or before the announcement. After that, he was likely sent to Ripoll with the rest of the surviving Americans, and his nationality was verified by the International Red Cross and the US government, before finally returning to the US aboard the Ausonia on December 20, 1938.<br />\r\nHe passed away in Hialeah, Florida on January 17, 1988, at 80 years old.</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;About Elmsford.&rdquo; Elmsford NY, <a href=\"https://www.elmsfordny.org/about-elmsford\">https://www.elmsfordny.org/about-elmsford</a>.<br />\r\n&ldquo;American Seamen&#39;s Friend Society Sailors&#39; Home and Institute.&rdquo; HDC, 7 Feb. 2019, <a href=\"https://hdc.org/buildings/american-seamens-friend-society-sailors-home-and-institute/\">https://hdc.org/buildings/american-seamens-friend-society-sailors-home-and-institute/</a>.<br />\r\n<br />\r\nFrance 24. &ldquo;Belchite, the Open Wound of Spain&#39;s Civil War.&rdquo; France 24, France 24, 14 July 2022, <a href=\"https://www.france24.com/en/live-news/20220714-belchite-the-open-wound-of-spain-s-civil-war\">https://www.france24.com/en/live-news/20220714-belchite-the-open-wound-of-spain-s-civil-war</a>.<br />\r\n<br />\r\nInk, Social. &ldquo;McCullough, Lawrence.&rdquo; The Abraham Lincoln Brigade Archives, 9 Oct. 2022, <a href=\"https://alba-valb.org/volunteers/lawrence-mccullough/\">https://alba-valb.org/volunteers/lawrence-mccullough/</a>.<br />\r\n<br />\r\nInk, Social. &ldquo;Selby, Vernon Romayne.&rdquo; The Abraham Lincoln Brigade Archives, 5 Dec. 2022, <a href=\"https://alba-valb.org/volunteers/vernon-romayne-selby/\">https://alba-valb.org/volunteers/vernon-romayne-selby/</a>.<br />\r\n<br />\r\n&ldquo;McCulloh Name.&rdquo; McCulloh Reunion, <a href=\"https://mccullohreunion.org/?page_id=248\">https://mccullohreunion.org/?page_id=248</a>.<br />\r\n<br />\r\nPichlmayr, Alex. &ldquo;The Historic Town of Belchite, and the Battle That Destroyed It.&rdquo; Alexander Pichlmayr, October 6, 2019. <a href=\"https://alexanderpichlmayr.com/battle-of-belchite-aragon-spain/\">https://alexanderpichlmayr.com/battle-of-belchite-aragon-spain/</a>.<br />\r\n<br />\r\n&ldquo;SS President Roosevelt (1921).&rdquo; DBpedia, <a href=\"https://dbpedia.org/page/SS_President_Roosevelt_(1921)\">https://dbpedia.org/page/SS_President_Roosevelt_(1921)</a>.<br />\r\n<br />\r\n&ldquo;We&#39;re Giving You Access to Your History.&rdquo; Join Ancestry, <a href=\"https://www.ancestry.com/discoveryui-content/view/10769551:2703?tid=&amp;pid=&amp;queryId=1a300beee68ed624af611bb78a5f95f1&amp;_phsrc=6a1-1074608&amp;_phstart=successSource\">https://www.ancestry.com/discoveryui-content/view/10769551:2703?tid=&amp;pid=&amp;queryId=1a300beee68ed624af611bb78a5f95f1&amp;_phsrc=6a1-1074608&amp;_phstart=successSource</a>.</p>\r\n",
    "student_fname": "Becky",
    "student_lname": "Chang",
    "tags": [
        "Belchite",
        "West Village",
        "Irish",
        "Elmsford",
        "SS President Roosevelt",
        "Lincoln-Washington Brigade",
        "Scottish",
        "Astonia",
        "American Seamen's Friend Society Sailors' Home and Institute",
        "Quinto",
        "Battle of Belchite"
    ],
    "volunteer_fname": "Lawrence",
    "volunteer_images": [],
    "volunteer_lname": "McCullough"
}