{
    "class": "2024",
    "data": "<p>George Peters was born in Rhodes, Greece on March 4, 1904. He came to the US at age ten in 1914, a time when immigration policies in the Progressive Era allowed waves of eastern and southern Europeans to settle in America. The Greeks&rsquo; lingering distrust in their government following the economic depression of the late 19th century coupled with the Balkan Wars of 1912-1913 as well as the onset of World War I made immigration to America appealing. Additionally, New York City housed a vibrant hub of well established Greek communities, namely in Astoria, though Peters lived in Chelsea as an adult. He spent his adolescence in New York City and grew up to be a self-employed laborer, possibly in the metalworking industry. He was not part of any unions, but he joined the American Communist Party (CPUSA) in 1935 when Joseph Stalin&rsquo;s new &ldquo;Popular Front&rdquo; agenda sided with FDR and the New Deal, resulting in the CPUSA&rsquo;s most successful years. Rallied by the Communist Party, Peters decided to join the International Brigades in their fight against facism in Spain&mdash;he received his passport on March 2, 1937 and sailed just eight days later aboard the Queen Mary.<br />\r\n<br />\r\nPeters arrived in Spain on March 25, 1937 to serve in the Machine Gun Company (MG Co.) of the Washington Battalion (BN). After limited training, he was transferred to the infantry and sent to fight in the Battle of Jarama, where 66% of American soldiers were either wounded or died. In the days following Jarama, he wrote a letter to the Chief Commander of the International Brigades requesting a transfer back into his old unit, the MG Co., where he had found friendship with Americans and a fellow Greek; his request was most likely granted. In August, he fought in Brunete, where the Republican offensive suffered after a Nationalist counterattack, costing the International Brigades enough soldiers to the point where the battle could be considered a strategic Nationalist victory. Peters was promoted to the rank of Sargento before his next battle in Aragon, where Nationalist forces took Aragon and parts of Catalonia and Levante. The overwhelming death and loss that Peters and his fellow soldiers faced since arriving in Spain was emotionally devastating, and Peters was repatriated in September 1937.<br />\r\n<br />\r\nPeters returned to Spain by the following year to work in the Albacete Auto Park as well as in artillery in Almasa. He returned to the Washington Battalion in May as a section chief, and fought in the Ebro Offensive, during which he was wounded in action near Corbera in September following a hit by an artillery shell. However, the Central Committee of the Communist Party of Spain reported Peters as &ldquo;cowardly&rdquo; for deserting on &ldquo;phony pretexts,&rdquo; ruling him a &ldquo;declassed element&rdquo; on November 1, though this may be an outlier as records from the battalion and Albacete described him as competent and having a &ldquo;high degree of courage&rdquo;. Nonetheless, Peters returned to the United States on December 20, 1938 aboard the Ausonia, and later fought in World War II, drawing from his experiences in Spain to fight the Good Fight once more.</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;Communist Party USA (CPUSA).&rdquo; InfluenceWatch, June 29, 2022. <a href=\"https://www.influencewatch.org/political-party/communist-party-usa/\">https://www.influencewatch.org/political-party/communist-party-usa/</a>.<br />\r\n<br />\r\nInk, Social. &ldquo;Peters, George.&rdquo; The Abraham Lincoln Brigade Archives, October 27, 2022. <a href=\"https://alba-valb.org/volunteers/george-peters/\">https://alba-valb.org/volunteers/george-peters/</a>.<br />\r\n<br />\r\nNational Archives at St. Louis; St. Louis, Missouri; Wwii Draft Registration Cards For New York City, 10/16/1940 - 03/31/1947; Record Group: Records of the Selective Service System, 147<br />\r\n<br />\r\nPappas, Mitcho S. &ldquo;Greek Immigrant in the United States since 1910.&rdquo; Dissertation, University of Montana, 1950.<br />\r\n<br />\r\n&ldquo;Peters, George.&rdquo; SIDBRINT - Digital Information System on the International Brigades, University of Barcelona, <a href=\"https://sidbrint.ub.edu/ca/content/peters-george\">https://sidbrint.ub.edu/ca/content/peters-george</a>.<br />\r\n<br />\r\nДокументы Советской Эпохи: Просмотр Единицы Хранения, <a href=\"https://sovdoc.rusarchives.ru/sections/organizations//cards/232579/images. &lt;/p&gt;\">https://sovdoc.rusarchives.ru/sections/organizations//cards/232579/images. </a></p>\r\n",
    "student_fname": "Lesley",
    "student_lname": "Lo",
    "tags": [
        "Brunete Offensive",
        "Pina",
        "Albacete",
        "Belchite",
        "Member of Communist Party",
        "Washington Battalion",
        "Greek",
        "Veterans of the Abraham Lincoln Brigade",
        "WWII Veteran",
        "Ebro Offensive",
        "Villanueva del Pardillo",
        "Jarama",
        "Quinto",
        "Immigrant",
        "Machine Gun Company",
        "Sargento",
        "Artillery",
        "Section Chief"
    ],
    "volunteer_fname": "George",
    "volunteer_images": [],
    "volunteer_lname": "Peters"
}