{
    "class": 2025,
    "data": "<p>James Ioannou Demas was born in Cyprus in 1908 when Cyprus was having political and economic difficulties due to the effects of the fall of the Ottoman Empire and British imperialism. When Egypt was declared independent, Demas emigrated to Egypt in 1923 with his brother to study with an uncle. However, they instead worked in hazardous conditions in a factory. They later chose to go to France in search of economic prosperity and briefly lived there. They eventually came and settled in New York City in 1929. The economic situation in NYC was in shambles, and both brothers were struggling to find work. Demas eventually found work as a cook and pastry chef. He lived at 1926 3rd Avenue and frequently visited the Greek tavern scene on Eighth Avenue, which had a large Cypriot influence. He joined the Pancyprian Brotherhood, the main Cypriot cultural organization in the USA at the time, which was largely communist due to the political and economic hardships in Cyprus that were created by British imperialism. Demas became a leader of the Pancyprian Brotherhood and joined the communist party as well. This led him to join the Republic side and the Spanish communist party in the Spanish Civil War, along with many in the Pancyprian Brotherhood. <br /><br />On January 16, 1937, Demas sailed to Spain aboard the SS Paris and arrived on January 25, 1937. The journey was arranged by the communist party. He served valiantly in the Jarama, Brunete, and Zaragoza campaigns. Demas was in one of the two trucks that accidentally went on fascist lines at Jarama on February 16, 1937, but he managed to survive. He was initially in the Abraham Lincoln Brigade, then transferred to the BN Estado Mayor to assist as a cook, and finally, he was transferred to the Garibaldi Brigade as a private. Demas also joined the 129th international Brigade, specifically in the Djure Djakovica Battalion, which ended up combining with the Abraham Lincoln Brigade soon after he joined. He served at the Front of Aragon, where he was wounded and sent to the Recuperation Quarters of the International Brigades located at Vall de Bianya, on July 12th 1938. Demas was not severely injured and continued to fight until the International Brigade was sent home. He returned to the US aboard the RMS Ausonia which went from Le Havre, France, by way of England and Halifax, Nova Scotia, arriving in New York City on 20 December 1938. A few years later, in 1944, he trained in Fort Dix, New Jersey, before transferring to England to serve in WW2 in October of that year. He remained in touch with the rest of the soldiers from the Abraham Lincoln Brigade through monthly newsletters and postcards to the veterans from his station abroad. One of his postcards stated his desire to leave his station in England, which he saw as a waste of his abilities since it was in the middle of nowhere, and go back to Spain to get “another crack at Franco,” showing his determination and dedication in the fight against fascism.</p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1uh_rXImhEQFLiWJG1hjSL2aZV7mx10Sq, https://drive.google.com/open?id=1wZ6334fJE0S6xjO8x3dIwfnG-9R1xgZF",
            "src": ""
        }
    ],
    "sources": "<p>Brooks, Chris. 2016. “Jarama Series: Organization of the Abraham Lincoln Battalion.” The Volunteer. February 12, 2016. <a href=\"https://albavolunteer.org/2016/02/jarama-series-organization-of-the-abraham-lincoln-battalion/\">https://albavolunteer.org/2016/02/jarama-series-organization-of-the-abraham-lincoln-battalion/</a>.<br /><br />“Contribution of Cyprus to the Cause of Spanish Democracy by Michael Economides - the Volunteer.” Albavolunteer.org. October 12, 2019. <br /><br /><a href=\"https://albavolunteer.org/2019/10/contribution-of-cyprus-to-the-cause-of-spanish-democracy-by-michael-economides/\">https://albavolunteer.org/2019/10/contribution-of-cyprus-to-the-cause-of-spanish-democracy-by-michael-economides/</a>.<br /><br />“DEMAS, James J. | SIDBRINT.” n.d. Sidbrint.ub.edu. Accessed June 7, 2024. <a href=\"https://sidbrint.ub.edu/ca/content/demas-james-j\">https://sidbrint.ub.edu/ca/content/demas-james-j</a>.<br /><br />“Demas, Joannou James.” 2019. The Abraham Lincoln Brigade Archives. December 10, 2019. <a href=\"https://www.google.com/url?q=https://alba-valb.org/volunteers/james-joannoy-demas/&sa=D&source=docs&ust=1717802974265456&usg=AOvVaw2Pg_Qfh3XTB-JpnOMGGMlP\">https://www.google.com/url?q=https://alba-valb.org/volunteers/james-joannoy-demas/&sa=D&source=docs&ust=1717802974265456&usg=AOvVaw2Pg_Qfh3XTB-JpnOMGGMlP</a>.<br /><br />Kontodimas, Vasilis. 2020. “Volunteer Nicholas Ioannou Demas Student Vasilis Kontodimas – Narrating Memory.” Narrating Memory. December 10, 2020. <a href=\"https://narratingmemory.com/index.php/2020/12/10/volunteer-nicholas-ioannou-demas-student-vasilis-kontodimas/\">https://narratingmemory.com/index.php/2020/12/10/volunteer-nicholas-ioannou-demas-student-vasilis-kontodimas/</a>.<br /><br />Philippou, Paul. 2015. “The Cypriot Contribution to the International Brigades in the Spanish Civil War | Parikiaki Cyprus and Cypriot News.” Parikiaki. March 14, 2015. <a href=\"https://www.parikiaki.com/2015/03/the-cypriot-contribution-to-the-international-brigades-in-the/\">https://www.parikiaki.com/2015/03/the-cypriot-contribution-to-the-international-brigades-in-the/</a>.<br /><br />Philippou, Paul 2015. “Cypriots in the International Brigades.” International Brigade Memorial Trust. March 31, 2015. <a href=\"https://international-brigades.org.uk/news-and-blog/content-cypriots-international-brigades/\">https://international-brigades.org.uk/news-and-blog/content-cypriots-international-brigades/</a>.<br /><br />Wikipedia Contributors. 2023. “XII International Brigade.” Wikipedia. May 9, 2023. <a href=\"https://en.wikipedia.org/wiki/XII_International_Brigade#:~:text=The%20XII%20International%20Brigade%20was.</p>\">https://en.wikipedia.org/wiki/XII_International_Brigade#:~:text=The%20XII%20International%20Brigade%20was.</p></a>",
    "student_fname": "Aleeza",
    "student_lname": "Shekhani",
    "tags": [
        "Communist",
        "Front of Aragon",
        "15th Brigade",
        "RMS Ausonia",
        "WWII",
        "Djure Djakovica Battalion",
        "129th International Brigade",
        "Zaragoza Campaign",
        "Spartacus Club",
        "Communist Party USA",
        "Pancyprian Brotherhood",
        "SS Paris",
        "Garibaldi Brigade",
        "Cypriot",
        "Battle of Brunete",
        "Battle of Jarama",
        "Estado Mayor",
        "Cook"
    ],
    "volunteer_fname": "James Ioannou",
    "volunteer_images": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "volunteer_lname": "Demas",
    "year_published": 2024
}