{
    "class": "2023",
    "data": "<p>Anthony Mackay was a student born in 1909 in Kyrenia, Cyprus. His parents immigrated from Greece. In the early 1900s, over 30% of the Greek population emigrated. They mostly went to the United States and Egypt. This emigration happened because it was encouraged by Greek authorities. They thought this would help improve the balance of the Greek economy by decreasing the amounts of payments by people. This new era was called the &ldquo;New World&rdquo;.</p>\r\n\r\n<p><br />\r\nHe was a single student during 1933. He received a Spanish Passport which was #367495 on February 16, 1937. He lived at 626 West 136th Street, NYC which is now 202 East 44th Street, NYC. Living near the City College of New York, he was bothered by the noisy activists. He was friends with Wilfred Mendelson, who he called &ldquo;Mendy&rdquo;. Mendy was killed in 1938 during combat as he fought for the leftist Republican government against the fascist Nationalists led by General Francisco Franco. He was also in the Abraham Lincoln Brigade with almost 3,000 volunteers from the U.S. including Mackay.</p>\r\n\r\n<p><br />\r\nHe later moved to 714 Nevada, Urbana, Illinois. Illinois had a great reputation for its American transportation network. Also, general prosperity made it a magnet for immigrants. He then arrived in Spain on March 17, 1937. He served with the XV BDE, Estado Mayor. This brigade reached its peak in spring of 1937. With the highest combat strength, XV BDE did well in serving the Repbulican&rsquo;s first major offense. This was due to a great headquarters element, six infantry battalions, an anti-tank battery, and cavalry squadrons.</p>\r\n\r\n<p><br />\r\nUnfortunately, after getting into a fight with his fellow comrades, he got punished. So, he had to serve in Tarazona Service Sanitary as a medical orderly and laboratory worker. He also served at Brunete as Rank Cabo. A rank cabo is a corporal that has the rank between first class private and first corporal. He returned on March 3, 1939 aboard the Manhattan. The Manhattan was a ship from 1902 to 1967. This ship traveled between Grand Central Terminal in New York City and LaSalle Street Station in Chicago, Illinois, along the railroad&#39;s &quot;Water Level Route&quot;. He returned on Passport #74 issued in Barcelona on December 22, 1938.<br />\r\n&nbsp;</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;20th Century Limited.&rdquo; Wikipedia, 24 Mar. 2023, en.wikipedia.org/wiki/20th_Century_Limited.<br />\r\n<br />\r\nBrooks, Chris. &ldquo;Jarama Series the Regiments.&rdquo; The Volunteer, 13 July 2016, albavolunteer.org/2016/07/jarama-series-16-the-regiments/.<br />\r\n<br />\r\nCharalambos Kasimis, Chryssa Kassimi. &ldquo;Greece: A History of Migration.&rdquo; Migrationpolicy.Org, 2 Mar. 2017, www.migrationpolicy.org/article/greece-history-migration#:~:text=In%20the%20period%201890%2D1914,payments%20of%20the%20Greek%20economy.<br />\r\n<br />\r\n&ldquo;Corporal.&rdquo; Wikipedia, 16 Apr. 2023, en.wikipedia.org/wiki/Corporal.<br />\r\n<br />\r\nSirett, Edith. &ldquo;Digital Book Tells Story of CCNY Activist Killed in Spanish Civil War.&rdquo; HarlemView, 15 Dec. 2022, harlemview.com/city-college/2022/12/digital-book-tells-story-of-ccny-activist-killed-in-spanish-civil-war/.<br />\r\n<br />\r\nVandeCreek, Drew E. &ldquo;Settlement and Immigration in Civil War Illinois.&rdquo; Northern Illinois University Digital Library, digital.lib.niu.edu/illinois/civilwar/settlement#:~:text=Illinois&rsquo;%20central%20position%20in%20the,a%20train%2C%20deposited%20them%20there. Accessed 8 May 2023.</p>\r\n",
    "student_fname": "Nadia",
    "student_lname": "Mow",
    "tags": [
        "Rank Cabo",
        "Estado Mayor",
        "Greek",
        "Immigrant",
        "Medic",
        "Tarazona Service Sanitary",
        "Republican Medical Service",
        "Tarazona"
    ],
    "volunteer_fname": "Anthony",
    "volunteer_images": [],
    "volunteer_lname": "Mackay"
}