{
    "class": "2023",
    "data": "<p>Sidney Rosenblatt was a US army soldier who was born on October 30, 1915 and raised in Jackson Heights, New York City. His parents were Jewish therefore he grew up in a Jewish household. He was a student at Seward High School and graduated in 1932. He then attended City College of New York for two years and graduated as a teacher. Sidney remained single and had odd job opportunities. He then sailed aboard the Statendam on June 4, 1937 to Spain to fight in the Spanish Civil War as part of the Communist Party.<br />\r\n&nbsp;</p>\r\n\r\n<p>Sidney arrived in Spain Via setcases on June 21 1937, ready for battle. He was one of the very few Jewish soldiers who sought in the Spanish Civil War who were from New York City which makes him an important figure in New York history since he represented not only the U.S but also New York in the War. He served with the XV BDE and trained with Mackenzie - Papineau. While fighting in the Battle of Belchite (1937), he was captured on March 10, 1938 while attending an injured BN commander called David Reiss. He was then put in San Pedro de Cardena&rsquo;s concentration camp where he remained prisoner until April 22, 1939. Sidney was then exchanged on April 22, 1939 and then returned to the U.S on May 6, 1939, boarding the President Hoarding after spending a year and ten months in Spain.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Sidney believed in Communism and therefore was part of the Young Communist League (YCLUSA). When he arrived in the U.S, he was immediately recruited to fight in World War II and took off once again ready for battle as part of the U.S Army. Sidney&rsquo;s role in the War was a motorcycle courier where he carried around messages on the motorcycle. One day while in battle, Sidney, unaware, unfortunately hits a land mine and is injured. Sidney is taken to the hospital with severe wounds. However, Sidney died in the hospital on October 19, 1944. Sidney Rosenblatt will always be remembered and honored for his bravery as nd effort fighting in the Spanish Civil War and WWII, representing the U.S, especially representing New York City.&nbsp;</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;Rosenblatt, Sidney | the Abraham Lincoln Brigade Archives.&rdquo; The Abraham Lincoln Brigade Archives, 25 Nov. 2022, <a href=\"https://alba-valb.org/volunteers/sidney-rosenblatt/\" target=\"_blank\">alba-valb.org/volunteers/sidney-rosenblatt.</a></p>\r\n\r\n<p><br />\r\nROSENBLATT, Sidney | SIDBRINT. sidbrint.ub.edu/ca/content/rosenblatt-sidney</p>\r\n",
    "student_fname": "Cynthia",
    "student_lname": "Tenezaca",
    "tags": [
        "Battle of Belchite",
        "City College of New York",
        "Communist Party",
        "Jewish",
        "Member Of Communist Party",
        "Teacher",
        "Young Communist League",
        "KIA WWII"
    ],
    "volunteer_fname": "Sidney",
    "volunteer_images": [],
    "volunteer_lname": "Rosenblatt"
}