{
    "class": "2025",
    "data": "<p>Emery Reddon was born in the United States between the months of June and February in 1903-1904. Although there is not much information about Emery Reddon in his formative or schooling years, we know that he was a single man living and working in NYC as a seaman at 330 7th Avenue. Emery Reddon&rsquo;s apartment building still stands today as a part of the Chelsea Neighborhood, as it was built in the 1920s. As a seaman Emery Reddon often traveled a lot for his job, and his 5&rsquo;8.5 and 185 pound (ca. 84 kilogram) self often found himself being shipped to all the US major ports: Boston, Wilmington (North Carolina), and of course NYC. During this time, Emery would find himself delving in liberal politics and soon found himself officially partaking in the Communist Party by at least 1936 and was an official member of the Communist Party of the United States of America (CPUSA). It was around this time in June of where he decided to join up to fight in the 15th International Brigades. On June 5, 1937, Emery Reddon would take his last sea trip when he rode a 16-day-long voyage aboard the Lancastria to London and then eventually to Setcases, a small town in Northern Catalonia. Setcases was a small town that was protected by the anarchists and Communists. Emery Reddon was likely only 33 at the time when he left his place of birth and residence to fight alongside his comrades in the defense of the Republic and Spanish rights.<br />\r\n<br />\r\nEmery Reddon served as a soldado or soldier in the Washington Battalion. It was during this point where he found a group of other largely America soldiers to relate to and fight with. He even had two alleged nicknames at the time, Emery Reddin and James H. Reddin. The latter could have been an alias of the author Antonio R. Celada who authored the book Los Internacionales, a book of English-speaking volunteers during the Spanish Civil War. Emery was also mentioned by name by Bill Bailey and Bill McCarthy, a famous American communist labor activist and actor. He was especially close with Bill McCarthy, as they had memorably shared a foxhole during the Belchite offensive. This foxhole would later be the resting places for the ashes of Bill McCarthy. Being merged to the Lincoln Battalion on July 14, 1937, he would fight in his last recorded battle against the nationalists in the Battle of Gandesa and the subsequent retreats as a part of the loss. He would fight fiercely against the Italian Corpo Truppe Volontarie Aviazione Legionaria and the NAZI Condor Legion for the 3 days that the offensive spanned. Soon however the Retreats of Republican forces would follow as they were quickly losing ground and this is where Emery Reddon would lose his life on March 4th, 1938 as part of the 140 people who were imprisoned or killed because of the Battle of Gandesa.</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;330 Seventh Avenue | GFP Real Estate.&rdquo; n.d. Www.gfpre.com. Accessed June 8, 2024. <a href=\"https://www.gfpre.com/properties/330-seventh-avenue\">https://www.gfpre.com/properties/330-seventh-avenue</a>.<br />\r\n&ldquo;Setcases.&rdquo; 2021. Wikipedia. May 16, 2021. <a href=\"https://en.wikipedia.org/wiki/Setcases\">https://en.wikipedia.org/wiki/Setcases</a>.<br />\r\n&ldquo;REDDON, Emery | SIDBRINT.&rdquo; n.d. Sidbrint.ub.edu. Accessed June 8, 2024. <a href=\"https://sidbrint.ub.edu/en/node/39226\">https://sidbrint.ub.edu/en/node/39226</a>.<br />\r\n2024. Familysearch.org. 2024. <a href=\"https://www.familysearch.org/ark:/61903/3:1:3QS7-89VV-8BRV?view=index&amp;personArk=%2Fark%3A%2F61903%2F1%3A1%3AQ2BV-7K85&amp;action=view\">https://www.familysearch.org/ark:/61903/3:1:3QS7-89VV-8BRV?view=index&amp;personArk=%2Fark%3A%2F61903%2F1%3A1%3AQ2BV-7K85&amp;action=view</a>.<br />\r\n2024. Familysearch.org. 2024. <a href=\"https://www.familysearch.org/ark:/61903/1:1:Q2BV-4HP2\">https://www.familysearch.org/ark:/61903/1:1:Q2BV-4HP2</a>.<br />\r\n2024. Familysearch.org. 2024. <a href=\"https://www.familysearch.org/ark:/61903/3:1:3QS7-L97C-59ZV?view=index&amp;personArk=%2Fark%3A%2F61903%2F1%3A1%3A276Z-JWN&amp;action=view\">https://www.familysearch.org/ark:/61903/3:1:3QS7-L97C-59ZV?view=index&amp;personArk=%2Fark%3A%2F61903%2F1%3A1%3A276Z-JWN&amp;action=view</a>.<br />\r\n&ldquo;CELADA, Antonio R; GONZ&Aacute;LEZ de LA ALEJA, Manuel; PASTOR, Daniel. Los Internacionales : English-Speaking Volunteers in the Spanish Civil War. L&rsquo;Hospitalet de Llobregat: Warren &amp; Pell Pub., 2009. 560 P. | SIDBRINT.&rdquo; n.d. Sidbrint.ub.edu. Accessed June 8, 2024. <a href=\"https://sidbrint.ub.edu/ca/node/18941.&lt;/p&gt;\">https://sidbrint.ub.edu/ca/node/18941.</a></p>\r\n",
    "student_fname": "William",
    "student_lname": "Li",
    "tags": [
        "George Washington Battalion",
        "Brunete Offensive",
        "Retreats",
        "Battle of Belchite",
        "Soldado",
        "Ebro Offensive",
        "Communist Party USA",
        "KIA",
        "Battle of Gandesa"
    ],
    "volunteer_fname": "Emery",
    "volunteer_images": [],
    "volunteer_lname": "Reddon"
}