{
    "class": 2025,
    "data": "<p>Mark Benjamin Rauschwald was born in Brooklyn on July 12, 1908 by his father, Morris Rauschwald and mother, Rose Rauschwald, both of whom were Polish immigrants. His family owned two separate addresses: 117 (62) Pulaski Street and 255 West 19th Street. Growing up as an only child Jewish boy, Rauschwald quickly became interested in painting. Later on in his life, for his education, he spent four years studying painting and art at Cooper Union and the Art Students League, where he developed his exceptional skills in graphic and commercial art. While there, he served on the executive board of the Commercial Artists and Designers Union, which provided healthcare and retirement benefits. During The Great Depression from 1929 to 1939, a period where the stock market crashed, leading to the downfall of the economy and high unemployment rates, Rauschwald became affiliated with The Works Progress Administration (WPA), creating graphic art and political propaganda advertisements. It was during his time in the WPA that Rauschwald felt a sense of motivation as a working class individual and sought to follow communism, which ultimately led him to join the Communist Party (CP) around 1935. <br /><br />Once Rauschwald heard about the Abraham Lincoln Brigades battalion, a private party of Americans that planned to sail to Spain to support the republic against the fascists, he could not give such an opportunity up. In his eyes, along with the countless other volunteers, fascism was the root of all evil. Fascism heavily opposed the idea of social justice and equality. Also, fascism was composed of extreme totalitarian ideals that negatively affected the working class, many of whom were volunteers for the Abraham Lincoln Brigade. On February 11, 1937, Rauschwald received his official passport and set sail to Spain aboard the Ile de France nine days after. <br /><br />On March 3, 1937, Rauschwald and his fellow volunteers landed in Spain, where they were immediately assigned to hardcore military training. Rauschwald was assigned to Madrigueras, where he trained to be set to the front on April 7th. The Abraham Lincoln Battalion worked alongside the British Saklatvala Battalion, the Balkan Dimitrov Battalion, and the Franco-Belgian Sixth February Battalion as the XV International Brigade. They fought several battles at Jarama, Brunette, and the Ebro River. Rauschwald took part in the battle of Jarama and Brunette, where he fought valiantly for the republic. A book published by Harry Fisher, “Comrades: Tales of a Brigadista in the Spanish Civil War”, shares the perspective of the Lincoln Battalion during their stay in Spain and what it was like fighting in the trenches at the Battle of Jarama. Rauschwald was placed into one of the eight groups of their company alongside volunteers Red Bloom, Irv Chocheles, and Harry Fisher himself. Upon spotting a young fascist boy doing his business, they even displayed some dignity when voting in a democratic manner to spare him. As given by Fisher, he even noted that “we ‘tough’ communists had displayed a little fairness in battle”(Fisher, 49-50). While Rauschwald did sustain injuries while fighting on the Mosquito Ridge during The Battle of Brunette, he was quickly transported to a hospital in Madrid, then to the IB hospital in Villanueva de la Jara, where he played the role of an English speaking delegate. Following The Battle of Brunette, due to the severity of his injuries, he moved to Benisa in November and stayed there for 15 days to gradually recover his strength and gain emotional support. Despite all the battles and struggles Rauschwald endured, he still found comfort in drawing and painting, using oil paint and watercolors to display landscapes, portraits, and lithographs. In one of his most well known photos, Rauschwald is seen outside his tent with his painting materials he brought with him all around Spain, painting more graphic art pieces following The Battle of Brunette. In a September 2005 Volunteer article published by ALBA, one of Mark Rauschwald’s drawings is featured, which was made during his stay in Spain. This drawing highlights the contributions that he made in art during the war. Although it does not feature any fancy oil paints that he used in his artistic pieces later on after the war, the sketch, which shows a group of people and a horse gathered by what looks to be Spanish architecture, demonstrates a sense of connectedness of the volunteers that participated in the Abraham Lincoln Brigades. It was at this period of time did Rauschwald truly begin to attract people with his art. One of his later art pieces, “Dining”, depicts what looks like a group of volunteers from the Lincoln Battalion having a good time through entertainment and conversing with one another. This portrayal of the Lincoln Battalion gives the notion of perseverance during times of struggle and demonstrates their bravery for their willingness to fight abroad for their cause. Another one of his art pieces shows a vibrant cityscape of what appears to be one of the many cities he visited in Spain. This highlights the cultural aspect of classic Spanish architecture that Spain has to offer and Spain’s contemporary lifestyle. Before returning to the US, on November 28th, 1938, Rauschwald filled out a filiation form that contained his birth certificate and occupational records. He was also granted permission to bring his painting supplies from Spain back as well. On December 20, 1938, he returned to the US aboard the Ausonia.  <br /><br />Upon arriving in the US, Rauschwald moved to San Diego, California, where he settled in and continued his career as an artist. Unfortunately, once Hitler and his forces invaded Poland and sparked the start of World War II, Rauschwald was immediately recruited to join the US army, where he fought alongside over 16.5 million men and women in the US armed forces. After World War II ended, Rauschwald went back to San Diego, California to cultivate his art through his captivating paintings about progressive, abstract, and political themes. One of the only public art pieces that he made in San Diego was an abstract piece that displays a variety of blotchy, vibrant colors with what appears to be a self-portrait as the main part of the painting. Meanwhile, much of the art he made in Spain was included in an exhibit handled by the Veterans of the Abraham Lincoln Brigade (VALB) in 1963 to serve as a fundraiser to support injured veterans of the war and the Spanish government. The VALB exhibit also served to commemorate the countless lives lost among the volunteers that contributed to the Abraham Lincoln Brigades. Rauschwald met Pauline, who soon became his wife. Mark Rauschwald kept his artistic career alive until he died at the age of 76 in San Diego, California on June 25, 1985. He was buried in Fort Rosecrans National Cemetery, where he was later accompanied by Pauline Rauschwald’s grave when she died five years later on December 4, 1990.</p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1ggrPQLw3aL0D1sKYW2qfeCPU37xI7b4t, https://drive.google.com/open?id=1bz44Dau3-NK9sMzY_ux2KQ5v9CVtmrhb, https://drive.google.com/open?id=1-aJyF2l_iY6oJHgknwHLuNRvN3mTLZ3w",
            "src": ""
        }
    ],
    "sources": "<p>United Scenic Artists. Local USA 829. (2017b). <a href=\"https://www.usa829.org/About-Our-Union/Introduction#:~:text=Local%20USA%20829%20establishes%20wages,(k)%20and%20Annuity%20benefits\">https://www.usa829.org/About-Our-Union/Introduction#:~:text=Local%20USA%20829%20establishes%20wages,(k)%20and%20Annuity%20benefits</a><br /><br />WPA Art Collection. U.S. Department of the Treasury. (2022, March 2). <a href=\"https://home.treasury.gov/about/history/collection/paintings/wpa-art-collection\">https://home.treasury.gov/about/history/collection/paintings/wpa-art-collection</a><br />Rauschwald, Mark Benjamin. SIDBRINT. (n.d.). <a href=\"https://sidbrint.ub.edu/ca/node/27219\">https://sidbrint.ub.edu/ca/node/27219</a><br /><br />Carroll, P., Herrmann, G., Ottanelli, F., & Smorodin, A. (2005, September). September 2005 - the volunteer. <a href=\"https://albavolunteer.org/wp-content/uploads/2019/11/Volunteer2005-3-Sep.pdf\">https://albavolunteer.org/wp-content/uploads/2019/11/Volunteer2005-3-Sep.pdf</a><br /><br /> Ink, S. (2022, November 11). Rauschwald, Mark Benjamin. The Abraham Lincoln Brigade Archives. <a href=\"https://alba-valb.org/volunteers/mark-benjamin-rauschwald/\">https://alba-valb.org/volunteers/mark-benjamin-rauschwald/</a> <br /><br />Fisher, H. (1998). Comrades: Tales of a brigadista in the Spanish Civil War. <a href=\"https://bannedthought.net/Spain/CivilWar/Comrades-TalesOfABrigadistaInTheSpanishCivilWar-Fisher-1998-OCR-sm.pdf\">https://bannedthought.net/Spain/CivilWar/Comrades-TalesOfABrigadistaInTheSpanishCivilWar-Fisher-1998-OCR-sm.pdf</a> <br /><br />Mark Benjamin Rauschwald (1908-1985) - find a... Find a Grave. (n.d.). <a href=\"https://www.findagrave.com/memorial/3426203/mark-benjamin-rauschwald\">https://www.findagrave.com/memorial/3426203/mark-benjamin-rauschwald</a> <br /><br />Mark Rauschwald Papers: NYU Special Collections Finding aids. Mark Rauschwald Papers: NYU Special Collections Finding Aids. (n.d.-a). <a href=\"https://findingaids.library.nyu.edu/tamwag/alba_092/\">https://findingaids.library.nyu.edu/tamwag/alba_092/</a> <br /><br />Spanish Civil War Abraham Lincoln Brigade artist M. Rauschwald abstract painting. eBay. (n.d.). <a href=\"https://www.ebay.com/itm/304972283578\">https://www.ebay.com/itm/304972283578</a> <br /><br />FamilySearch Wiki. (2024, March 23). World War II united states military records, 1941 to 1945. FamilySearch Wiki. <a href=\"https://www.familysearch.org/en/wiki/World_War_II_United_States_Military_Records,_1941_to_1945#:~:text=Over%2016.5%20million%20men%20and,causes%2C%20and%20670%2C846%20were%20wounded </p>\">https://www.familysearch.org/en/wiki/World_War_II_United_States_Military_Records,_1941_to_1945#:~:text=Over%2016.5%20million%20men%20and,causes%2C%20and%20670%2C846%20were%20wounded </p></a>",
    "student_fname": "Justin",
    "student_lname": "Moy",
    "tags": [
        "Cooper Union",
        "Passport",
        "Ausonia",
        "Ile de France",
        "WWII veteran",
        "Brooklyn",
        "Art Students League",
        "Villanueva de la Jara",
        "Commercial Artists and Designers Union",
        "Artist",
        "Member of Communist Party",
        "Painter",
        "Jewish",
        "Battle of Brunete",
        "Battle of Jarama",
        "Madrid Hospital",
        "WPA"
    ],
    "volunteer_fname": "Mark",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=10iribO4AgpOUPC49ugqVO8TKhd-L-n3B",
            "src": ""
        }
    ],
    "volunteer_lname": "Rauschwald",
    "year_published": 2024
}