{
    "class": 2025,
    "data": "<p>Edward Andrew Mroczkowski was born on August 16, 1915, in Jersey City, New Jersey. The son of Stanislaus Mroczkowski and Anna Mroczkowski, he lived in Jersey City his entire childhood and attended zoned school up through high school. <br /><br />Upon completing his high school education, Mroczkowski attended Columbia University in New York City for his undergraduate degree. He majored in English, with the ultimate goal of teaching Classics. To that end, he taught younger students in Pennsylvania during his summer vacations. Starting in his college years, and throughout his life, he would be known as an athletic and burly man. He was an active member of the freshman rowing and water polo teams and played soccer, softball, and wrestling. However, his education was interrupted by the outbreak of the Spanish Civil War. Inspired by his liberal education and background, he paused his education at Columbia, acquired a passport, and got on the next ship headed to Spain. <br /><br />Mroczkowski departed to Spain on June 16, 1937, on board the RMS Aquitania. Despite not being a Canadian, he served with the Mackenzie-Papineau Battalion (“Macpaps”), a detachment of Canadians within the Abraham Lincoln Brigade. Due to Canada’s strict immigration controls on travel to Spain, many Macpaps traveled to Spain through America, following American volunteers of the Lincoln and George Washington Battalions. On board the same ship to Spain, Mroczkowski met the Canadian volunteers. Like many of the Canadians, he was a member of the Communist Party, having joined in 1936 while at Columbia. As more Canadians arrived in Spain in July of 1937 and gathered in Albacete, they formally organized a separate battalion and named it after two popular Canadian politicians and reformers, William Lyon Mackenzie and Louis-Joseph Papineau. However, there weren’t enough Canadians in Spain to fill an entire battalion, so at times the battalion was half or even a majority non-Canadian. Many Americans who had become detached from the American battalions found their way into the Macpaps’ ranks and fought under the Macpaps’ Canadian flag, Mroczkowski being among the first of them. <br /><br />Mroczkowski spent a total of 17 months in Spain—9 of them being on the frontlines as a sergeant and the remainder as a captain. He immediately saw combat with his battalion at the Battle of Brunete, where they were tasked with aiding a Republican offensive to relieve the city of Madrid. In this battle, he was able to distinguish himself as an effective soldier and extremely capable. In May of 1938, Mroczkowski was promoted from sergeant to captain in recognition of his service and the leadership he exhibited on the battlefield. As a commissioned officer, he did not see any successful campaigns or operations. Rather, he helped command the retreat of Republican forces following the disastrous Aragon Offensive. He would see combat a final time with the rest of his battalion at the Battle of the Ebro. Following the Republic’s defeat in the battle, Mroczkowski, along with the rest of his brigade, was forced to make a final retreat and face the disbandment of all International Brigades. <br /><br />Prime Minister Juan Negrín officially dissolved the International Brigades on September 21, 1938. However, Mroczkowski did not immediately return home to the United States. Due to strict laws and heightened suspicion of all Lincoln Brigade veterans for their communist sympathies, he had a hard time obtaining a visa and finding a ship that would take him back to the US. Along with about 50 other American volunteers, including famous author Arthur Harold Landis, they joined “La Retirada,” the mass exodus of Republican civilians and soldiers to France towards the end of the Civil War. Together, they traveled to Le Havre in Northern France and boarded the RMS Ausonia, a Canadian ocean liner. Making stops in England and Halifax, the Ausonia sailed into New York Harbor on December 20, 1938. <br /><br />Following his return from the war, Mroczkowski worked various jobs in the private sector and also served in World War II. After completing his degree from Columbia, he acquired a pilot’s license under the Civil Aeronautics Administration (CAA). His first job after graduating would be as a teacher, teaching for the CAA at Hofstra College in Hempstead, New York. He despised the job, complaining that he spent his time “hacking away the days at public relations.” However, on a more positive note, he would get married to his wife Jane S. Morrow in 1939 in New Jersey. In 1941, he joined the Shipping Digest as a reporter. It was here where he could change his surname from Mroczkowski to Morrow to fit the byline of his articles. Four months later, he was promoted to editor. Soon after, he transferred to the Journal of Commerce as a reporter and then to the New York Times in August of 1943 as a business reporter. He would continue to report for the Times until the latter part of World War II when he enlisted in the US Army. <br /><br />In May of 1945, Morrow enlisted in the US Army and served in the School of Russian Language, based at the University of Indiana. He would continue his service in the army even after World War II, being transferred to the Counterintelligence Corps School at Fort Ritchie and Fort Holabird in Maryland. He would be honorably discharged in July of 1946 and return to the New York Times in August of the same year. <br /><br />Upon his return to the New York Times, he would become a foreign correspondent and be stationed abroad, in countries from Germany to Poland to Argentina. There, he would publish articles on the Cold War. He would continue to work as a foreign correspondent until 1958 when he returned to the US to become a transportation news staffer. On May 15, 1969, after being transported to Riverview Hospital in New Jersey, Edward Andrew Morrow (né Mroczkowski) died of a heart attack. </p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1MAgTEkqz-VPOiVcR0UzBMstLrGbbx7b_",
            "src": ""
        }
    ],
    "sources": "<p>The New York Times. \"Edward A. Morrow, 53, Dies; A Times Reporter for 26 Years.\" New York Times (1923-), May 16, 1969. <a href=\"https://www.proquest.com/historical-newspapers/edward-morrow-53-dies-times-reporter-26-years/docview/118501027/se-2\">https://www.proquest.com/historical-newspapers/edward-morrow-53-dies-times-reporter-26-years/docview/118501027/se-2</a>. <br /><br />Abraham Lincoln Brigade Archives. “Mroczkowski, Edward Andre.” The Abraham Lincoln Brigade Archives, October 16, 2022. <a href=\"https://alba-valb.org/volunteers/edward-andre-mroczkowski/\">https://alba-valb.org/volunteers/edward-andre-mroczkowski/</a>. <br /><br />Friends and Veterans of the Mackenzie-Papineau Battalion. “The Macpaps.” Friends and Veterans of the Mackenzie-Papineau Battalion. <a href=\"https://www.macpapbattalion.ca/history/the-formation-of-the-mac-paps/\">https://www.macpapbattalion.ca/history/the-formation-of-the-mac-paps/</a>. <br /><br />“RMS Ausonia.” HMS Ausonia, December 31, 2017. <a href=\"http://hmsausonia.co.uk/history/cunard-a-class-ships/ausonia/\">http://hmsausonia.co.uk/history/cunard-a-class-ships/ausonia/</a>. <br /><br />Carroll, Peter N. The Odyssey of the Abraham Lincoln Brigade: Americans in the Spanish Civil War. Stanford, CA: Stanford University Press, 1994. <br /><br />New York University Special Collections.  MacKenzie-Papineau Battalion of Canada. New York, NY. </p>",
    "student_fname": "Rayen",
    "student_lname": "Zhou",
    "tags": [
        "Mackenzie-Papineau Battalion",
        "Member Of Communist Party",
        "Journalist",
        "Sergeant",
        "Ebro Offensive",
        "Brunete Offensive",
        "Captain",
        "Polish",
        "Columbia University",
        "New Jersey",
        "WWII Veteran"
    ],
    "volunteer_fname": "Edward Andrew",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1kKIWU0UUWXoEhOwZKNNNG3Cn87TA4EgR",
            "src": ""
        }
    ],
    "volunteer_lname": "Mroczkowski",
    "year_published": 2024
}