{
    "class": "2023",
    "data": "<p>David Gillis Kelly was born on April 20, 1903 in Johnstown, Pennsylvania. He grew up with a mother, father, three brothers, and two sisters. He graduated high school in 1922. He was an artist (painter) and lived in Washington DC. His passport number was #476206, which he received on September 14, 1937.<br />\r\n<br />\r\nOn October 2nd, 1937 he sailed to Spain on the SS Georgic. On the ship, he was in charge of the group and he took his job very seriously and was very disciplined. He was one of many LGBT volunteers.<br />\r\n<br />\r\nHe served with XV BDE in the rank of Soldado. His parter also served with XV BDE and was also a soldado. The XV BDE was a mixed brigade and had different battalions based on countries. The battalions were the British Battalion, the Lincoln Battalion, the Balkan Dimitrov Battalion, and the Franco-Belgian Sixth February Battalion. These battalions fought at a plethora of cities including Jarama, Brunete, Boadilla, Belchite, Fuentes de Ebro, Teruel, and El Ebro.<br />\r\n<br />\r\nHe was captured during battle and reported MIA in Gandesa and so was his partner. He was a part of the &ldquo;Undercrust&rdquo; which was a concentration camp in San Pedro de Cardenas. When Kelly and his partner were captured, they both reported similar dreams of food, concerts, ballet, and impressionist paintings. He was returned on April 22, 1939, after which he returned to the United States on the Ile de France. He also became a merchant marine in World War II.<br />\r\n<br />\r\nHe met his partner John George &ldquo;Jack&rdquo; Mail who was also a veteran of the Spanish Civil War and together they opened a flower shop in New York City. This flower shop was located somewhere around the Queensboro Bridge or Tudor City. The couple was very passionate about food. His address was 410 (110) Madison Avenue, NYC. He lived to almost 80 years old and died in April 1982 in New Hope Pennsylvania.</p>\r\n",
    "school_crests": [],
    "sources": "<p>Folder 1, Box 13. Guide to the Abraham Lincoln Brigade Archives vertical files: Individuals ALBA.VF.002. NYU Abraham Lincoln Archives. Accessed June 2, 2022. <a href=\"http://dlib.nyu.edu/findingaids/html/tamwag/alba_vf_002/dscref1234.html\">http://dlib.nyu.edu/findingaids/html/tamwag/alba_vf_002/dscref1234.html</a>.<br />\r\n<br />\r\nFolder 29, Box 5. Guide to the Abraham Lincoln Brigade Archives vertical files: Individuals ALBA.VF.002. NYU Abraham Lincoln Archives. Accessed June 2, 2022. <a href=\"http://dlib.nyu.edu/findingaids/html/tamwag/alba_vf_002/dscref1234.html\">http://dlib.nyu.edu/findingaids/html/tamwag/alba_vf_002/dscref1234.html</a>.<br />\r\n<br />\r\n&ldquo;Kelly, David Gillis.&rdquo; The Abraham Lincoln Brigade Archives. Social Ink, August 8, 2020. <a href=\"https://alba-valb.org/volunteers/david-gillis-kelly/\">https://alba-valb.org/volunteers/david-gillis-kelly/</a>.<br />\r\n<br />\r\n&ldquo;Mail, John George.&rdquo; The Abraham Lincoln Brigade Archives. Social Ink, June 9, 2020. <a href=\"https://alba-valb.org/volunteers/john-george-mail/\">https://alba-valb.org/volunteers/john-george-mail/</a>.<br />\r\n<br />\r\n&ldquo;XV International Brigade.&rdquo; Military Wiki. Accessed June 2, 2022. <a href=\"https://military-history.fandom.com/wiki/XV_International_Brigade\">https://military-history.fandom.com/wiki/XV_International_Brigade</a>.</p>\r\n",
    "student_fname": "Samira",
    "student_lname": "Murad",
    "tags": [
        "LGBT",
        "Ile de France",
        "Undercrust",
        "Artist",
        "SS Georgic",
        "Soldado",
        "Merchant Marine",
        "WWI Veteran",
        "POW"
    ],
    "volunteer_fname": "David Gillis",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/u/0/open?usp=forms_web&id=10PgYDQDx0uOdsq_SPHyro8d0Q3pJmwSl",
            "src": ""
        }
    ],
    "volunteer_lname": "Kelly"
}