{
    "class": "2025",
    "data": "<p><br />\r\nIn the late twentieth century, Russia was one of the poorest countries in the world, and in the early 1900s Yetta and Max Reinleb left the nation and arrived in the United States with their children, Abe, Sarah and Rubin. They blended in with a large wave of immigration and were the first in their generation to arrive in the United States. Abe was the oldest child, born in 1896. Rubin was born in 1899 and Sarah, the only daughter, was born in 1897. When they came to New York, they had two more children, Morris and Hyman. Morris was born in 1904, and Hyman was born in 1906. The family was jewish, and Hyman had brown eyes, brown hairs and eventually grew to a height of 5 &#39;9&#39;&rsquo;. Only four years after Hyman was born, his father died at the age of 42 on February 13, 1910. His mother had to face the challenge of raising 5 children as a single immigrant mother because the rest of her family still lived in Russia. To blend into the society around him Hyman would sometimes go by Harry. He grew up in Brooklyn, Kings, New York.<br />\r\n<br />\r\nAs he grew up, he would start to read articles about the rise of Fascism in Nazi Germany and the poor treatment of the Jewish people in Europe. Although it seemed so far away, it felt personally close to Hyman, being Jewish himself. Along with this, his home country Russia had become a Communist nation and because of events like these Hyman joined the Communist Party of the United States.<br />\r\n<br />\r\nBy the time the Civil War broke out in Spain, Hyman had become determined to fight against the Fascists. He wasn&rsquo;t as loyal to the Communist Party as others around him, but seeing what the Fascists were already doing in Germany, he wanted to help fight against them. He left the Communist Party of the United States before he boarded the Lafayette and sailed off to France and finally made it to Spain in January of 1937. After receiving military training, he prepared to fight in his first battle. Although he didn&rsquo;t fully understand the language, he was able to get the gist of how to fight and was fueled with anger and ready to fight the fascists. Although he missed his wife dearly, he met new friends in Spain from his home. Within the next month, he moved near Madrid to Jarama. Franco, having failed to take Madrid, attempted to cut off Madrid by taking Jarama to the Southeast. The Battle of Jarama was bloody and took many lives, and on February 27, the final day of the battle, Hyman would be wounded and sent to a hospital in Tarancon.<br />\r\n<br />\r\nHyman would not be deterred, however. In July, the republicans would invade Brunette to alleviate pressure towards Madrid from Franco and give Republicans time to reorganize themselves. This battle resulted in a massive loss in men and resources for the Republicans, but Hyman would get away unharmed. After this battle, Hyman wouldn&rsquo;t participate in any other battles, but would remain in Spain until early 1938. Specifically, he remained in Murcia where he would be in charge of the publications of various magazines. During his time in Spain, he lost his passport and had to arrive in the US as an immigrant on February 23, 1938.<br />\r\nGot married to betty<br />\r\n<br />\r\nJust 2 years later, on October 16 or 1940, he would have another chance to fight against fascists, as he was drafted into the war effort for World War Two. He got out of both wars alive, and lived a relatively poor life with his wife until she died in 1961, and he died in 1993. They had no kids, and he died in the same house he grew up in.</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;Base de Datos Elaborada Por Brunete En La Memoria (ACTUALIZADA).&rdquo; Combatientes. Accessed June 6, 2024. <a href=\"https://www.combatientes.es/BasedeDatosBrunete.htm\">https://www.combatientes.es/BasedeDatosBrunete.htm</a>.<br />\r\nCercabib.ub.edu. Accessed June 6, 2024. <a href=\"https://cercabib.ub.edu/discovery/fulldisplay?context=L&amp;vid=34CSUC_UB%3AVU1&amp;search_scope=MyInstitution&amp;tab=LibraryCatalog&amp;docid=alma991012622543306708\">https://cercabib.ub.edu/discovery/fulldisplay?context=L&amp;vid=34CSUC_UB%3AVU1&amp;search_scope=MyInstitution&amp;tab=LibraryCatalog&amp;docid=alma991012622543306708</a>.<br />\r\nFamilySearch.org. Accessed June 6, 2024. <a href=\"https://www.familysearch.org/ark:/61903/1:1:242S-55S\">https://www.familysearch.org/ark:/61903/1:1:242S-55S</a>.<br />\r\nFamilySearch.org. Accessed June 6, 2024. <a href=\"https://www.familysearch.org/ark:/61903/1:1:2WCR-L4X\">https://www.familysearch.org/ark:/61903/1:1:2WCR-L4X</a>.<br />\r\nFamilySearch.org. Accessed June 6, 2024. <a href=\"https://www.familysearch.org/ark:/61903/1:1:6KMG-9WBL\">https://www.familysearch.org/ark:/61903/1:1:6KMG-9WBL</a>.<br />\r\nFamilySearch.org. Accessed June 6, 2024. <a href=\"https://www.familysearch.org/ark:/61903/1:1:K917-LCZ\">https://www.familysearch.org/ark:/61903/1:1:K917-LCZ</a>.<br />\r\nFamilySearch.org. Accessed June 6, 2024. <a href=\"https://www.familysearch.org/ark:/61903/1:1:M5HS-H76\">https://www.familysearch.org/ark:/61903/1:1:M5HS-H76</a>.<br />\r\nFamilySearch.org. Accessed June 6, 2024. <a href=\"https://www.familysearch.org/ark:/61903/1:1:QK1G-GYKH\">https://www.familysearch.org/ark:/61903/1:1:QK1G-GYKH</a>.<br />\r\nFamilySearch.org. Accessed June 6, 2024. <a href=\"https://www.familysearch.org/ark:/61903/1:1:VS6Y-VMQ\">https://www.familysearch.org/ark:/61903/1:1:VS6Y-VMQ</a>.<br />\r\nFamilySearch.org. Accessed June 6, 2024. <a href=\"https://www.familysearch.org/ark:/61903/1:1:VS6Y-VMQ\">https://www.familysearch.org/ark:/61903/1:1:VS6Y-VMQ</a>.<br />\r\nFamilySearch.org. Accessed June 6, 2024. <a href=\"https://www.familysearch.org/ark:/61903/1:1:W746-7ZT2\">https://www.familysearch.org/ark:/61903/1:1:W746-7ZT2</a>.<br />\r\nFamilySearch.org. Accessed June 6, 2024. <a href=\"https://www.familysearch.org/ark:/61903/1:1:X4JB-M3G\">https://www.familysearch.org/ark:/61903/1:1:X4JB-M3G</a>.<br />\r\nJews in the Spanish Civil War. Accessed June 6, 2024. <a href=\"https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war\">https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war</a>.<br />\r\nNational Archives and Records Administration. Accessed June 6, 2024. <a href=\"https://catalog.archives.gov/id/87909464?objectPage=325\">https://catalog.archives.gov/id/87909464?objectPage=325</a>.<br />\r\n&ldquo;Reinleb, Hyman.&rdquo; SIDBRINT. Accessed June 6, 2024. <a href=\"https://sidbrint.ub.edu/ca/content/reinleb-hyman\">https://sidbrint.ub.edu/ca/content/reinleb-hyman</a>.<br />\r\n&ldquo;Reinleb, Hyman.&rdquo; The Abraham Lincoln Brigade Archives, November 18, 2022. <a href=\"https://alba-valb.org/volunteers/hyman-reinleb/\">https://alba-valb.org/volunteers/hyman-reinleb/</a>.</p>\r\n",
    "student_fname": "Ivan",
    "student_lname": "Valtchev",
    "tags": [
        "Jewish",
        "Russian",
        "WWII Veteran",
        "Member of Communist Party",
        "Jarama",
        "Brunete Offensive"
    ],
    "volunteer_fname": "Hyman",
    "volunteer_images": [],
    "volunteer_lname": "Reinleb"
}