{
    "class": 2025,
    "data": "<p>Arthur Greenspoon was born on January 26, 1920, in Bayonne, Hudson, New Jersey to Frank and Marion Greenspoon. Both of his parents were of Jewish origin; his father was born in Russia, and his mother’s parents were from Austria and Hungary. Despite his heritage, records show that Greenspoon was an active member of a Protestant Christian church, Bergen Point Community Church, from a young age, indicating his family’s religious practices. <br /><br />On April 6, 1933, at age 13, Greenspoon traveled to Hamburg, Germany. The visit coincided with Adolf Hitler being appointed chancellor just five months earlier. Greenspoon’s experience in Germany during the Nazi rise to power may have influenced his later decision to fight in the Spanish Civil War. By 1935, at age 15, he joined the Youth Communist League, suggesting an early engagement in political activities that likely motivated his later actions.<br /><br />Greenspoon completed only a high school education and lived at 350 East 13th Street in New York City, near the old Stuyvesant High School building. At age 17, he enlisted in the 15th International Brigade and arrived in Spain aboard the Washington on February 24, 1937. He was assigned to the 1st Regiment de Tren, a transportation unit, where he was described in his first progress report as an “anti-fascist,” reflecting his political beliefs.<br /><br />On November 28, 1937, Greenspoon received a letter from his father demanding that he return home before Christmas because his mother was very ill. In the letter, his father asks when his family can expect him and what is delaying him, indicating a level of uncertainty with his family not being fully aware of Greenspoon’s plans. It is unclear but assumed that Greenspoon did not go to America to visit his family, despite the records stating that this request by his family was approved. One of his progress reports states “Parents making a fuss in America”, which indicates that his parents continued to urge him to return home. Despite his resistance to his parents’ efforts, he was noted as “irresponsible”, a “mediocre comrade”, and having “poor political development” in his reports. He was deserted in Paris, and although it is unclear if he was deserted or if he chose to be deserted, the records state that he was “persuaded” to go back, which he complied with and thus was sent to a different post, the XV Brigade Auto Park Albacete. <br /><br />The Auto Park was more accommodating to his age and inexperience, consisting of dispatchers, drivers, mechanics, and the rolling stock assigned to the brigade headquarters. In a progress report, it was written that he had been improving since (in comparison to before his abandonment in Paris) and he took up the role of a driver. In his progress report, it was noted that although he was very “youthful in his outlook,” he “hardly knows what the struggle is all about”, which can point to a potential explanation for his abandonment in Paris. It also was written that he needs plenty of political development and education, which is a point emphasized throughout his progress reports. It is clear that although he had the youthful spirit and drive to fight the fascists, Greenspoon lacked the experience and political education in comparison to his peers. <br /><br />The brigades were formally withdrawn from Spain, and it is documented that Greenspoon arrived in New York on April 10, 1938. After the war, he pursued the occupation of an electrical contractor, and he married his first wife in 1940. A few years later, Greenspoon also fought in WW2 in the US Marine Corps. He returned to New York on June 14, 1942, at age 22, and married his second wife (it is not clear what happened to his first wife). Greenspoon would go on to have two children, and live as an electrician. He passed away on January 4, 1983, and was buried in Fort Sam Houston National Cemetery, San Antonio, Texas. </p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1I6p_dUPdRFSywLKOQ3bxtudlieTK58yL",
            "src": ""
        }
    ],
    "sources": "<p>“Greenspoon, Arthur.” The Arthur Lincoln Brigades Archives, <a href=\"https://alba-valb.org/volunteers/arthur-greenspoon/\">https://alba-valb.org/volunteers/arthur-greenspoon/</a>.<br /><br />1950 United States Federal Census, “Arthur Greenspoon.” My Heritage, 1950. <a href=\"https://www.myheritage.com/research/record-11006-39524452/arthur-greenspoon-in-1950-united-states-federal-census\">https://www.myheritage.com/research/record-11006-39524452/arthur-greenspoon-in-1950-united-states-federal-census</a>. <br /><br />New York City Marriages, 1866-1949, “Arthur Greenspoon & Clare Schechter.” My Heritage, 1949. <a href=\"https://www.myheritage.com/research/record-20807-267615/arthur-greenspoon-and-clare-schechter-in-new-york-city-marriages\">https://www.myheritage.com/research/record-20807-267615/arthur-greenspoon-and-clare-schechter-in-new-york-city-marriages</a>.<br /><br />Arthur Greenspoon Progress Reports, Ф.545.6д.902 - Case 902. Personal Files of American Volunteers (Gra-Gre). <a href=\"https://scwnyc.stuy.edu/documents/545_6_902.html\">https://scwnyc.stuy.edu/documents/545_6_902.html</a>.<br /><br />Letters from Father, Ф.545.6д.902 - Case 902. Personal Files of American Volunteers (Gra-Gre). <a href=\"https://scwnyc.stuy.edu/documents/545_6_902.html\">https://scwnyc.stuy.edu/documents/545_6_902.html</a>. <br /><br />Arthur Greenspoon Picture, “Grand Prize.” Newspapers.com, April 21, 1963. <a href=\"https://newscomwc.newspapers.com/image/29638237/?match=1&terms=arthur%20greenspoon&pqsid=DGB3RJKgbUoBcc7RwxTqng%3A19549%3A202805594\">https://newscomwc.newspapers.com/image/29638237/?match=1&terms=arthur%20greenspoon&pqsid=DGB3RJKgbUoBcc7RwxTqng%3A19549%3A202805594</a>. <br /><br />Annual Strawberry Festival at Bergen Point M. E. Church, Newspaper.com, June 12, 1928. <a href=\"https://newscomwc.newspapers.com/image/908226136/?match=1&terms=arthur%20greenspoon&pqsid=DGB3RJKgbUoBcc7RwxTqng%3A19549%3A202805594. </p>\">https://newscomwc.newspapers.com/image/908226136/?match=1&terms=arthur%20greenspoon&pqsid=DGB3RJKgbUoBcc7RwxTqng%3A19549%3A202805594. </p></a>",
    "student_fname": "Grace",
    "student_lname": "Rhee",
    "tags": [
        "Teenager",
        "US Marine Corps",
        "Youth Communist League",
        "XV Brigade",
        "Anti-Fascist",
        "XV Brigade Auto Park Albacete",
        "Jewish",
        "WWII Veteran"
    ],
    "volunteer_fname": "Arthur",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1uFezOUf4sE6gcEKE2MU1xDjL4xuPYNCN",
            "src": ""
        }
    ],
    "volunteer_lname": "Greenspoon",
    "year_published": 2024
}