{
    "class": 2024,
    "data": "<p>Owen Wiiri (Weiri) was born on October 31st, 1916, and lived on 15 West 126th Street in Harlem, surrounded by the flourishing Harlem renaissance at the time. His father, Guustava Weiri, immigrated from Finland to New York in hopes of a better life. There he met Konsta Hill, and Owen Wiiri was born. He went to public school up until 9th grade which he dropped out of Flushing High School, where later he went to civilian military training, and then moved onto carpentry for employment; he had always been interested in the arts and continued to pursue that throughout his life. He married an older woman, Margaret, who took on his last name. He joined the Young Communist League in New York in 1933 and heard through them of the civil war in Spain, and quickly after the Abraham Lincoln Brigade. Owen had strong opinions on the state of fascism and was part of the communist party, so he joined without hesitation. He sailed to Spain on June 2nd, 1937 aboard the Paris with many others of the league.<br /><br /> Owen was placed in the Machine Gun company of the Mackenzie-Papineau battalion, where he was regarded by the rest as the company’s artist. Unfortunately, his only works published were made after the war. He touched on topics of Industrialism and the working people, something he was clearly involved with. Though many of the members of the battalion were Canadian and spoke French, he still felt like he had a place in the company. After just a month of basic training, the battalion was sent out to their first battle at Fuentes de Ebro. Having been so early in the war, and the little training of the company led to this being one of the bloodiest battles of the war. Owen was not exempt from the violence, suffering intense shell shock and temporary blindness. Yet he stayed in Spain and powered on through the war with the Mackenzie-Papineau for another year. He returned on July 2nd, 1938 aboard the President Harding, Just months before the International Brigade send-off in Barcelona. He later served in WWII, and afterward was placed on a list of un-American propaganda activities for his time served with the Abraham Lincoln Brigade, and eventually passing away in Texas, July 9th, 1974. <br /></p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1rqRLOxr_3XsisnKgzGyGpDUCSXjqPv9H",
            "src": ""
        }
    ],
    "sources": "<p>1stDibs.com. “Owen Weiri (Also Wiiri) - Owen Weiri (Also Wiiri), the Coal Miner.” Accessed June 8, 2024. <a href=\"https://www.1stdibs.com/art/prints-works-on-paper/portrait-prints-works-on-paper/owen-weiri-also-wiiri-owen-weiri-also-wiiri-coal-miner/id-a_13632092/\">https://www.1stdibs.com/art/prints-works-on-paper/portrait-prints-works-on-paper/owen-weiri-also-wiiri-owen-weiri-also-wiiri-coal-miner/id-a_13632092/</a>.<br /><br />Activities (1938-1944), United States Congress House Special Committee on Un-American. Investigation of Un-American Propaganda Activities in the United States: Hearings before a Special Committee on Un-American Activities, House of Representatives, Seventy-Fifth Congress, Third Session-Seventy-Eighth Congress, Second Session, on H. Res. 282, to Investigate (L) the Extent, Character, and Objects of Un-American Propaganda Activities in the United States, (2) the Diffusion within the United States of Subversive and Un-American Propaganda That Is Instigated from Foreign Countries or of a Domestic Origin and Attacks the Principle of the Form of Government as Guaranteed by Our Constitution, and (3) All Other Questions in Relation Thereto That Would Aid Congress in Any Necessary Remedial Legislation. Google Books. U.S. Government Printing Office, 1944. <a href=\"https://books.google.com/books?id=VZ1YAAAAMAAJ&pg=PA290&lpg=PA290&dq=%22owen+weiri%22&source=bl&ots=vivHrYuRCx&sig=ACfU3U0Ti6zq4R50mqOV_pO5nCLD7kQagA&hl=en&sa=X&ved=2ahUKEwis1veTsfCFAxWNMVkFHXLJCG44ChDoAXoECAYQAw#v=onepage&q=%22owen%20weiri%22&f=false\">https://books.google.com/books?id=VZ1YAAAAMAAJ&pg=PA290&lpg=PA290&dq=%22owen+weiri%22&source=bl&ots=vivHrYuRCx&sig=ACfU3U0Ti6zq4R50mqOV_pO5nCLD7kQagA&hl=en&sa=X&ved=2ahUKEwis1veTsfCFAxWNMVkFHXLJCG44ChDoAXoECAYQAw#v=onepage&q=%22owen%20weiri%22&f=false</a>.<br /><br />Ancestry.com. “Konsta Hill in the 1940 Census | Ancestry®.” Accessed June 8, 2024. <a href=\"https://www.ancestry.com/1940-census/usa/New-York/Konsta-Hill_ft5vf\">https://www.ancestry.com/1940-census/usa/New-York/Konsta-Hill_ft5vf</a>.<br /><br />sidbrint.ub.edu. “WIIRI, Owen | SIDBRINT.” Accessed June 8, 2024. <a href=\"https://sidbrint.ub.edu/en/content/wiiri-owen\">https://sidbrint.ub.edu/en/content/wiiri-owen</a>.<br /><br />The Abraham Lincoln Brigade Archives. “Wiiri, Owen,” December 11, 2019. <a href=\"https://alba-valb.org/volunteers/owen-wiiri/.</p>\">https://alba-valb.org/volunteers/owen-wiiri/.</p></a>",
    "student_fname": "Eli",
    "student_lname": "Lizama",
    "tags": [
        "Mackenzie-Papineau Battalion",
        "Communist",
        "Artist",
        "Fuentes de Ebro",
        "Finnish",
        "WWII Veteran",
        "Young Communist League"
    ],
    "volunteer_fname": "Owen",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1yrMoTam7f3Es3J_sxmUV251-MBCZ0zEN",
            "src": ""
        }
    ],
    "volunteer_lname": "Wiiri",
    "year_published": 2024
}