{
    "class": 2026,
    "data": "<p>Henry Harry Thomas also known as Henry Harris Thomas was born in 1916 and raised in Manhattan, New York City. With a listed address of 611 west 111th street apartment 58 at the time of his passport receival on March 25, 1937. Previous to his experience in Spain Henry was a clerk within the city while also having deep roots/connections with the Young Communist League. Shortly after receiving his passport Henry embarked on the Georgic on May 15, 1937 finally reaching Spain on June 2, 1937. This will mark the beginning of his participation in the war. <br /><br />Upon arrival Henry was automatically involved, serving with the XV Brigade Auto Park, specifically in the Lincoln-Washington Battalion, Company 2, and later, Company 3. By July 1938, he was stationed at the Plaza Mayor Armory with the Lincoln-Washington Battalion, holding the rank of Soldado (Private). Throughout his entire time within Spain he participated in every conflict while managing to never obtain an injury despite constantly being on the front lines. Starting with the battle of Quinto in August of 1937, despite the town facing heavy damage it was captured. Shortly after he participated in the battle of Belchite August -September 1937 which aimed at slowing down nationalist advancements. In December 1937 - February 1938 he participated in the Battle of Teruel which was one of the coldest and most grueling battles of the war, it highlighted the determination and resilience of the brigade. Finally spanning from July-November of 1938 he participated in the Ebro offensive which was a desperate attempt to turn the war around but ultimately ended in a retreat of the republic. Thomas returned home aboard the Ausonia on December 20, 1938.<br /><br />Upon returning Thomas wasn’t done making a difference. Thomas remained active within the presence of anti-fascist efforts in New York City. He was a member of the VALB and advocated for an independent Veterans Committee which aimed at Anti-Fascist Action. Henry took an outspoken stance on the situation which ultimately led to his expulsion from the Veterans of Abraham Lincoln Brigade (VALB). He felt as if the party strayed from its original revolutionary roots. Making this very evident on August 16, 1939 when dramatically declaring “I am no longer a member of the Stalinist party” at a VALB meeting. On another occasion shortly after Thomas  criticized the party, stating, “The Communist Party had thrown the hammer and sickle out the window while I was fighting fascists in Spain.” This was his last straw with the VALB ultimately resulting in him abandoning the cause. <br /></p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1xI3uA-6-1Av4nsTH1JezFwUzVhBdhH6L, https://drive.google.com/open?id=1GaCtnJKpj8o8Z7Dsd_pKuqnBVUZeChlL",
            "src": ""
        }
    ],
    "sources": "<p>Ink, Social. “Thomas, Henry Harry.” The Abraham Lincoln Brigade Archives, 21 Dec. 2022, alba-valb.org/volunteers/henry-harry-thomas/. <br />“The Odyssey of the Abraham Lincoln Brigade : Americans in the Spanish Civil War : Carroll, Peter N : Free Download, Borrow, and Streaming.” Internet Archive, Stanford, Calif. : Stanford University Press, 1 Jan. 1994, archive.org/details/odysseyofabraham0000carr. <br /></p>",
    "student_fname": "Jacob Ruben",
    "student_lname": "Licona",
    "tags": [
        "Communist",
        "Passport",
        "Ausonia",
        "Toledo front",
        "Ebro Offensive",
        "Soldier",
        "Manhattan",
        "Georgic",
        "Belchite",
        "Quinto",
        "VAlB"
    ],
    "volunteer_fname": "Henry Harry",
    "volunteer_images": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "volunteer_lname": "Thomas",
    "year_published": 2024
}