{
    "class": "2023",
    "data": "<p>Alexander Adler was born to Jewish parents on July 24th, 1913. During his younger life, he spent 14 months in the United States Army, while also devoting time to attend classes in order to prepare for the entrance exam to the U.S. Military Academy at West Point. Ultimately, Adler passed the physical exam but failed the written exam by two credits in an elimination competition, causing him to leave the army in disappointment. After that, he decided to go to college, where he received a bachelors of science. Following his time in college, Adler became a high school physical education teacher, a career he held for seven years before leaving for Spain.<br />\r\n<br />\r\n<br />\r\nIn 1933, he joined the Communist Party, which he dropped out of in 1934 for eight to nine months and rejoined in early 1935. The Communist Party was very popular in New York City and members would organize mass meetings, promote unionization, and fight racism. At that time, Adler lived in the East Village of Manhattan, at 197 2nd Avenue. During the early 1930s, the East Village was home to the largest &ldquo;Hooverville&rdquo; in New York, which was self-governed. Adler would have only lived mere blocks away from it. In what was known as &ldquo;No Luck Town&rdquo;, talk of communism was strictly prohibited, but the actual neighborhood functioned very similarly to a socialist society, as food was shared amongst residents. Exposure to this would have provided an interesting perspective for a Communist like Adler. After war broke out in Spain, his experiences with the Communist Party and with life made him decide to take action.<br />\r\n<br />\r\n<br />\r\nOn March 10th, 1937, Adler sailed to Spain aboard the Queen Mary. He arrived on March 25th, where he was sent to train in Tarazona, which was known for its cold and miserable conditions. Despite that, he excelled and was appointed leader of his group while in training. However, he knew that his group was likely to be absorbed by the American Company, which was stationed there. Due to Adler&rsquo;s past experiences both with the army and with his job as a physical education teacher, he decided that he would be a valuable asset to the Republic if he were to learn proper military tactics. He proceeded to send a letter to request for transfer to the officer&rsquo;s training school at Albacete. It is probable that his request was denied, as he deserted soon after, likely frustrated as the situation somewhat mirrored his rejection from West Point.<br />\r\n<br />\r\n<br />\r\nWhile his time in the Spanish Civil War met its end before it began, Adler&rsquo;s military experiences were far from over. He served in the U.S. Army during World War II from January 8th, 1941 to October 11th, 1946. After his service, he led a quiet life until his death on April 25th, 1996 in Miami, Florida.<br />\r\n&nbsp;</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;Adler, Alexander.&rdquo; The Abraham Lincoln Brigade Archives, 24 May 2022, <a href=\"https://alba-valb.org/volunteers/alexander-adler/\">https://alba-valb.org/volunteers/alexander-adler/</a>.<br />\r\n<br />\r\n<br />\r\nAlexander Adler Document, n.d. <a href=\"https://sovdoc.rusarchives.ru/Final_s/KOMINT00910/DIR0004/IMG0072.JPG\">https://sovdoc.rusarchives.ru/Final_s/KOMINT00910/DIR0004/IMG0072.JPG</a>.<br />\r\n<br />\r\n<br />\r\nAlexander Adler Letter Pt. 1, n.d. <a href=\"https://sovdoc.rusarchives.ru/Final_s/KOMINT00910/DIR0004/IMG0073.JPG\">https://sovdoc.rusarchives.ru/Final_s/KOMINT00910/DIR0004/IMG0073.JPG</a>.<br />\r\n<br />\r\n<br />\r\nAlexander Adler Letter Pt. 2, n.d. <a href=\"https://sovdoc.rusarchives.ru/Final_s/KOMINT00910/DIR0004/IMG0074.JPG\">https://sovdoc.rusarchives.ru/Final_s/KOMINT00910/DIR0004/IMG0074.JPG</a>.<br />\r\n<br />\r\n<br />\r\nIsserman, Maurice. &ldquo;When New York City Was the Capital of American Communism.&rdquo; New York Times, 20 Oct. 2017, <a href=\"https://www.nytimes.com/2017/10/20/opinion/new-york-american-communism.html\">https://www.nytimes.com/2017/10/20/opinion/new-york-american-communism.html</a>.<br />\r\n<br />\r\n<br />\r\nKrom, Stephanie, et al. &ldquo;Hard Luck Town: A 1930s Shantytown in the East Village.&rdquo; Village Preservation, 19 May 2020, <a href=\"https://www.villagepreservation.org/2013/12/31/hard-luck-town-a-1930s-shantytown-in-the-east-village/\">https://www.villagepreservation.org/2013/12/31/hard-luck-town-a-1930s-shantytown-in-the-east-village/</a>.<br />\r\n<br />\r\n<br />\r\nMessick , Frederic M. &ldquo;International Brigades in the Spanish Civil War&rdquo;. Central Michigan University Scholarly &amp; Creative Works, 2013, <a href=\"https://scholarly.cmich.edu/?a=d&amp;d=CMUFac2013-01.1.30&amp;e=-------en-10--1--txt-txIN%7CtxAU%7CtxTI--------\">https://scholarly.cmich.edu/?a=d&amp;d=CMUFac2013-01.1.30&amp;e=-------en-10--1--txt-txIN%7CtxAU%7CtxTI--------</a>.</p>\r\n",
    "student_fname": "Lavender",
    "student_lname": "Reynolds",
    "tags": [
        "Deserter",
        "Member of Communist Party",
        "Teacher",
        "WWII Veteran",
        "Jewish",
        "Tarazona"
    ],
    "volunteer_fname": "Alexander",
    "volunteer_images": [],
    "volunteer_lname": "Adler"
}