{
    "class": 2023,
    "data": "<p>Yrjo Johannes Aalto also known as Yjro John Aalto was born January 27th, 1903 in Finland. The war of 1918 in Finland was the first time Aalto was given the opportunity to fight for what he believed in. The war was between white Finland, who opposed socialism, and Red Finland, who were for socialism and established it in some parts of the country. Aalto joined Red Finland, also known as the Finnish Socialist Workers’ Republic, and served in the Red Guards at 15 years old. Although Red Finland lost the war, it was likely that Aalto was pardoned like the majority of reds were in late 1918. <br /><br />In 1923 there was an especially large number of Finns immigrating to the United States, this fits into the time frame between 1918 and 1937 when he could have arrived in America. He became a permanent resident of NYC, he could have likely lived in Brooklyn’s “Finntown” as it was already home for over 10,000 Finns. Today this area is known as Sunset Park. Aalto was an unmarried seaman, which meant that he was a part of a boat’s crew. Most likely he worked on a merchant ship or a transportation ship that docked in New York Harbour. <br /><br />Even after all the years since the Finnish Civil War, Aalto still adamant about being Antifascist and boarded the Washington on July 28th, 1937 setting sail to Spain along with the other American volunteers who heard about Spain's need for international soldiers. Aalto was 34 years old which was unusual for a volunteer, because most were younger. This was most likely because of the ability to easily remove themselves from their life in America to fight in another country. Those passionate about the cause who were older could have had families and/or stable jobs thus would not have the privilege to leave to fight. Aalto was an unmarried seaman, so he likely did not have too many strings tying him down to life in America.<br /><br />Aalto served in the XV International Brigade, the official name for the Abraham Lincoln Brigade. Aalto was a part of the Machine Gun Company which was a unit that supported the main battalions with weaponry. After two months of training, in February the Brigade was put into battle very much unprepared. The XV International Brigade lost a large number of soldiers in the first fight, but Aalto survived. He then joined forces with the Mackenzie-Papineau BN which were a group of Canadians part of the XV International Brigade.<br /><br />At the Battle of the Elbro Aalto received citation for his conduct during battle. The nationalists managed to cause the republicans to disperse, the Lincoln Brigade was split. Aalto went to a hospital in Tarancón because he had unknown illnesses. Around this time there were outbreaks of typhoid, spotted fever, smallpox, and bacterial dysentery. After Aalto recovered he requested to transfer to the guerrillas who were small armed groups mostly active in mountain areas. Aalto attended training. He was then sent to Albacete, which was an entirely republican controlled region, where he awaited orders. There he got drunk and was jailed for intoxication. Then he was transferred again to the 129th BN established in 1937, which was a mixed brigade of international units and soldiers. It was also known as the Forty Nations Brigade. He returned to the front while he retreated with the XIII BDE. He deserted them to the XV BDE and rejoined the Canadian Mackenzie-Papineau BN.<br /><br />After the unit retreated Aalto attempted to get to Barcelona, but he was caught. Aalto was sent to Tarragona Camp which was a labor camp and prison. He witnessed the execution of three Finns, but was likely spared due to the sheer lack of soldiers on the Republic’s side. After May 1, 1938 he returned to the XV BDE which was likely due to the dire need for more soldiers on the losing Republic’s side. Then he spent 12 days in hospital due to stomach pains. Stomach pains were common during this period, especially for those at war because they can be caused by increased anxiety. He returned to the front and remained with Co. 2 until he was wounded in action on July 27, 1938. Finally he left Spain on October 19, 1938 with a group of 200 wounded veterans, and likely went back to New York.<br /></p>",
    "school_crests": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "sources": "<p>“Aalto, Yrjo Johan.” SIDBRINT. Accessed June 9, 2023. <a href=\"https://sidbrint.ub.edu/ca/content/aalto-yrjo-johan\">https://sidbrint.ub.edu/ca/content/aalto-yrjo-johan</a>. <br /><br />Ink, Social. “Aalto, Yrjo Johannes.” The Abraham Lincoln Brigade Archives, May 24, 2022. <a href=\"https://alba-valb.org/volunteers/yrjo-johannes-aalto/\">https://alba-valb.org/volunteers/yrjo-johannes-aalto/</a>. <br /><br />Archives, Gjenvick-Gjønvik Archives - GG. “New York Harbor - Pre World War II.” New York Harbor - Pre World War II | Ports of Call. Accessed June 9, 2023. <a href=\"http://www.ggarchives.com/OceanTravel/PortsOfCall/NewYork-PreWW2.html\">http://www.ggarchives.com/OceanTravel/PortsOfCall/NewYork-PreWW2.html</a>. <br /><br />“Background.” Royal Reds. Accessed June 9, 2023. <a href=\"http://royalreds.illume.fi/p/backround.html\">http://royalreds.illume.fi/p/backround.html</a>. <br /><br />“The Finns in America.” The Finns in America (European Reading Room, Library of Congress). Accessed June 9, 2023. <a href=\"http://www.loc.gov/rr/european/FinnsAmer/finchro.html\">http://www.loc.gov/rr/european/FinnsAmer/finchro.html</a>. <br /><br />Friends and veterans. Accessed June 9, 2023. <a href=\"http://www.macpapbattalion.ca/\">http://www.macpapbattalion.ca/</a>. <br /><br />(john@spartacus-educational.com), John Simkin. “Abraham Lincoln Battalion.” Spartacus Educational. Accessed June 9, 2023. <a href=\"https://spartacus-educational.com/SPlincoln.htm\">https://spartacus-educational.com/SPlincoln.htm</a>. <br />FM 3-12 cyberspace and Electromagnetic Warfare - Federation of American ... Accessed June 10, 2023. <a href=\"https://irp.fas.org/doddir/army/fm3-12.pdf\">https://irp.fas.org/doddir/army/fm3-12.pdf</a>. <br /><br />([email protected]), John Simkin. “Ebro.” Spartacus Educational. Accessed June 9, 2023. <a href=\"http://www.spartacus-educational.com/SPebro.htm\">http://www.spartacus-educational.com/SPebro.htm</a>. <br /><br />Lillo Espinosa, José Luis. “Crecimiento y Comportamiento En La Adolescencia.” Revista de la Asociación Española de Neuropsiquiatría. Accessed June 9, 2023. <br /><br /><a href=\"https://scielo.isciii.es/scielo.php?script=sci_arttext&pid=S0211-57352004000200005\">https://scielo.isciii.es/scielo.php?script=sci_arttext&pid=S0211-57352004000200005</a>. <br />“The Spanish Civil War (1936-1952): A Reinterpretation.” The Volunteer, August 26, 2019. <a href=\"https://albavolunteer.org/2019/08/the-spanish-civil-war-1936-1952-a-reinterpretation/\">https://albavolunteer.org/2019/08/the-spanish-civil-war-1936-1952-a-reinterpretation/</a>. <br /><br />“’ Work and Don’t Lose Hope’: Republican Forced Labour - JSTOR.” Jstor. Accessed June 10, 2023. <a href=\"https://www.jstor.org/stable/40542795\">https://www.jstor.org/stable/40542795</a>. <br /><br />Pike, John. “Military.” 129th Regiment - Regional Training Institute. Accessed June 9, 2023. <a href=\"http://www.globalsecurity.org/military/agency/army/129rti.htm\">http://www.globalsecurity.org/military/agency/army/129rti.htm</a>. <br /><br />Miller, Ian. “The Mind and Stomach at War: Stress and Abdominal Illness in Britain c.1939-1945.” Medical history, January 2010. <a href=\"http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2793144/\">http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2793144/</a>. <br /></p>",
    "student_fname": "Abigail",
    "student_lname": "Rees",
    "tags": [
        "Finnish",
        "Immigrant",
        "Injured",
        "Seaman",
        "Tarragona Camp",
        "Finnish Socialist Workers’ Republic",
        "Red Guard",
        "Battle of the Elbro",
        "Guerrilla",
        "Deserter"
    ],
    "volunteer_fname": "Yrjo Johannes",
    "volunteer_images": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "volunteer_lname": "Aalto",
    "year_published": 2023
}