{
    "class": 2024,
    "data": "<p>\tIrving William “Rappy” Rappaport was born on August 10th, 1910 in the Lower East side of Manhattan to a Jewish family. His father, Calvin, and his mother, Hilda, were born near Minsk, then part of Tsarist Russia, in the 1880s. As Russian Jews, Rappaport’s parents experienced and bore witness to extreme acts of antisemitism, including pogroms. Irving recalls his father saying that he formed a close bond with his brothers, as the boys helped protect each other from the violence. Calvin became a drummer in the Tsar’s Army for four years, but decided to flee to the US at the outbreak of the Russo-Japanese War.<br /><br />\tAt the age of five, the family moved to New Britain, Connecticut, where Calvin tried to get work as a carpenter. Mostly, Rappaport’s father had to support the family by peddling fruit, potatoes, ice, or “anything he could get his hands on” out of a horse drawn cart, with his only stable employment being in a factory during World War I. Like many of the other residents of New Britain, Calvin spoke Polish and Russian, with both him and his wife only able to speak poor English. On his childhood, Irving said “In spite of the fact that we were a poor family, it was a happy childhood.” Though he was a quiet child who liked to read and excelled in school, he was always surrounded by friends. <br /><br />The family moved back to New York City before Irving’s junior year of high school, settling down in East Brooklyn. Rappaport finished his high school education at Thomas Jefferson High School, where he met his lifelong friend Fred Solloway, who would later go with him to Spain. After graduation he briefly attended City College but had to drop out to help support his family. The family had to move to Browns Mills, New Jersey, which Irving described as “a step above the slums.” Irving worked from 7 am to 7 pm every weekday for ten dollars a week as a delivery boy for a grocery store. The store was part of a chain of over a dozen and a half locations, and Irving sought to unionize the stores for better wages. He came across the Food Workers Industrial Union, which turned out to be a left-wing union. Rappaport successfully unionized the grocery store he worked at, making it the first grocery store in New York City to do so. Through this success he earned a seat on the union’s executive board, where he became more politicized. A friend took him to left-wing and socialist meetings, where he learned about Spain. Rappaport immediately decided to volunteer, and convinced his parents that he was leaving to attend an international meeting for union leaders in Paris. In December of 1936, Irving applied for a passport and embarked for France on the ship Paris.<br /><br />Rappaport arrived in Le Havre in January of 1937, and his group set south for Spain. Perpignan was the last stop before the border, with Rappaport recounting that “Everybody and his uncle knew that we were heading for Spain in that part of France.” The group encountered no trouble at the border, unlike later groups of volunteers who were forced to climb the Pyrenees Mountains. The volunteers spent their first night in Spain in the Catalan town of Figueres, before proceeding to Villanueva de la Jara. There the men trained, being taught to march and drill. In Albacete the men were issued rifles for the first time. Irving had fallen ill and so had been driven by hospital truck to Albacete. After receiving his rifle and reporting to his unit (A hand-written roster dated on or before February 15th indicates that Irving Rappaport was assigned to Section 1 of Company 2 of the Abraham Lincoln Battalion) he was supposed to return to the truck, but decided to stay with his section to go to the front. This decision would save his life. As the column of men approached the front, they were harassed by fascist aircraft. The trucks scattered to avoid the barrage, and in the confusion three trucks, including the one Rappaport had been assigned to, took a wrong turn into fascist lines and were never heard from again.<br /><br />Upon arriving at the front in Jarama, Rappaport and his fellow volunteers were immediately bombarded by aircraft and artillery, and so had to quickly dig trenches. On February 27th, the order was given to go over the top. The Army had promised armored and aerial support, none of which came. Irving recalls how he and his comrades were immediately pinned down by crossfire from multiple fascist pillboxes. “I heard guys getting hit all over, guys who were hit in the stomach were bleeding to death, begging to be killed.” He scrambled to find cover behind a tree, where he stayed for hours, as ricocheting bullets hit against his helmet. A fellow volunteer named Abe Scullock crawled up next to him and was shot in the rear. Finally, it began to rain, and the two men crawled back to the trenches. Rappaport was at Jarama for a total of four months before he fell ill and was diagnosed with colitis. He continued to work for the Republic for a time as a censor, reading and censoring letters written home by his fellow volunteers. In September of 1937 he was sent home on the De Grasse. Rappaport passed through Paris on his way to the De Grasse in Le Havre, and had the opportunity to attend the 1937 World Fair. This was the same fair where Pablo Picasso’s mural Guernica was first exhibited, meaning that Rappaport may have seen the single most well known work of art that came out of the Spanish Civil War on his way back home from fighting in the conflict.<br /><br />Upon returning to the US Irving continued to work in the union, and in May of 1939 married his wife Florence. The same year, Rappaport was called up for the draft but declared 4F because of his colitis. He was called up again in 1942, but was this time approved for service. When reporting for assignment, Rappaport was given the chance to stay home because of his pregnant wife, but chose to serve his country. He was initially assigned to be an infantryman in the Army’s First Infantry Division, but was transferred to the intelligence service and later the Medical Corps because of his colitis. Irving was sent to India where he helped to care for pilots who flew over the Himalayan Mountains in Burma. In all he spent a year in India, and returned home after the Japanese surrender.<br /><br />After returning home a second time, Rappaport decided to go into business on his own, borrowing money to open his own grocery store. Rappaport returned to Spain for the fiftieth anniversary of the start of the Spanish Civil War, and was interviewed on his wartime experience shortly thereafter. He recalled how during the trip back to Spain, one of his fellow volunteers walked into a drug store wearing a pin that signified his status as a veteran of the Abraham Lincoln Brigade. Seeing the pin, the store clerk told the man to leave before he cut his throat. Despite this, Rappaport still said “I don’t regret one moment of it. I still find that it’s just a separate part of my life that I felt I did something worth doing. I still feel the same way as I did then as an anti fascist. I’m glad to be alive, to have lived fifty years, to go back to Spain to see at least it was a worthwhile fight.”<br /><br />\tRappaport had two daughters, and was buried in Florida National Cemetery up on his death on January 17th, 2007.<br /></p>",
    "school_crests": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "sources": "<p>Harriman, Manny. 1987. “Rappaport, Irving William Interview, Jan 27, 1987.” Videocassette. Findingaids.library.nyu.edu.<br />“Rappoport, Israel Irving William.” 2019. The Abraham Lincoln Brigade Archives. December 11, 2019. <a href=\"https://alba-valb.org/volunteers/israel-irving-william-rappaport/\">https://alba-valb.org/volunteers/israel-irving-william-rappaport/</a>.<br /></p>",
    "student_fname": "Aristotle",
    "student_lname": "Miller",
    "tags": [
        "Food Workers Industrial Union",
        "US Army",
        "Jewish",
        "Jarama",
        "WWII Veteran"
    ],
    "volunteer_fname": "Irving William",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1i2HbN1Czbr09xoKhJmkqx4iYorvmIhxe",
            "src": ""
        }
    ],
    "volunteer_lname": "Rappaport",
    "year_published": 2024
}