{
    "class": 2025,
    "data": "<p>Born on February 8, 1912, in the Bronx, Jim (Jacob) Persoff was the son of an Ashkenazic couple. His father, Israel Persoff, immigrated from Russia to Palestine and later to the U.S. In around 1920, Persoff’s mother developed schizophrenia and was admitted to the Manhattan State Hospital. As a result, Persoff and his younger sister were placed in the Hebrew Orphan Asylum, but since it was close enough to their home address, they went home on the weekends. As he grew up, he graduated from De Witt Clinton High School before taking classes at CCNY at night. Persoff never graduated from CCNY, only studying in college for two years. His interests included photography, jewelry engraving, and painting. Following his college career, he got a job as a photographer, working for Cinema Operators. <br /><br />However, this period was short-lived because a few years later, 25-year-old Jacob Persoff decided to fight for the Republic. Through the Communist Party, which he had been affiliated with since 1935, he boarded the Aquitania on January 28, 1937, just eleven days short of his 26th birthday. Before setting sail, he had to apply for a passport, and he received it on January 21, 1937, on which his address was 1350 Findley Avenue, Bronx, NY. <br /><br />After the Aquitania reached France, he and fellow volunteers made their trek to Spain, enduring harsh conditions as they traveled on foot past the Pyrenees Mountains, finally stepping on Spanish soil seven days after first boarding the Aquitania. Upon joining the Republican Army, he was assigned to the 14th Battery Anti-Aircraft DECA, specifically to the Thaelmann Battalion, a German-speaking unit. He first worked as a part of the Telephone Section, handling communication and messages, before he served on the plotter table, partaking in battles. He also took part in the creation of the 14th Battery’s Newspaper called “Der Tisch Bleibt” (The Table Remains) by creating many of the illustrations in the paper. During his service of two years, he obtained the rank of Cabo. However, he was forced to leave Spain on February 9, 1939, on the Queen Mary. <br /><br />Even upon his return, he did not have time to relax, as that same year, he was drafted into WWII, serving for another six years. After he completed eight years of military service in both the Spanish Civil War and WWII, he immersed himself into art again, picking up various jobs ranging from union organizer, jewelry engraver, and painter. He continued to lead a peaceful life, marrying a nurse and residing in the Bronx with his wife and three kids: Peter Persoff, Ann Persoff, and Evelyn Persoff. He soon moved to an apartment complex in Queens reserved for veterans, continuing to pursue his love for the arts. He passed away on August 7, 1989, having shared his experiences not just through interviews but also through his writing and art. <br /></p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1LNKdK_rOZSyQRDJxu_v-sAhGsNSnPCnz, https://drive.google.com/open?id=1lkH5_x9QOjIphzU_uj0F8a0ldewCfcsS",
            "src": ""
        }
    ],
    "sources": "<p>Persoff, Peter. “Jews in Irish Music—Peter Persoff.” Riggy. Accessed May 1, 2024. <br />\t<a href=\"https://riggy.com/jews-in-irish-music-peter-persoff/\">https://riggy.com/jews-in-irish-music-peter-persoff/</a>.<br /><br /><br />Persoff, Jacob. “The Noblest Fruit of Them All.” The Volunteer, Volume 3, No. 5, 1981. <br /><br /><br />Martens, Gustav. “Minne Fran Spainen.” Gustav Martens. Accessed May 3, 2024. <br />\t<a href=\"https://gustavmartens.weebly.com/\">https://gustavmartens.weebly.com/</a>.<br /><br /><br />Abraham Lincoln Brigade Archives. “Persoff, Jim.” ALBA. Accessed April 26,2024. <br />\t<a href=\"https://alba-valb.org/volunteers/jim-persoff/\">https://alba-valb.org/volunteers/jim-persoff/</a>.<br /><br /><br />Tsou, Len, and Tsou, Hwei Ru. Los Brigadistas Chinos en La Guerra Civil: La llamada de España (1936-1939). Spain: Los Libros de la Catarata, May 9, 2013. <br /><br /><br />Peter Persoff, Email message to author, May 1, 2024 - June 7, 2024. <br /><br /><br />Universitat de Barcelona. “Persoff, Jim.” Sidbrint. Accessed May 2, 2024. <br />\t<a href=\"https://sidbrint.ub.edu/en/content/persoff-jim\">https://sidbrint.ub.edu/en/content/persoff-jim</a>. <br /></p>",
    "student_fname": "Nordel Wangsel",
    "student_lname": "Delma",
    "tags": [
        "De Witt Clinton High School",
        "Writer",
        "Illustrator",
        "German-speaking unit",
        "WW2",
        "Painter",
        "Photographer",
        "Thaelmann Batallion",
        "CCNY"
    ],
    "volunteer_fname": "Jacob",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=11E2zr4G-B2VwaJR9q5E2ahpMdiWGgYrr, https://drive.google.com/open?id=1DZaA7YNFyR-39tV8OQIUzgxpwEN2ye43",
            "src": ""
        }
    ],
    "volunteer_lname": "Persoff",
    "year_published": 2024
}