{
    "class": 2024,
    "data": "<p>Charles Roth was born on April 12, 1916, in New York. Roth's family was of Jewish heritage and migrated from Austria to New York, making him part of the significant influx of immigrants from southern and eastern Europe during the early 20th century, many of whom entered through Ellis Island. His family settled in Brighton Beach, Brooklyn, a community with a large Jewish population.<br /><br />After completing 2.5 years of college education, Roth found his calling in radio engineering, a field that beckoned to the future with its promises of technological advancement. However, his journey took a political turn when he became involved with the Young Communist League, the youth branch of the Communist Party of the United States of America, drawn to its ideals of social justice and equality. Due to the party’s disdain for fascism, Roth was likely influenced to serve in Spain to fight against such ideologies.<br /><br />On May 15, 1937, Roth left for Spain aboard the Georgic. Yet, his passage was marred by peril when his ship fell victim to a German submarine attack, forcing him to swim 200 meters ashore under enemy machine gun fire, a harrowing ordeal that tested his resolve.<br /><br />Arriving in Spain via LLansa on June 1, 1937, Roth first served in the Battle of Brunete. This battle, which took place in July 1937, was one of the most significant engagements of the Spanish Civil War. The Republican forces initially captured Brunete, aiming to relieve pressure on Madrid and disrupt Nationalist lines. Roth likely participated in this initial promising phase. However, the battle soon turned grim as the Nationalist forces counterattacked fiercely, resulting in heavy casualties and the eventual recapture of the territory by Franco's troops. The brutal fighting and harsh conditions would have provided Roth with a sobering introduction to the realities of war.<br /><br />In 1938, Roth served at the Battle of Teruel. This battle was marked by some of the harshest winter conditions of the war, with temperatures plunging below freezing. The Republicans initially captured Teruel in December 1937, a rare success that boosted morale. However, the Nationalists launched a relentless counteroffensive in January 1938. The intense cold, coupled with heavy snow, created dire conditions for both sides. It was during this grueling period that Roth likely contracted rheumatic fever, a serious illness exacerbated by the freezing temperatures and inadequate medical facilities. His evacuation from the front lines to the Villa Paz IB Hospital near Madrid was a necessary measure to save his life.<br /><br />After returning to the United States on July 2, 1938, aboard the President Harding, he met his future wife, Harriet Roth. He died on June 3, 1966, in Los Angeles, California.</p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1OhRcFhkdSxNe3i7twHfS9ExM20NYQJ2c",
            "src": ""
        }
    ],
    "sources": "<p>Jewish Virtual Library. \"Jews Who Served in the International Brigade in the Spanish Civil War.\" Accessed June 7, 2024. <a href=\"https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war\">https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war</a>.<br /><br />Abraham Lincoln Brigade Archives. \"Charles Roth.\" Accessed June 7, 2024. <a href=\"https://alba-valb.org/volunteers/charles-roth/\">https://alba-valb.org/volunteers/charles-roth/</a>.<br /><br />New York University Tamiment Library & Robert F. Wagner Labor Archives. \"Guide to the Spanish Civil War Collection ALBA.VF.002.\" Accessed June 7, 2024. <a href=\"https://findingaids.library.nyu.edu/tamwag/alba_vf_002/contents/aspace_ref1234/#aspace_ref2142\">https://findingaids.library.nyu.edu/tamwag/alba_vf_002/contents/aspace_ref1234/#aspace_ref2142</a>.<br /><br />Find A Grave. \"Hyman Roth.\" Accessed June 7, 2024. <a href=\"https://www.findagrave.com/memorial/78052379/hyman-roth/photo\">https://www.findagrave.com/memorial/78052379/hyman-roth/photo</a>.<br /><br />New York City Municipal Archives. \"Death Certificate of Hyman Roth.\" Accessed June 7, 2024. <a href=\"https://a860-historicalvitalrecords.nyc.gov/view/6954001\">https://a860-historicalvitalrecords.nyc.gov/view/6954001</a>.<br /><br />FamilySearch. \"Hyman Roth, 1940 United States Census.\" Accessed June 7, 2024. <a href=\"https://www.familysearch.org/ark:/61903/1:1:QGJ4-94LM\">https://www.familysearch.org/ark:/61903/1:1:QGJ4-94LM</a>.<br /><br />FamilySearch. \"Hyman Roth, New York City Marriage Records, 1829-1940.\" Accessed June 7, 2024. <a href=\"https://www.familysearch.org/ark:/61903/1:1:VGRG-R8X.</p>\">https://www.familysearch.org/ark:/61903/1:1:VGRG-R8X.</p></a>",
    "student_fname": "Aiden",
    "student_lname": "Tan",
    "tags": [
        "Ellis Island",
        "Communist Party",
        "Radio Engineer",
        "rheumatic Fever",
        "Villa Paz IB Hospital",
        "Battle of Teruel",
        "Brunete Offensive",
        "Jewish",
        "Los Angeles",
        "Brooklyn",
        "Young Communist League"
    ],
    "volunteer_fname": "Charles",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1KzFtqpsVZeOOOkZPfHZlSNp9QO6lRXix",
            "src": ""
        }
    ],
    "volunteer_lname": "Roth",
    "year_published": 2024
}