{
    "class": "2021",
    "data": "<p>Jacob Louis Teiger, who also went by Jack, Jake, Jakob, etc., was born on February 6. 1914 in Brooklyn, New York to Samuel Teiger and Sylvia Teiger. Teiger, who was of Jewish descent, only received a year of a high school education, becoming a dental technician and a hatter afterward.</p>\r\n\r\n<p>On April 23, 1937, he received his passport, and on May 8th of that year, Jacob Teiger was onboard the American Importer as a volunteer in the Spanish Civil War. He arrived in Spain after crossing the Pyrenes Mountains through what is called the Massanet route. He served as a part of the Mackenzie-Papineau Battalion, the XV International Brigade (in which the Lincoln Battalion was a part of), the Lincoln-Washington Battalion, and the Lincoln Battalion Co.2, serving in the Lincoln Battalion and the Mackenzie-Papineau Battalion from August 1937 to December 1938.</p>\r\n\r\n<p>During his time as a volunteer, he was shot in the left leg and received shrapnel in his right. Although he recovered, the damp weather did not favor him, frequently bothering him and eventually permanently disqualified him from service when he served in World War II. He was also admitted into the Farners de la Selva Hospital on September 14. 1938 for a wounded hand, which caused him to miss the parade in Barcelona.&nbsp;</p>\r\n\r\n<p>Teiger was involved in the Battle of Ebro, where he was dive-bombed and was torpedoed. Teiger remembers being with a Lopez from San Francisco at the time and credits them both in straightening the rest of the group out after the torpedo had killed eight and injured 10.</p>\r\n\r\n<p>Teiger&rsquo;s comrades seemed to have varying opinions of Teiger. Some claimed that he got along well with his fellow volunteers. Others said that he was vicious and slanderous towards his uppers. The latter at the least seems likely as Teiger, who was adamant in his political beliefs and was willing to get into arguments about his beliefs. Teiger was a Communist, a member of the Communist Party and the Young Communist League, and heavily disliked liberals and Trotskyites.</p>\r\n\r\n<p>He returned back to the United States on September 24, 1942 onboard the Ausonia, after which he enlisted in World War II and worked as a guard and, much to his chagrin, a truck driver.</p>\r\n\r\n<p>Perhaps due to communist affiliations, Teiger was put on the list of hearings by the Subcommittee to Investigate the Administration of the Internal Security Act and Other Internal Security Laws on the Judiciary United States Senate.</p>\r\n\r\n<p>He married &ldquo;Sara&rdquo; Savilla Cogswell in 1945 and died on August 23, 1976, in Baltimore. Cogswell, however, attended Abraham Lincoln Brigade reunions after Teiger&#39;s death with her husband and stepson.</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo;Guide to the Veterans of the Abraham Lincoln Brigade Photograph Collection ALBA.PHOTO.015.&rdquo; Digital Library Technology Services &ndash; A Unit of NYU Libraries and NYU IT, <a href=\"http://dlib.nyu.edu/findingaids/html/tamwag/alba_photo_015/dscref14.html\" target=\"_blank\">http://dlib.nyu.edu/findingaids/html/tamwag/alba_photo_015/dscref14.html</a>.</p>\r\n\r\n<p>&ldquo;Jacob Teiger (1914-1976) - Find A Grave Memorial.&rdquo; Find A Grave - Millions of Cemetery Records, <a href=\"https://www.findagrave.com/memorial/151964000/jacob-teiger\" target=\"_blank\">https://www.findagrave.com/memorial/151964000/jacob-teiger</a>.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Schmerler, Gil. &quot;Re: Research Project Potential Request.&quot; Received by Christine Chang, 29 Apr. 2021</p>\r\n\r\n<p>&ldquo;TEIGER, Jacob Louis | SIDBRINT.&rdquo; Sidbrint | SIDBRINT, <a href=\"http://sidbrint.ub.edu/ca/content/teiger-jacob-louis\" target=\"_blank\">http://sidbrint.ub.edu/ca/content/teiger-jacob-louis</a>.</p>\r\n\r\n<p>&ldquo;Teiger, Jacob Louis | The Abraham Lincoln Brigade Archives.&rdquo; The Abraham Lincoln Brigade Archives, 11 Dec. 2019, <a href=\"https://alba-valb.org/volunteers/jacob-louis-teiger/\" target=\"_blank\">https://alba-valb.org/volunteers/jacob-louis-teiger/</a>.</p>\r\n\r\n<p>&ldquo;Документы Советской Эпохи: Просмотр Единицы Хранения.&rdquo; Документы Советской Эпохи: Главная, <a href=\"http://sovdoc.rusarchives.ru/sections/organizations//cards/94999/childs\" target=\"_blank\">http://sovdoc.rusarchives.ru/sections/organizations//cards/94999/childs</a>.</p>\r\n",
    "student_fname": "Christine",
    "student_lname": "Chang",
    "tags": [
        "Member Of Communist Party",
        "Ebro Offensive",
        "Jewish",
        "WWII Veteran",
        "Young Communist League",
        "Farners de la Selva Hospital"
    ],
    "volunteer_fname": "Jacob",
    "volunteer_images": [],
    "volunteer_lname": "Tieger"
}