{
    "class": "2021",
    "data": "<p>Stephen Zak was born to Thomas and Pauline Zak on September 19, 1916. He went to Technical/Trade School for six years, and, at the age of 16, Stephen joined the Young Communist League in 1932.&nbsp; The Communist League, which was initially founded in 1920, was said to develop its members into Communists, through studying Marxism&ndash;Leninism and through active participation in the struggles of the American working class.&nbsp; Only 5 years later, Stephen joined the Communist Party, in January 1937.&nbsp; The Communist Party, was a political party organized to <a href=\"https://www.merriam-webster.com/dictionary/facilitate\" target=\"_blank\">facilitate</a> the transition of society from <a href=\"https://www.britannica.com/topic/capitalism\" target=\"_blank\">capitalism</a> through <a href=\"https://www.britannica.com/topic/socialism\" target=\"_blank\">socialism</a> to <a href=\"https://www.britannica.com/topic/communism\" target=\"_blank\">communism</a>. During this time in the Communist Party, he was a member of the syndicats, but was mostly a part of the militia wing of the organization. He took part in several demonstrations for work and social aid, and strikes for better factory conditions.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>He briefly worked in a sugar factory that employed eight hundred people. New York City was once the sugar capital of the world. The ports and piers of New York, specifically those in Brooklyn, made this kingdom of sugar possible. Sugar was big business, and Brooklyn&rsquo;s sugar barons were some of the city&rsquo;s wealthiest men. Raw cane was shipped from tropical countries around the world, offloaded into warehouses and processed here. The refineries extracted the sugar in various forms, and the goods were further packaged and distributed across the nation.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Prior to going to Spain to fight in the Civil War, Stephen had completed three years of service in the US Army, in the New York National Guard. He was part of the 71st Infantry, where he worked in the engineering office with two hundred people, making twenty-four dollars a week, which is the equivalent of $363.45 today. He joined the Federation of Architects, Engineers, Chemists and Technicians, which was a part of the CIO, the Congress of Industrial Organizations. During the 1930s, as unemployment among architects and draftsmen in the United States reached 90 percent or more, practitioners joined with other technical workers to form the Federation of Architects, Engineers, Chemists and Technicians (FAECT).&nbsp; From 1933 until after World War II, the FAECT served as a trade union and activist organization for the purpose of securing higher wages, employment benefits, and labor rights.&nbsp; During this time he lived at 113 East 3rd Street and 1st Avenue, NYC.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>As he prepared to go to Spain, he received his passport, # 466079, on July 30, 1937.&nbsp; Stephen left for Spain, shortly afterwards, in August, 1937. He set sail aboard the <em>Queen Mary</em> on the 11th of the month. The construction of the Queen Mary ship began with a design completed in 1928, and while the actual building started in 1930, work was suspended several times and was finally completed in March of 1936.&nbsp;&nbsp;&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>On August 21, Zak arrived in Espolla, which is in Catalonia, Spain. After about five weeks, he joined the 15th Brigade of the Lincoln-Washington Battalion, and he was a member of Company 3. This lasted from October to December 7th, 1937, at which point, he changed companies. He moved from Company 3 to the Brigade MG Company, where he remained until March 12, 1938. After only a week with his new company, he took part in the Battle of Teruel which was a grueling struggle in which the Republican Army was able to kill around 57,000 Nationalist Rebels, but as many as 85,000 Republicans died, and to make matters worse, the battle ended with the Nationalists in control of the battlefield.</p>\r\n\r\n<p>On March 12, he moved to the Mackenzie-Papineau Battalion, until July 6, 1938. From July 6, to when he left Spain on December 20, 1938, he was a member of the 35th Division, Special MG Battalion, with whom he fought at the Battle of Fuentes de Ebro, which included the retreats and the Ebro Offensive, where, even though many of his friends within the battalion died in the attempt to claim victory, the Republican Army was decisively defeated and the territory loyal to the Spanish Republic was split in two. He returned to the US aboard the <em>Ausonia</em>. In 1939 RMS Ausonia was requisitioned by the Admiralty at the outbreak of World War II to serve as an armed merchant cruiser.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Following the war, Stephen Zak had a fairly quiet life, he married Rhoda Loesberg, who was born on 13 July 1911. Her father, Abraham Paul Loesberg, was 27 and her mother, Esther Loesberg, was 25 at the time she was born.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Stephen and Rhoda had a daughter, Linda Jane Zak Weintraub, born in 1942 in New York. Linda married Jerome M Weinraub, who was a Physician, Licence # 118903. They married in 1968, when Linda was 25 years old.&nbsp; She died at the young age of 43, in 1986.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Stephen Zak died 5 years after his daughter, in July 1991.</p>\r\n",
    "school_crests": [],
    "sources": "<p>&ldquo; Soviet-Era Documents: View Storage Unit.&rdquo; Документы советской эпохи: Просмотр единицы хранения. Accessed April 20, 2021. <a href=\"http://sovdoc.rusarchives.ru/sections/organizations//cards/234697/images\" target=\"_blank\">http://sovdoc.rusarchives.ru/sections/organizations//cards/234697/images</a>.</p>\r\n\r\n<p>&ldquo;Ausonia.&rdquo; HMS Ausonia, December 31, 2017. <a href=\"http://hmsausonia.co.uk/history/cunard-a-class-ships/ausonia/\" target=\"_blank\">http://hmsausonia.co.uk/history/cunard-a-class-ships/ausonia/</a>.</p>\r\n\r\n<p>Bacon, Mardges. &ldquo;The Federation of Architects, Engineers, Chemists and Technicians (FAECT):The Politics and Social Practice of Labor.&rdquo; University of California Press. University of California Press, December 1, 2017. <a href=\"https://online.ucpress.edu/jsah/article-abstract/76/4/454/61310/The-Federation-of-Architects-Engineers-Chemists?redirectedFrom=fulltext\" target=\"_blank\">https://online.ucpress.edu/jsah/article-abstract/76/4/454/61310/The-Federation-of-Architects-Engineers-Chemists?redirectedFrom=fulltext</a>.</p>\r\n\r\n<p>Ink, Social. &ldquo;Zak, Stephen.&rdquo; The Abraham Lincoln Brigade Archives, May 14, 2020. <a href=\"https://alba-valb.org/volunteers/stephen-zak/\" target=\"_blank\">https://alba-valb.org/volunteers/stephen-zak/</a>.</p>\r\n\r\n<p>&ldquo;Master Copy.&rdquo; spanjews.pdf. Accessed April 25, 2021. <a href=\"https://www.marxists.org/subject/jewish/spanjews.pdf\" target=\"_blank\">https://www.marxists.org/subject/jewish/spanjews.pdf</a>.</p>\r\n\r\n<p>&ldquo;New York Guard History.&rdquo; New York State Division of Military and Naval Affairs. Accessed April 29, 2021. <a href=\"https://dmna.ny.gov/nyg/?id=history\" target=\"_blank\">https://dmna.ny.gov/nyg/?id=history</a>.</p>\r\n\r\n<p>O&#39;Connell, Gregory. &ldquo;The Story of Revere Sugar in Red Hook and the Rise and Fall of Big Sugar in Brooklyn.&rdquo; Red Hook Waterfront Brooklyn NYC, June 3, 2019. <a href=\"https://redhookwaterfront.com/2018/12/the-story-of-revere-sugar-in-red-hook-and-the-rise-and-fall-of-big-sugar-in-brooklyn/\" target=\"_blank\">https://redhookwaterfront.com/2018/12/the-story-of-revere-sugar-in-red-hook-and-the-rise-and-fall-of-big-sugar-in-brooklyn/</a>.</p>\r\n\r\n<p>&ldquo;RMS Queen Mary 1 Ship- History and Facts.&rdquo; RMS Queen Mary 2 Cruises, November 29, 2015. <a href=\"http://www.queenmarycruises.net/queen-mary-ship/\" target=\"_blank\">http://www.queenmarycruises.net/queen-mary-ship/</a>.&nbsp;</p>\r\n",
    "student_fname": "Miles",
    "student_lname": "Davies",
    "tags": [
        "FAECT",
        "Jewish",
        "Member Of Communist Party",
        "Young Communist League",
        "Mackenzie–Papineau Battalion",
        "Ebro Offensive",
        "Battle For Teruel"
    ],
    "volunteer_fname": "Stephen",
    "volunteer_images": [],
    "volunteer_lname": "Zak"
}