{
    "class": 2025,
    "data": "<p>Morris White, more commonly known as Milton White, was born on April 1, 1917, in Cleveland, Ohio, to Russian-born father Ephim “Hyman” White and mother Tanya White. The White family moved to Brooklyn, New York City when Milton was just a few years old, a move done years before Milton’s sister, Lenora Marcia White, was born (1929). During their time in NYC, both Ephim and Tanya White joined the Communist Party of the United States of America and became active members of it, likely influencing Milton’s political affiliations as he too would go on to become a member of said party. <br /><br />Milton devoted much of his early life to the Communist Party and fighting for the rights of workers. This devotion included taking an active role in workers’ rights-related organizations such as the Young Communist League and the International Workers Order, as well as the National Theater League, a commitment more directly related to his early career as an actor and musician. Much of his activism occurred while he was a student at New York University, which he was admitted to in 1936. This activist background likely led him to sympathize with the fight against fascism the Spanish Republic was undertaking in Spain, leading him to file for a passport shortly after the creation of the Abraham Lincoln Brigade in early 1937, which he received on March 16, 1937, with the number 375434 to his address of 1491 Lincoln Place, Brooklyn, New York. <br /><br />On March 27, 1937, Milton set sail for Spain aboard the Paris, arriving on April 7, 1937. Milton initially served with the Sanitario, stated to be Red Cross staff, in the small town of Tarazona, before being moved up to the front lines in December 1937. On February 14, 1938, Milton was wounded-in-action in the municipality of Seguro de los Baños after fighting in the Battle of Teruel. After his recovery, Milton was put into Company 1 of the primarily Canadian MacKenzie-Papineau Battalion, in which he served primarily as a rifleman. After recovering from a second shrapnel-related combat injury on July 26, 1938, he served in the municipality of Caldas de Malavella, then the town of Mataró, and then finally the city of Vic by the end of his time in Spain. <br /><br />While not fighting on the front lines, Milton kept an extensive diary and collection of letters, writings, and documents, many of which can be found in New York University’s Tamiment Library. Milton’s collection of documents included a membership card of the Associació D’Amics de la Unió Soviètica, or the International Association of Friends of the Soviet Union; a similar card of the Socors Roig de Catalunya, a Catalan communist organization commonly affiliated with the International Brigades; and an array of cutouts of text and images from communist newspapers that detailed a positive perspective on the reality of life in the Soviet Union. <br /><br />Milton also wrote and kept his own works, which included poems, monologues, songs, and more that reflected his impressions and experiences while living in Spain. In one piece in particular, labeled “A Catalonian Mother”, Milton describes the treacherous lives of mothers and their children during the Spanish Civil War, displaying the resilience of these Spanish mothers despite the suffering they endured. <br /><br />His time in Spain came to an end when all International Brigade soldiers were told to leave the country toward the end of 1938, and on December 20, 1938, Milton returned to the United States aboard the Ausonia. Upon arriving back, Milton resumed his musical career, and on December 15, 1939, he married Miriam Lifschitz and shortly after had two daughters by the names of Judith and Jo Anne. His rest was brief, however, as he was drawn to another fight and enlisted in the U.S. Army to serve in WWII beginning on March 27, 1945, where he served as a U.S. Army Private. A year later on July 29, 1946, Milton was released, with his last role in the force being in the Miami field office of the Military Intelligence Division. <br /><br />In 1965, Milton divorced Miriam and later married Gloria Mandels Osterberg, with whom he had his son Howard. Before his eventual death at age 66 on June 18, 1983, in Woodmere, Nassau County, New York, Milton lived his life continuing his career as a musician, often playing his Spanish guitar, as well as being actively involved in the Veterans of the Abraham Lincoln Brigade (for the first few years after the war) and the Communist Party of America.</p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1cCJh9RNt4nqx6rBlDUdGZq4b5eG4SwlI, https://drive.google.com/open?id=1BwzFLGuBgemoX3CI1gMkx-zli7-phc9G, https://drive.google.com/open?id=1ID10rEgc5mdc-tiiE0HuIxuvBqM7RKnl",
            "src": ""
        }
    ],
    "sources": "<p>Baldwin, Jerome. “Canadians in Spain: The Mackenzie-Papineau Battalion.” Warfare History Network, October 2009. <a href=\"https://warfarehistorynetwork.com/article/mackenzie-papineau-battalion/\">https://warfarehistorynetwork.com/article/mackenzie-papineau-battalion/</a>.<br /><br />Fernández, James D. “Treasures from the Archives (2): Pre-Mature Americans.” albavolunteer.org, March 31, 2011. <a href=\"https://albavolunteer.org/2011/03/treasures-from-the-archives-2-milton-white/\">https://albavolunteer.org/2011/03/treasures-from-the-archives-2-milton-white/</a>.<br /><br />Molina, Rose. “Volunteer Milton Morris White.” Narrating Memory, December 18, 2020. <a href=\"https://narratingmemory.com/index.php/2020/12/18/volunteer-milton-morris-white-by-rose-molina-gonzalez/\">https://narratingmemory.com/index.php/2020/12/18/volunteer-milton-morris-white-by-rose-molina-gonzalez/</a>.<br /><br />\"The Milton White Files.\" NYU Tamiment Library, NY, NY <br /><br />The Abraham Lincoln Brigade Archives. “White, Milton,” December 11, 2019. <a href=\"https://alba-valb.org/volunteers/milton-white/\">https://alba-valb.org/volunteers/milton-white/</a>.<br /><br />www.marxisthistory.org. “Young Communist League/Young Workers’ League (1921-1946),” n.d. <a href=\"http://www.marxisthistory.org/subject/usa/eam/ycleague.html.</p>\">http://www.marxisthistory.org/subject/usa/eam/ycleague.html.</p></a>",
    "student_fname": "Alexander",
    "student_lname": "Panas",
    "tags": [
        "Russian",
        "Mataró",
        "International Association of Friends of the Soviet Union",
        "Ausonia",
        "New York University",
        "National Theater League",
        "Caldas de Malavella",
        "Teruel",
        "Member of Communist Party",
        "International Workers' Order",
        "MacKenzie-Papineau Battalion",
        "Socors Roig de Catalunya",
        "WWII Veteran",
        "Young Communist League"
    ],
    "volunteer_fname": "Morris \"Milton\"",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1sbXW4NGNC1kBLf4-RmrzTijY-va4FrqK",
            "src": ""
        }
    ],
    "volunteer_lname": "White",
    "year_published": 2024
}