{
    "class": "2025",
    "data": "<p>Servando Acevedo Mondragon was born on October 23, 1895 in Massin, Leyte, Philippines. It is unknown exactly when he immigrated to the US. Mondragon would become a member of the communist party in 1931, after the establishment of the Partido Komunista ng Pilipinas in 1930, more commonly referred to as the Philippine Communist Party. From his July 12, 1937 passport, Mondragon was part of the mass migration of Filipinos at the start of the century. The migration resulted from the Spanish-American War, which saw the US acquiring the Philippines in 1898. In the bustling cities of America, Mondragon found opportunity in the roles of a seaman and carpenter, professions in high demand amidst the rapid urbanization. He resided at 134 Columbia Street, Brooklyn, NY, an unconventional choice as most Filipinos chose to reside in Queens. A reason for his decision likely was his profession as a seaman, which had more benefits in Brooklyn. With extensive port facilities like the Brooklyn Navy Yard, its proximity to Manhattan, and Brooklyn&rsquo;s history as a maritime center, living in Brooklyn as a sailor was a perfect fit for Mondragon. With Filipinos having a reputation for their hard-working demeanor, Mondragon&rsquo;s eventual choice to volunteer for the International Brigades would be of little shock.<br />\r\n<br />\r\nBeing a communist and witnessing the events in Spain, his allegiance to leftist ideals likely stirred his conscience as he saw the tumultuous events unfolding in Spain during the Spanish Civil War. Feeling compelled to join the Spanish Republic and aid their fight against the Nationalists, 9 days after he acquired his passport, he and multiple other volunteers sailed on the Berengaria to Spain, arriving on July 31, 1937. Despite his optimistic attitude and courage to participate in the war, other Filipinos who chose to do the same were few and far between. Reports vary, but Republican Filipino volunteers ranged from 16 to 40, incomparable to many other groups who volunteered. However, he wasn&rsquo;t alone as the only Filipino American, as Manuel Lizarraga, Artemio Ortega Luna, Enrique Almenar Gabra, Modesto Ausobasa Esteban, Dimitri Gorostiaga, Eduardo Miranda Gonzales, Pedro Penino, Carlos Lopez Maestu, Mark Fajardo, and Aquilino Belmonte Capinolio all also traveled to Spain to fight. He served in the XV Brigade in the war, specifically with the Mackenzie&ndash;Papineau Battalion, Mac-Paps for short. Despite serving there for almost two years, he would only participate in the Battle of Gandesa. The war lasted from April 1-3, 1939, in which despite the prowess of the battalion, they would ultimately be defeated, and 140 British and American members were captured. Servando would be one of the soldiers captured, and he experienced harrowing acts of torture and interrogation. Miraculously, Mondragon was exchanged on April 22, 1939, one of the earliest repatriations following the battle. His subsequent return to the US, aboard the Manhattan, was met with immigration hurdles due to the absence of an immigration visa.<br />\r\n<br />\r\nUndeterred by the tribulations of war, Mondragon&#39;s resilience endured as he enlisted in the fight against fascism during World War II, serving as a merchant marine. His whereabouts are unknown after this point.</p>\r\n",
    "school_crests": [],
    "sources": "<p>Bacon, David. &ldquo;Human Rights Column: From Spain to Delano: The Radical Roots of Farm Workers Unions.&rdquo; The Volunteer, February 27, 2018.<br />\r\n<a href=\"https://albavolunteer.org/2018/02/human-rights-column-from-spain-to-delano-the-radical-roots-of-farm-workers-unions/\">https://albavolunteer.org/2018/02/human-rights-column-from-spain-to-delano-the-radical-roots-of-farm-workers-unions/</a>.<br />\r\n<br />\r\n&ldquo;Acevedo Mondrag&oacute;n, Servando.&rdquo; Sidbrint. Accessed June 7, 2024. <a href=\"https://sidbrint.ub.edu/en/print/content/acevedo-mondragon-servando\">https://sidbrint.ub.edu/en/print/content/acevedo-mondragon-servando</a>.<br />\r\n<br />\r\n&ldquo;Acevedo Mondragon, Servando.&rdquo; The Abraham Lincoln Brigade Archives, April 9, 2023. <a href=\"https://alba-valb.org/volunteers/servando-acevedo-mondragon/\">https://alba-valb.org/volunteers/servando-acevedo-mondragon/</a>.<br />\r\n<br />\r\nCBrooks. &ldquo;#4: Headquarters of the Filipino Student Christian Movement.&rdquo; Asian American History in NYC, July 15, 2013.<br />\r\n<a href=\"https://blogs.baruch.cuny.edu/asianamericanhistorynyc/?paged=4\">https://blogs.baruch.cuny.edu/asianamericanhistorynyc/?paged=4</a>.<br />\r\n<br />\r\n&ldquo;Battle of Gandesa.&rdquo; Wikipedia, May 19, 2024. <a href=\"https://en.m.wikipedia.org/wiki/Battle_of_Gandesa\">https://en.m.wikipedia.org/wiki/Battle_of_Gandesa</a>.</p>\r\n",
    "student_fname": "Ivan",
    "student_lname": "Cheng",
    "tags": [
        "Mackenzie-Papineau Battalion",
        "15th Brigade",
        "POW",
        "Seaman",
        "Filipino",
        "Immigrant",
        "Battle of Gandesa",
        "WWII Veteran",
        "Member of Communist Party"
    ],
    "volunteer_fname": "Servando Acevedo",
    "volunteer_images": [],
    "volunteer_lname": "Mondragon"
}