{
    "class": "2021",
    "data": "<p>Milan Zecovic (other spellings include Miljan Zeković, Zecevich, Zecevio, and Zecevigh) was born on October 10th, 1911 to Peter and Mary Zecovic in Gary, Indiana and would be raised there at 13-29 Delaware avenue. A city that was founded only a few years prior to his birth, Gary, Indiana experienced rapid growth as it was home to the steel plant Gary Works that his father likely worked at. By 1920 Gary, Indiana was nearly 30% foreign born all likely coming from Eastern European countries in pursuit of industry jobs during the Industrial Revolution. Milan&rsquo;s own parents were immigrants from Yugoslavia which today is split into seven countries. His last name and the fact that he also speaks Russian indicate his family was specifically from Serbia. Zecovic would only complete eight years of primary and middle school before presumably joining the work force.</p>\r\n\r\n<p>He would later move to New York City and live at 550 West 20th street where he would work as a seaman and be a charter of the National Maritime Union which fell under the Congress of Industrial Organizations. While working there he would make a yearly salary of $85 (about $1400 today). While he lived in New York he would be politically affiliated with the American Labor Party. Milan would be recruited for the war effort by Edward Lasky of unit 140 district 8 member of Chicago Builders. With aid from the communist party, he would arrive in Spain on July 27, 1937 aboard the Agullan citing in the Biografia de Militantes that his reason to join the war was in order to fight against Fascism.</p>\r\n\r\n<p>The Biografia de Militantes as well as the War Commissariat of the International Brigades, that he likely filled up prior to his departure from Spain, also revealed more personal facts about him. He states that he had not taken any classes on politics, and the newspapers he read the most were the Daily Worker, The Communist, and New Masses- all leftist publications. He also stated that the book he used to learn about the communist doctrine was the Fundamentals of Leninism. Many of his personal opinions were demonstrated in these documents too. For example, he states that the 13 Points of the Government of National Union, which outlined the government Spanish Republican Government&rsquo;s Premier Dr. Negrin wished to follow should the republic when the war, was the &ldquo;best thing that could happen&rdquo;. He also goes on to state that in his opinion the People&rsquo;s front policy in Spain is &ldquo;wonderful&rdquo; and that he has and never would have any positive interactions with Trotskyists. However, much of what he says in these personal statements should not be immediately believed since many of those fighting on the left who weren&rsquo;t pro-Stalin (Like those a part of the CNT and POUM) would often be purged, so he likely was motivated to ensure nothing he stated could be wrongly interpreted.</p>\r\n\r\n<p>After his arrival he was detached to an instruction unit for approximately a month and then dispatched to the 24th Battalion-15th Brigade. He would apply for membership in the Communist Party of the USA on November 6, 1937, stating in a letter that he would like to join because he agrees with their program and principles entirely. However, he wouldn&rsquo;t become an officially registered communist until March of 1938 while he was in Catalonia. In the War Commissariat, he states that he intended to specialize in using machine guns and other similar weaponry. The first battle he took part in was the Battle of Belchite, which was a Republican offensive intended to slow down Nationalist advancements in the north which also doubled as the republic using it to decrease Anarchist and POUM influence in the region by bringing in communist troops. It was here on September 5th, 1937, when he volunteered to try and bomb a barricade but was shot in the hand and twice near the left lung. He would spend two months in a hospital in Benicasim then in hospitals at Tarragona and Caldas for an undisclosed amount of time. During this time, his commanders would commend him for his bravery at the Battle of Belchite in December 1937. He would also fight in the Battle of Teruel, which was one of the bloodiest battles and a decisive win for Franco. Zecovic would be promoted to an infantry corporal because of his great fighting during this battle. Milan would also participate in the Aragon Offensive, Catalonia Offensive, and the Ebro Offensive which was the longest and largest battle of the war. He would be injured once more on the Serra de Pandols, likely during the Ebro offensive, on August 27, 1938 where he would suffer getting hit with shrapnel, a shell containing bullets or pieces of metal timed to burst short of impact, from a mortar, a lightweight muzzle-loaded weapon, to his legs.</p>\r\n\r\n<p>&nbsp;He arrived back to the United States on December 20th, 1938, aboard the Ausonia. However, prior to him leaving Spain his superiors wrote a report on his conduct throughout his service. The report states that although he was a great soldier at the front and preferred to be with Spanish comrades, he was politically very weak unstable, and he talked too much without thought. In a section provided for a supplementary explanation one of his superiors goes so far as to say &ldquo;[Zecovic is] a very contradictory character at all times. Undoubtedly means well but is absolutely unstable on any subject.&rdquo; It seems however that most of the positive comments come from one set of handwriting and the negative from another, indicating that perhaps these two superiors had very different interactions with Zecovic.</p>\r\n\r\n<p>After serving In Spain, Zecovic would spend a short while in America. Then, he would go on to&nbsp;enlist as a Merchant Marine during World War II. Unfortunately, on December 19, 1941, only a few days after the United States officially declared war on the axis forces, the hog Islander Prusa would be torpedoed into the Atlantic Ocean and Zecovic would die serving as bosun of the vessel.&nbsp;</p>\r\n",
    "school_crests": [],
    "sources": "<p>Merchant Marine casualties during World War II, name begins with XYZ. (n.d.). Retrieved from <a href=\"http://www.usmm.org/killed/xyz.html\" target=\"_blank\">http://www.usmm.org/killed/xyz.html</a></p>\r\n\r\n<p>Ink, S. (2020, May 14). Zecovic, Milan. Retrieved from <a href=\"https://alba-valb.org/volunteers/milan-zecovic/\" target=\"_blank\">https://alba-valb.org/volunteers/milan-zecovic/</a> Merchant Marine casualties during World War II, name begins with XYZ. (n.d.). Retrieved from <a href=\"http://www.usmm.org/killed/xyz.html\" target=\"_blank\">http://www.usmm.org/killed/xyz.html</a></p>\r\n\r\n<p>Archives of the Trades Union Congress. (n.d.). Retrieved from <a href=\"https://cdm21047.contentdm.oclc.org/digital/collection/scw/id/1997/rec/2\" target=\"_blank\">https://cdm21047.contentdm.oclc.org/digital/collection/scw/id/1997/rec/2</a></p>\r\n",
    "student_fname": "Anisa",
    "student_lname": "Palevic",
    "tags": [
        "KIA WWII",
        "Yugoslavian",
        "Battle of Belchite",
        "Battle For Teruel",
        "National Maritime Union",
        "Aragon Offensive",
        "Ebro Offensive",
        "Catalonia Offensive"
    ],
    "volunteer_fname": "Milan",
    "volunteer_images": [],
    "volunteer_lname": "Zecovic"
}