{
    "class": 2024,
    "data": "<p>\tRegina Gottfried was born on November 17, 1906 in Manhattan, New York City to Austrian parents Max Gottfried (1881-?) and Marie ‘Mary’ Reingold (1884-?). Her brother, Jacob Gottfried, was born in 1908, and their parents separated a few years later. Their half sister, Sylvia Gottfried, was born in 1910, followed by a half brother, Norman Murray Gottfried, in 1923.<br /> <br />\tGottfried was an avid student, lauded in the New York Herald for her $300 Class A Scholarship, a merit scholarship for students maintaining a grade point average over 90%, in college. As a senior in Washington Square College, an undergraduate program established by NYU in 1914 that primarily served commuter students, Gottfried was elected to join Phi Beta Kappa, an honorary scholastic fraternity. Gottfried graduated later that year in 1927. <br /><br />\tGottfried then took her passion for learning to Ithaca, New York, where she was one of three Cornell University students to participate in an American German Student Exchange Program sponsored by the Akademischer Austauschdienst. She studied literature at the University of Frankfurt, now called Goethe University, which was notable in that the founders wished to educate students in the “social question,” in addition to traditional schooling. The school maintained the first Marxist-oriented research center associated with a major German university, and its Marxist and Hegelian philosophies likely influenced Gottfried’s political ideology. <br /><br />Gottfried returned to the US and graduated from Cornell in 1929. She took a job as an office worker at a Jewish Theological Seminary in New York City and became a member of the Communist Party in December 1935. Gottfried’s religious and political beliefs drew her to join Reverend Herman F. Reissig and ten others in a delegation to visit Loyalist Spain on behalf of the North American Committee to Aid Spanish Democracy. Within the United States, this committee held mass meetings that raised thousands of dollars, hosted representatives of the Spanish democracy as speakers at major events and collected thousands of cases of food and supplies to send over to Spain. It is likely that Gottfried was involved in these efforts. <br /><br />Reissig’s delegation convened in Paris, France, and arrived in Spain on August 28, 1937, heading to Barcelona, Valencia, Madrid, Albacete and Murcia. They intended to evaluate the results of expenditure of American funds and determine how Americans may best contribute aid to the war effort. <br /><br />During the delegation’s period in Spain, the Republican government had relocated from Valencia to Barcelona (in late November of 1937) and the Siege of Madrid (1936-1939) was going on, post Battle of Jarama Valley and Battle of Brunete. While there is little reporting regarding the exact whereabouts of Reissig’s delegation, it is likely that Albacete was chosen as a destination because it was midway between Madrid and Valencia, allowing it to remain the headquarters of the International Brigades until the spring of 1938. Murcia, meanwhile, was likely chosen for its frequent reference in newspapers as the location of hospitals belonging to International Brigades. <br /><br />On July 23 and 24, 1938, the International Coordination Committee and Central Sanitaire Internationale held an International Relief Conference for Aid to Republican Spain in Paris, France. While Gottfried herself is not explicitly mentioned in news articles that covered this conference, The New York Age and The Tablet note that Reverend Herman F. Reissig and a group of “delegates of the… North American Committee” were in attendance, along with affiliates of the Communist Party. Given Gottfried’s political associations and her geographical proximity at the time, it is likely that she was a part of this event. Though the Spanish Civil War is often seen through the lens of soldiers in combat, Gottfried’s time as a delegate and supply contributions to the war effort highlight the extensive impact of the critical roles played by those beyond the battlefield. <br /><br />Gottfried returned to the US on September 24, 1938 aboard the President Harding. She married fellow veteran Jacob Joel Sternbach (1900-1987) on November 7, 1938 in New York City, but they were no longer together by 1940. Gottfried married Philip Erenhaus on June 14, 1948 in New York City. She passed away on February 20, 1988 in New York and was cremated in Fresh Pond Crematorium. </p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1vBUIotWiDEKAtOvkn7ly3VnYLyZcB_Wu",
            "src": ""
        }
    ],
    "sources": "<p>“A Brief History of New York University.” NYU, NYU, <a href=\"https://www.nyu.edu/faculty/governance-policies-and-procedures/faculty-handbook/the-university/history-and-traditions-of-new-york-university/a-brief-history-of-new-york-university.html\">https://www.nyu.edu/faculty/governance-policies-and-procedures/faculty-handbook/the-university/history-and-traditions-of-new-york-university/a-brief-history-of-new-york-university.html</a>. <br /><br />“Food Sought Here for Madrid Forces: Bishop McConnell Heads Drive For Supplies For Populace In Loyalist Areas Goal Set at 5,000 Cases Leaders Hope to Offset Loss From Destruction in Spain of Normal Sources.” New York Times Proquest. February 9, 1937. <br /><br />Britannica, T. Editors of Encyclopaedia. “Frankfurt School.” Encyclopedia Britannica. April 12, 2024. <a href=\"https://www.britannica.com/topic/Frankfurt-School.\">https://www.britannica.com/topic/Frankfurt-School.</a>  <br /><br />“ ‘Free Spain’ Not Dead, 10,000 at Rally Hear: Del Vayo Forecasts Eventual Rooting of Facism There.” New York Times Proquest. May 23, 1939.<br /><br />“Gottfried, Regina.” Abraham Lincoln Brigade Archive. <a href=\"https://alba-valb.org/volunteers/regina-gottfried/\">https://alba-valb.org/volunteers/regina-gottfried/</a>. <br /><br />“Gottfries, Regina.” SIDBRINT University of Barcelona. <a href=\"https://sidbrint.ub.edu/ca/content/gottfries-regina\">https://sidbrint.ub.edu/ca/content/gottfries-regina</a>. <br /><br />“N.Y.U Scholarships Are Awarded to 47: Grants for High Standing Total $8,250 – Girl Adds<br />Last Year’s Savings to Fund.” New York Times Proquest. October 17, 1926, <a href=\"https://www.proquest.com/historical-newspapers/n-y-u-scholarships-are-awarded-47/docview/103756307/se-2?accountid=36166\">https://www.proquest.com/historical-newspapers/n-y-u-scholarships-are-awarded-47/docview/103756307/se-2?accountid=36166</a>. <br /><br />“October 24, 1936 (Page 21 of 335.” Daily News Proquest. October 24, 1936. <br /><br />“Phi Beta Kappa Picks 17 Students at N.Y.U: Nine Girls Among Those Chosen At Washington Square College - Branch Installed there.” New York Times Proquest. April 9, 1927. <a href=\"https://www.proquest.com/docview/104019523/EE3B8DCDA4734B69PQ/2?accountid=36166&sourcetype=Historical%20Newspapers\">https://www.proquest.com/docview/104019523/EE3B8DCDA4734B69PQ/2?accountid=36166&sourcetype=Historical%20Newspapers</a>. <br /><br />“Spanish Civil War – Canadian ‘Mac-Pap’ Battalion.” Canadian Battlefield Tours. <a href=\"https://canadianbattlefieldtours.ca/spanish-civil-war-canadian-mac-pap-battalion-mackenzie-papineau/\">https://canadianbattlefieldtours.ca/spanish-civil-war-canadian-mac-pap-battalion-mackenzie-papineau/</a>. <br /><br />Wireless to The New York Times. “Americans to Visit Spain: Will Survey Work Being Done in Loyalist Area With U.S. Funds.” New York Times Proquest. August 19, 1937. </p>",
    "student_fname": "Sophianne",
    "student_lname": "Leung",
    "tags": [
        "delegate for North American Committee to Aid Spanish Democracy",
        "Austrian",
        "Washington Square College",
        "member of the Communist Party",
        "Jewish",
        "American German Student Exchange Program",
        "Phi Beta Kappa",
        "Cornell University"
    ],
    "volunteer_fname": "Regina",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1Qhflc0HGERTY6JlNpP9p6PQD0soAFxL6",
            "src": ""
        }
    ],
    "volunteer_lname": "Gottfried",
    "year_published": 2024
}