{
    "class": 2023,
    "data": "<p><br />Herman Abramowitz (Hyman Abramowitch) was born around 1910 and had a sister named Sophie Berlinder. He spent 2 years in the US Navy, worked as a dress cutter, and joined the Communist Party in 1934. Around this time, the Comintern (Communist International) worked to recruit American volunteers to fight in the Spanish Civil War. Those who did were instructed to apply for a passport and received uniforms and limited training. Abramowitz was one of these volunteers, and he obtained his passport in December of 1936. He had two addresses listed: 1448 40th Street, Brooklyn New York and Bronx, New York. The former was in Borough Park, a neighborhood populated with many Jewish immigrants. Given that his address was in a predominantly Jewish populated area and that his name was listed on the Jewish Virtual Library website as a possible Jewish volunteer, Abramowitz probably attended one of the numerous private yeshivas in the neighborhood that most Jewish children attended in place of public schools. Additionally, it is uncertain if he was part of the International Ladies’ Garment Workers’ Union (ILGWU), a labor union made up of garment workers and that was affiliated with the American Federation of Labor, but it is likely due to the presence of many Jewish immigrants and New Yorkers in the organization.<br /><br />Just 4 days after receiving his passport, Abramowitz and the other volunteers boarded the Normandie ship and arrived in Spain in 11 days. He served with the Abraham Lincoln Brigade with people from all over the world and was later promoted to First Sergeant.<br /><br />In February 1937, Francisco Franco ordered the Nationalist army, which included soldiers from the Army of Africa, to attack the valley of Jarama, in hopes of cutting off the main road between Madrid and Valencia after failing to overtake the capital. His goal was to stop vital supplies of food, fuel, and munitions from reaching the Republicans in Madrid. With the Republican Army, the International Brigade arrived just in time to halt the attack. In the face of elite soldiers equipped with weapons sent by Hitler and Mussolini, the fighters of the International Brigade were at a huge disadvantage; they lacked experience and proper training. Yet, they were eager and determined to fight against the idea of fascism and for Spanish democracy. In the end, both sides faced heavy losses, with 10,000 deaths on the Republican side and 5,000 on the Nationalist side.<br /><br />Unfortunately, Abramowitz was one of the many who were killed in action in Jarama. It was said that he was shot through the head while observing through the sights of a major general. There are different dates of death provided, but his cemetery record indicates April 5, 1937. Other dates include March 37, April 3, and May 12 of the same year. He was 27 when he died.</p>",
    "school_crests": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "sources": "<p>Gootman, Elissa. “Plans for a Public School Upset Brooklyn Hasidim.” The New York Times, February 3, 2006. <a href=\"https://www.nytimes.com/2006/02/03/nyregion/plans-for-a-public-school-upset-brooklyn-hasidim.html\">https://www.nytimes.com/2006/02/03/nyregion/plans-for-a-public-school-upset-brooklyn-hasidim.html</a>. <br />“History of the ILGWU.” Woman sewing in a garment shop. Accessed June 6, 2023. <a href=\"https://ilgwu.ilr.cornell.edu/history/index.html\">https://ilgwu.ilr.cornell.edu/history/index.html</a>. <br />Ink, Social. “Abramowitz, Herman.” The Abraham Lincoln Brigade Archives, May 24, 2022. <a href=\"https://alba-valb.org/volunteers/herman-abramowitz/\">https://alba-valb.org/volunteers/herman-abramowitz/</a>. <br />“Jarama: A Walk through the Valley of Death.” The Independent, March 17, 2011. <a href=\"https://www.independent.co.uk/news/world/europe/jarama-a-walk-through-the-valley-of-death-2244066.html\">https://www.independent.co.uk/news/world/europe/jarama-a-walk-through-the-valley-of-death-2244066.html</a>. <br />The Local. “Remembering the Battle of Jarama and the Role of the International Brigades in the Spanish Civil War.” The Local Spain, February 12, 2020. <a href=\"https://www.thelocal.es/20200212/remembering-the-battle-of-jarama-and-the-role-of-the-international-brigades-in-the-spanish-civil-war\">https://www.thelocal.es/20200212/remembering-the-battle-of-jarama-and-the-role-of-the-international-brigades-in-the-spanish-civil-war</a>. <br />Madrid No Frills. “Discover Bunkers, Trenches and One Man’s Life-Long Collection of Wartime Objects from the Jarama Valley.” Madrid No Frills, December 22, 2021. <a href=\"https://madridnofrills.com/jarama\">https://madridnofrills.com/jarama</a>. <br />“New Jarama Series.” The Volunteer, July 13, 2016. <a href=\"https://albavolunteer.org/2015/12/blast-from-the-past-new-jarama-series/\">https://albavolunteer.org/2015/12/blast-from-the-past-new-jarama-series/</a>. <br />Roane, Kit R. “For Jews around World, Borough Park Is the Place to Shop.” The New York Times, August 22, 1999. <a href=\"https://www.nytimes.com/1999/08/22/nyregion/for-jews-around-world-borough-park-is-the-place-to-shop.html\">https://www.nytimes.com/1999/08/22/nyregion/for-jews-around-world-borough-park-is-the-place-to-shop.html</a>. <br />Sugarman, Martin. Jews in the Spanish Civil War. Accessed June 8, 2023. <a href=\"https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war. </p>\">https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war. </p></a>",
    "student_fname": "Angel",
    "student_lname": "Chen",
    "tags": [
        "International Ladies' Garment Workers' Union (ILGWU)",
        "Communist Party",
        "Interbrigade (International Brigade)",
        "Passport",
        "Normandie",
        "List of Volunteers",
        "Communists"
    ],
    "volunteer_fname": "Herman",
    "volunteer_images": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "volunteer_lname": "Abramowitz",
    "year_published": 2023
}