{
    "class": 2025,
    "data": "<p>Louis Auerbach was born in Toronto, Canada on the first day of 1910. Born into a Jewish family, Auerbach moved to New York City at only two years old, becoming a naturalized citizen quickly. Although born in Canada, Auerbach was a New Yorker through and through. Auerbach lived in the South Bronx on 1487 College Avenue in a neighborhood full of other Jewish families. Jews in New York City at the time often held left-wing beliefs and this no doubt had an impression on Auerbach. Auerbach was a member of the Communist Party of the United States and espoused the same views of those in his neighborhood. <br />  <br /> These views and his membership to the party exposed him to what was going on in Spain and Auerbach made the long journey to Spain eager to aid in the fight against fascism. There are very few records concerning Auerbach and his time in Spain, but it’s clear that Auerbach was dedicated to fighting for what he believed in. Auerbach arrived in Spain in August 1937 and was sent to Albacete to join the 20th International Battalion. The 20th Battalion was incorporated into the 86th mixed brigade in April 1937 and would eventually cease to exist and simply become a part of the brigade in January 1938. With the brigade and the battalion, Auerbach would endure continued losses throughout the southern part of Castille-La Mancha.<br /><br /> Auerbach was not on the frontlines, his service mainly came from off of the battlefield. A dentist by training, Auerbach also helped keep the battalion running as a mechanic. Despite mainly working away from the battlefield, Auerbach could not escape the destruction of the war and was wounded in combat soon after arriving. Even though he survived, bad luck followed him, and he fell ill in February of 1938. Again, he would recover, but unfortunately the outcome of the war was becoming increasingly clear. He was sent back home in September 1938 aboard the Aurania, ending his tumultuous 13 month campaign in Spain.<br />  <br /> Auerbach would continue to fight fascism in the years following, as he would serve in the army during WW2. A letter from his brother Larry, who also served in WW2, asking for Louis’s mail to be delivered. There are no other records to provide insight into the rest of his life, but Louis Auerbach certainly left his mark. He dedicated his life to the fight against fascism and for this he will always be remembered.<br /></p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1KttMmxER7tRLHRfqjTMiGvGjjX4MdsDn",
            "src": ""
        }
    ],
    "sources": "<p>Accessed June 7, 2024.<br />Ink, Social. “Auerbach, Louis.” The Abraham Lincoln Brigade Archives, June 7, 2022. <a href=\"https://alba-valb.org/volunteers/louis-auerbach/\">https://alba-valb.org/volunteers/louis-auerbach/</a>. <br />Accessed June 7, 2024. Full text of \"International Solidarity with the Spanish Republic (1936-1939)\" <a href=\"https://archive.org/stream/IntSolidaritySpanishRepublic/Int%20Solidarity%20Spanish%20Republic_djvu.txt\">https://archive.org/stream/IntSolidaritySpanishRepublic/Int%20Solidarity%20Spanish%20Republic_djvu.txt</a>.<br />Auerbach, Larry. 1942. Letter from brother. Bronx, New York.<br />“Auerbach, Louis.” n.d. The Abraham Lincoln Brigade Archives. Accessed June 7, 2024. <a href=\"https://alba-valb.org/volunteers/louis-auerbach/\">https://alba-valb.org/volunteers/louis-auerbach/</a>.<br />Sugarman, Martin, and Arno Lustiger. n.d. “Jews in the Spanish Civil War.” Jewish Virtual Library. Accessed June 7, 2024. <a href=\"https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war#google_vignette\">https://www.jewishvirtuallibrary.org/jews-who-served-in-the-international-brigade-in-the-spanish-civil-war#google_vignette</a>.<br /></p>",
    "student_fname": "Christian",
    "student_lname": "Fourmaux",
    "tags": [
        "20th International Battalion",
        "Communist Party",
        "Mechanic",
        "WWII",
        "Bronx",
        "Canadian",
        "Albacete",
        "Jewish",
        "wounded",
        "86th Brigade"
    ],
    "volunteer_fname": "Louis",
    "volunteer_images": [
        {
            "caption": "",
            "src": ""
        }
    ],
    "volunteer_lname": "Auerbach",
    "year_published": 2024
}