{
    "class": 2024,
    "data": "<p>Albert Gottlieb, also known as Al Stone, was born on May 28th, 1909 on East 22nd Street in New York City. Gottlieb was born into a Jewish family and attended school at P.S. 1 on the Lower East Side. Gottlieb grew up and attended high school in New York City. From early in his young adult life, Gottlieb formed close ties with the Communist Party. He became a member of the Communist Party in 1925, at the age of 16, and joined the Youth Communist League a year later in 1926. His connections that he made within the Communist Party helped to grow his ideological conviction so he was eager to join the YCL. After graduating from high school, Gottlieb began work as a postal worker. <br /><br />Once the Spanish Civil War broke out overseas, Gottlieb was compelled to go join the fighters in Spain due to his strong communist ideology. On June 4, 1937, at the age of 33, set sail for Spain aboard the Stantendem, 16 days later Gottlieb arrived in Albacete, a small city in the southeast of Spain. After a few weeks, Gottlieb was relocated to work in Villa Paz as a part of the American Medical Bureau working at the American Hospital located there. Gottlieb did not have a medical background, but served as a political commissar — a role that involved political education and organization — for the hospital. Some of the hospital workers resented Gottlieb for his administrative role despite his lack of medical expertise.<br /><br />In one notable episode of drama during his time at Villa Paz, Gottlieb and his colleagues, Frederika Martin and Dr. Irving Busch, decided that a woman in the AMB, Salaria Kea, could not marry John O’Rielly so soon after the death of another AMB member, Oliver Law. The matter was complicated by the fact that after deciding to delay the wedding by a few weeks, Gottlieb, Martin, and Busch faced accusations of discrimination because O’Rielly and Kea were both black.<br /><br />Gottlieb was not satisfied with being removed from the action, and did not get along well with all of his colleagues. His strong ideological beliefs and internal disagreements caused him to want to be a part of the action, fighting on the front lines. Gottlieb requested a transfer away from the relative comfort of Villa Paz and ended up joining a machine gun unit that was a part of the Mackenzie Papineau Battalion. Gottlieb served with the Mac-Paps for a little under a year. He reached the rank of Sargento (sergeant.) With the Mac-Paps, Gottlieb fought in the Battle of Teruel, the retreats, and the Battle of the Ebro.<br /><br />On December 20, 1938, Gottlieb returned back to the US aboard the Austonia. Upon returning, Gottlieb opened a bookstore in San Mateo, California that specialized in law books. Gottlieb worked as an industry plant worker as part of Civilian Defense in World War II. Throughout his life, Gottlieb lived in Mexico, California, and New York. Gottlieb died on August 3, 2000.</p>",
    "school_crests": [
        {
            "caption": "https://drive.google.com/open?id=1dCD38pc9Z0e-y4LOU_YjZnnsZtjruJrb, https://drive.google.com/open?id=13RKYBWXgH6VtfTMYJQ6oq6uhosO41LaX, https://drive.google.com/open?id=1EknFCKPmvWWn9rz75amXcpR5nXluIM56",
            "src": ""
        }
    ],
    "sources": "<p>“Gottlieb, Albert.” The Abraham Lincoln Brigade Archives, August 25, 2022. <a href=\"https://alba-valb.org/volunteers/albert-gottlieb/\">https://alba-valb.org/volunteers/albert-gottlieb/</a>. <br />Martin, Fredericka. Letter to Al Stone, May 25, 1970. <br />Pita, Corinne. The Spanish Civil War’s Volunteers - Salaria Lillie Kea, 2020. <a href=\"https://scwnyc.stuy.edu/archive/Salaria%20Lillie%20Kea.html\">https://scwnyc.stuy.edu/archive/Salaria%20Lillie%20Kea.html</a>. <br />Stone, Albert. Letter to Fredericka Martin. San Mateo, California: 703 South St, February 28, 1980. </p>",
    "student_fname": "David",
    "student_lname": "Glick",
    "tags": [
        "American Medical Bureau",
        "Communist",
        "Mackenzie Papinau Battalion",
        "Jewish",
        "Commisar",
        "Communist Party USA",
        "Young Communist League"
    ],
    "volunteer_fname": "Albert",
    "volunteer_images": [
        {
            "caption": "https://drive.google.com/open?id=1oflP61DEQb7ZRYSy_eWfCSAVW3XH_07C",
            "src": ""
        }
    ],
    "volunteer_lname": "Gottlieb (Stone)",
    "year_published": 2024
}